[
  {
    "employer": { "name": "MKS Instruments, Inc.", "type": "Manufacturing" },
    "title": "Summer and Fall Undergraduate Co-op - Technical Product Specialist",
    "dates": {
      "posted": "Posted 3 months ago",
      "apply_by": "Apply by October 3, 2024 at 3 AM"
    },
    "wage": " $18–28/hr",
    "location": "Onsite, based in Irvine, California, United States",
    "position": {
      "length": "Part-time∙From May 6 to August 16",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for Technical Product Specialist in manufacturing, not aligned with candidate's desired positions in software engineering, web/app development, data analytics/science, or machine learning",
      "date": ""
    },
    "details": "Spectra-Physics, Ophir, Newport and ESI are brands within the MKS Instruments Photonics Solutions division. We provide a full range of solutions including lasers for precision industrial and scientific research applications, laser and LED measurement, beam profiling, precision motion control, optical tables and vibration isolation systems, photonics instruments, temperature sensing, opto-mechanical components, optical elements, and systems for flexible PCB laser processing, high-speed MLCC testing, and CO2-laser-based systems HDI PCB and IC substrate manufacturing. MKS Photonics Solutions enhance our customers’ capabilities and productivity in the semiconductor, advanced electronics and specialty industrial markets.Undergraduate Intern / Co-op Program Overview- 3 month or longer intern / co-op within a functional area of MKS Instruments that provides students a comprehensive and engaging experience from before your program starts to after the program ends.Meaningful work and project assignmentsNetworking opportunities with peers and executivesExposure to different divisions of the businessUnderstanding of MKS Instruments’ commitment to diversity, equity, and inclusion.If you're looking for a challenging experience in a technical/marketing environment, the Technical Product Specialist intern position will expose you to the latest precision motion technology that address difficult problems that make the world a better place. Help us introduce new products and communicate this to our customer base.We are looking for an exceptional Technical Product Specialist who can assist with new product introduction activities, edit marketing collateral (datasheets, videos, tech notes), review and edit web content, develop demos for tradeshows and customer evaluations, research on trends and competitors.What will you bring to the team, along with your curiosity:Qualified candidates must be US Persons.Rising Junior or Senior undergrad studentStudent majoring in Mechanical Engineering, Electrical Engineering, Aerospace, or Biomed20 to 40 hours per week, combination of remote and on-site workProficient with office software (e.g., Word, Excel, PowerPoint, etc.)Experience with Programming desirableExcellent written and oral communication skillsNormally receives little instruction on day-to-day work or general instructions on new assignmentsDetail oriented and able to work independentlyCompensation and Benefits:Hourly Pay Range: $18.00 to $28.00 per hour. This range is a good faith estimate of the expected salary range for this position, based on a wide range of factors including qualifications, experience and training, operational and business needs and other considerations permitted by law. At MKS, it is not typical for an individual to be hired at or near the top of the range for the role.Benefits: MKS offers a benefits package for interns/co-ops working at least 20 hours per week, including 11 paid holidays, sick time, and 15 paid vacation days accrued on a biweekly basis.MKS is an equal opportunity employer, including disability, veteran status and all categories protected by law. Please review our EOE statements for additional details.    #LI-MD2Globally, our policy is to recruit individuals from wide and diverse backgrounds. However, certain positions require access to controlled goods and technologies subject to the International Traffic in Arms Regulations (ITAR) or Export Administration Regulations (EAR). Applicants for these positions may need to be “U.S. persons.” “U.S. persons” are generally defined as U.S. citizens, noncitizen nationals, lawful permanent residents (or, green card holders), individuals granted asylum, and individuals admitted as refugees.MKS Instruments, Inc. and its affiliates and subsidiaries (“MKS”) is an affirmative action and equal opportunity employer: diverse candidates are encouraged to apply. We win as a team and are committed to recruiting and hiring qualified applicants regardless of race, color, national origin, sex (including pregnancy and pregnancy-related conditions), religion, age, ancestry, physical or mental disability or handicap, marital status, membership in the uniformed services, veteran status, sexual orientation, gender identity or expression, genetic information, or any other category protected by applicable law. Hiring decisions are based on merit, qualifications and business needs. We conduct background checks and drug screens, in accordance with applicable law and company policies.  MKS is generally only hiring candidates who reside in states where we are registered to do business.MKS is committed to working with and providing reasonable accommodations to qualified individuals with disabilities. If you need a reasonable accommodation during the application or interview process due to a disability, please contact us at: accommodationsatMKS@mksinst.com .If applying for a specific job, please include the requisition number (ex: RXXXX), the title and location of the role",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8854546?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "BILL", "type": "Financial Services" },
    "title": "Software Engineering Intern",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by November 30, 2024 at 5 AM"
    },
    "wage": " $44–62/hrMedical, dental, and vision coverage plus paid time off",
    "location": "Hybrid or onsite, based in San Jose, California, United States, or Draper, Utah, United States",
    "position": {
      "length": "Full-time∙From May 27 to August 8",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:43:06 AM"
    },
    "details": "Make your impact within a rapidly growing Fintech CompanyBILL is a leader in financial automation software for small and midsize businesses (SMBs). As a champion of SMBs, we are dedicated to automating the future of finance so businesses can thrive. Hundreds of thousands of businesses trust BILL solutions to manage financial workflows, including payables, receivables, and spend and expense management. With BILL, businesses are connected to a network of millions of members, so they can pay or get paid faster. Through our automated solutions, we help SMBs simplify and control their finances, so they can confidently manage their businesses, and succeed on their terms.BILL is currently recruiting for a Software Engineering Intern for Summer 2025. This position is based in San Jose, CA or Draper, UT. We’d love to chat if you have:A strong foundation of coding skills, and knowledge of:Front end - Javascript, Angular, ReactJSBack end - JavaFull Stack - Javascript, Ruby on Rails A growth mindset: an eagerness to learn to overcome unique coding challenges, and an interest in picking up new coding skills or technologiesStrong coding problem solving skillsA passion for engineering excellenceA customer centric mindset Requirements:Must be currently enrolled at an accredited university in the USGraduating with a Bachelor's degree in Computer Science or a related field between December 2025 and July 2026This position is hybrid in San Jose, CaliforniaAbout the BILL Intern Program:The BILL Summer Intern Program is full of fantastic opportunities to immerse yourself in our #incrediBILL culture and live our company values during your 11-week, paid experience. During your internship, you’ll own comprehensive projects that have real impacts on small-to-medium sized businesses, our products, and our employees, and you’ll be provided many mentorship and development opportunities along the way to foster a shared passion for SMBs. You’ll engage with leaders through our executive speaker series, and be immersed in our Employee Resource Group initiatives and events so you can get a feel of what matters most here at BILL. No matter which of our offices you’re based out of - San Jose, Houston, or Draper - you’ll experience our Fun value firsthand with Intern Nights Out and group events, and countless other chances to connect with your fellow interns. Sound like your kind of summer? Come join us.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9012672?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Chemistry and Biochemistry",
      "type": "Higher Education"
    },
    "title": "Chemistry Stockroom Student Assistant",
    "dates": {
      "posted": "Posted 1 week ago",
      "apply_by": "Apply by July 21, 2024 at 11 PM"
    },
    "wage": " $16/hr",
    "location": "Onsite, based in 3801 West Temple Avenue, Pomona, California 91768, United States",
    "position": {
      "length": "Part-time",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "More documents required",
      "date": "7/9/2024, 2:43:06 AM"
    },
    "details": "Stockroom Student Assistant - Chemistry Stockrooms in Building 3, 4 and 8Job DescriptionJob Title: Stockroom Student AssistantDepartment: Chemistry & BiochemistryPay rate: Current minimum wage ($16.00)Contact Person: Amanda ThierryPhone Number: 909-869-3666E-mail: amandah1@cpp.eduLocation: building 4, 1-445Please submit resume and Fall 2024 school schedule and include any hours you are not available to work during the Fall semester.Duties and Responsibilities:Overseeing window service during instructional labs (customer service), i.e. handing out equipment and glassware, answering phones; providing support to the technicians in weekly lab preparation, maintenance, changeovers and general clean up; prepare and maintain laboratory supplies, i.e. washing glassware, etc.; filing and data entry; accepting and distributing package deliveries; provide support for safety compliance; other duties may be assigned based on departmental needs.Minimum Qualifications / Skills Needed or Preferred: Dependability and punctuality is expected - failure to do so may lead to immediate dismissal; excellent communication and interpersonal skills – will be interacting regularly with students and faculty in a variety of situations; completion of a science laboratory course preferred but not necessary; flexible work hours – labs run Monday-Friday, start at 8 am and end at 6 pm or 7 pm and changes every 15 weeks. A minimum of a 2.0 GPA must be maintained.Federal Work Study eligible students are encouraged to apply. Note: All university employees working on campus, including student assistants, will be following COVID safety protocols as required by Cal Poly Pomona and LA County. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9084419?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Associated Students Inc.,",
      "type": "Higher Education"
    },
    "title": "Children's Center Office Assistant \"Student Position\"",
    "dates": {
      "posted": "Posted 3 weeks ago",
      "apply_by": "Apply by December 17, 2024 at 6 AM"
    },
    "wage": " $17.33/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for Children's Center Office Assistant, not related to software engineering, web/app development, data analytics/science, or machine learning",
      "date": ""
    },
    "details": "Work Schedule: 15-20 hours per week; shifts based on operational need of the organization. This position will be working on campus.OVERVIEWAssociated Students, Inc. employs student-focused professionals with equity-mindsets. Established in 1963, ASI is a non- profit corporation guided by a student board and managed by full-time professional staff. ASI is considered a part of the Cal Poly Pomona Division of Student Affairs with a dashed reporting line to Administrative Affairs. ASI serves the entire campus population, including over 27,000 students, by providing opportunities for student engagement, student employment, and a multitude of programs and services such as recreation and wellness, student union and activities, student government, and childcare. ASI operational support areas include human resources, financial services, information technology, facilities management, and marketing. ASI is engaged in the work of being a learning organization. Currently, the guiding ideas of the organization are “under construction” as the team re-imagines its vision, mission, and core values. ASI is looking for dynamic team members who value team learning, co-creation, and adaptability to best serve the needs of our students.The Cal Poly Pomona Children’s Center is a high-quality preschool program that is operated jointly through a partnership between the Associated Students Inc. (ASI) and Cal Poly Pomona. The Children’s Center opened in 1974 to help support student parents achieve their educational goals while attending Cal Poly Pomona. The Children’s Center places a high value on intentional and respectful relationships among staff, our families, and the children. Our full-time and part-time staff are an integral part of our program as they perform a variety of tasks related to maintaining the children’s Learning Environments, providing active supervision of the children, and providing professional office support so that the needs of families and CPP students providing services at the center are met.POSITION DEFINITIONUnder the general supervision of the Children’s Center Director and direct supervision of the Children’s Center Supervisor, the Children's Center Office Assistant provides general support of the day-to-day operation of the Children’s Center office administration. In addition to providing high level customer service, cash handling, and enrollment support for the Children’s Center, this position also provides project assistance, grant management tracking and reports.ESSENTIAL DUTIES Assists with the oversight of cash handling reconciliations for the Children’s Center office operationsPrepares accurate and timely reconciliations for all department-related credit cardsPrepares and manages accurate and timely grant-related tracking recordsPrepares and manages grant-related reports to support the operations of the Children’s CenterProvides high-quality customer service for the Children’s Center, including but not limited to, providing program information, appointment assistance, managing inquiries, and access controlMaintains cash drawer/safe and related responsibilities, including counting in/out, recording sales, and making change in the absence of an office administratorManages enrollment packets including but not limited to, distribution, completion assistance, and safeguarding collected informationAssists with program and services implementation, as neededEnforces policies and procedures for safeguarding minorsProvides emergency care and treatment as required until the arrival of emergency medical servicesAttends and engages in orientations, training, and developmentPerforms other related duties as assignedQUALIFICATIONSCertification in Pediatric CPR/AED and First Aid within 30 days of employment (provided by ASI)Experience (paid or unpaid) working with children 5 years and younger desirable.At least six months working in an office setting or demonstrated ability to follow complex instructions to produce administrative reportsDemonstrated ability to maintain confidentiality and a diplomatic, professional demeanorDemonstrated ability to provide friendly customer-oriented serviceAbility to perform accurate, detailed workAbility to work effectively in a team environmentAbility to perceive children’s needs and develop positive relationshipsAbility to communicate sensitive information with tact and considerationAbility to adapt willingly to frequent changes in activity, priorities, and/or work schedules.Ability to follow written and verbal instructionsAbility to anticipate and diffuse problems and disruptive situationsAbility to satisfactorily complete a background check (including a criminal records check)POSITION SENSITIVITY Based on the duties and responsibilities of this position, this position has been designated to be a sensitive position with access to sensitive data.  BACKGROUND CHECK A background check (including a criminal records check) must be completed satisfactorily before any candidate can begin employment with Associated Students, Inc., Cal Poly Pomona. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current ASI employees who apply for this position.EMPLOYMENT ELIGIBILITY Employment with ASI is open to any Cal Poly Pomona student who is at least 16 years old and of legal status to work in the United States. In addition, the employee must be currently enrolled for at least 6.0 units (undergraduate) and 4.0 units (graduate), international student employees must be enrolled in a minimum of 12.0 units (undergraduate) and 6.0 units (graduate) at the end of the drop-add period, have a minimum 2.0 GPA (both Cal Poly Pomona and overall GPA) and be in good standing with the University. Individuals enrolled only in Extended University are not eligible for hire. Exceptions to the unit load requirement are allowed during the summer and winter semesters and for students who have applied for graduation for the current semester.    WORK ENVIRONMENTWhile performing the duties of this job, the employee is frequently required to sit, talk and hear; manual dexterity, eye-hand coordination, and verbal communication; use of office equipment: telephones, calculator, copier and fax. Must be able to walk, stand, bend, and lift to 45 pounds.Position subject to an occupational exposure to bloodborne pathogens. Annual bloodborne pathogen training is required. The initial training must be completed before the employee is assigned duties that may result in exposure to blood or bodily fluids. Hepatitis B vaccination will be offered after the training.MANDATED REPORTING REQUIREMENT In compliance with the California Child Abuse and Neglect Reporting Act (CANRA) and the CSU Executive Order 1083, each ASI employee is designated as a mandated reporter and is required to sign an Acknowledgment of Mandated Reporter Status and Legal Duty to Report Child Abuse and Neglect. SYSTEMWIDE SMOKE AND TOBACCO FREE ENVIRONMENT EO 1108:  Cal Poly Pomona is a smoke and tobacco-free campus. Please refer to the link below for policy information. http://www.calstate.edu/EO/EO-1108.html COVID-19 VACCINATIONCSU, along with Associated Students Inc., strongly recommends all staff who are physically accessing campus facilities or programs to be fully vaccinated against COVID-19, which includes obtaining a COVID-19 booster dose. See policy at https://calstate.policystat.com/policy/11030468/latest. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9051870?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Center for the Advancement of Faculty Excellence (CAFE)",
      "type": "Higher Education"
    },
    "title": "Instructional Technology Assistant",
    "dates": { "posted": "Posted 1 week ago", "apply_by": "Applied" },
    "wage": " $18.50–20.50/hr",
    "location": "Hybrid, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙20 hours a week",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:43:05 AM"
    },
    "details": "Join the Studio 6 team! We are looking for students with good customer service skills, excellent communication skills, and curiosity and ability to learn a variety of computer systems.Summer hours availableRemote work available during summer term and semester breaksDevelop skills for your future career. This position is most relevant for future:educatorstechnical writerscomputer system adminsinformation scientistsengineerscomputer scientistsdata analystsOur ITAs have gone on to work for Amazon, Google, Accenture, the Federal Government, and more!Work study available but not requiredTraining providedJob DescriptionAn Instructional Technology Assistant’s (ITA) primary responsibility is to provide in-depth support to faculty and staff in using supported learning technologies, including Canvas, Zoom, Kaltura, Camtasia, Turnitin, iClicker, Microsoft Office, and more.Working hours are tailored around each student’s class schedule and the needs of CAFE.Daily responsibilities include:Handling help tickets, emails, phone calls, and in-person visits from faculty and staff. In-person assistance may be provided to faculty and staff members in Studio 6 (Bldg. 1, Room 205C) or their campus offices.Providing in-depth support for Canvas and other Learning Management Systems (LMS) as supported by the University. This includes using system administrative tools for testing, troubleshooting, and fulfilling faculty/staff requests.Creating, remediating, and providing training for the creation of accessible instructional materials (Word, PDF, PowerPoint, video captioning, etc.) for students with disabilities.Independently learning to use supported learning technologies through online tutorials, including LinkedIn Learning and other resources provided by CAFE.Creating tutorials and how-to instructions for various learning technologies.Collaborating with CAFE staff to complete projects and tasks as requested, including support for workshops/events.Qualifications & RequirementsApplicants must be:Current Cal Poly Pomona students, maintaining a GPA of 2.0 with at least 6 units in Fall 2023 and Spring 2024.Self-motivated and able to take initiative.Adaptable and interested in learning new technologies.Curious about troubleshooting problems and finding solutions.Clear and effective oral and written communicators.Customer service oriented.Able to maintain confidentiality.Comfortable working alone and with other people.Dependable and punctual.Willing to commit to working during Summer 2024.Work LocationStudents are expected to work in-person in Studio 6 (Building 1, Room 205C) during Fall and Spring semester. Remote work may be available during summer term and during semester breaks. Due to the potential for remote work, applicants must possess the following to be eligible for this position:Reliable computer (Mac or PC),Reliable speakers and microphone and/or headset, andStable internet connection.Preferred applicants have:Experience using Canvas from an instructor’s perspective (e.g., as a Teaching Assistant).Interest in technologies, including audio/video production and editing, website development, and graphic design.Knowledge of best practices for the creation of accessible digital documents (i.e., Section 508 Compliance).Working knowledge of Windows and Macintosh operating systems.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9080693?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Clearpol inc.", "type": "Internet & Software" },
    "title": "Frontend Developer",
    "dates": {
      "posted": "Posted 29 months ago",
      "apply_by": "Apply by July 15, 2025 at 4 PM"
    },
    "wage": " Unpaid",
    "location": "Remote or onsite, based in Los Angeles, California, United States",
    "position": { "length": "Part-time", "type": "Internship" },
    "application_status": {
      "applied": false,
      "reason": "Position is unpaid",
      "date": ""
    },
    "details": "This is a internship role for students in the fields of software engineering and web development.In this role you will:Develop responsive web front-end code using React to both rapidly create responsive web apps to meet end users' needs and create a modularized set of front-end components that make it easier to maintain and reuse for future capabilities and applications.We would love to hear from you if:You are currently enrolled in a BS, MS, or PhD degree program in Computer Science, Data Science, or in a related quantitative discipline. (NO RECENT GRADS, STUDENTS ONLY - your graduation date must be some time after the end of the internship)knowledge experience with UI and web technologies (HTML/CSS, JavaScript, etc.)In-depth experience with native javascript developmentExperienced with Python, Django, and data analytics ... and having artistic ability is a plus. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/5835778?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Brains & Motion Education",
      "type": "K-12 Education"
    },
    "title": "Instructor - After School Programs",
    "dates": {
      "posted": "Posted 3 days ago",
      "apply_by": "Apply by January 5, 2025 at 5 PM"
    },
    "wage": " $32/hr",
    "location": "Onsite, based in Montclair, California, United States",
    "position": {
      "length": "Part-time∙3 hours a week∙From August 16 to December 20",
      "type": "Job"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for an Instructor in After School Programs, not relevant to software engineering or data science roles",
      "date": ""
    },
    "details": "Instructor - After-School ProgramsAbout Brains and Motion Education:Are you ready to join Brains & Motion Education (BAM!) and be part of a team focused on unleashing the potential within every student? Brains and Motion Education is a leading provider of STEM, Arts and Sports for students ages 4 to 18. Our focus is on providing and preparing the next generation of leaders and innovators.At BAM!, we bring together top-notch instructors and exciting content in local schools and communities, offering students year-round opportunities to grow and explore their interests. Learning isn't just about knowledge - it's about having fun and making lasting memories!Our on-campus programs are conveniently located at schools and universities, providing a safe environment where students can thrive, learn, and have fun with their friends.  In just four years, BAM! has partnered with over 350 schools and academic institutions nationwide, impacting the lives of more than 25,000 students through our after-school programs and seasonal camps.If you're ready to make a meaningful impact, consider joining us in shaping the future of learning. Apply today!Job Description:Are you eager to use your expertise in STEAM or sports to make a meaningful impact? Do you want to gain valuable experience in an educational setting while imparting your knowledge to young, eager minds? If so, we want you to join our team as a STEAM and Sports Instructor! This role offers a unique opportunity to apply your subject matter expertise in a real-world environment, fostering creativity, teamwork, and personal growth among students. Ideal for those passionate about teaching and looking to build their experience in an engaging and supportive setting.In this role, you will:Lead and inspire students in a variety of Chess and Robotics classes, expanding their imaginations and skill sets.Teach the fundamentals of various activities, from basic to advanced levels, ensuring each child can progress at their own pace.Foster a positive and collaborative environment, instilling valuable lessons in teamwork and sportsmanship.Implement BAM! STEAM/Sports Programs, including Python & Scratch Coding, Robotics, LEGO Robotics, Math, Literacy, Creative Writing, Digital Arts, Game Design, Creative Arts, Music, Animation, Basketball, Soccer, Tennis, Street Hockey, Flag Football, Cheerleading, and more.Qualifications:1-2 years of experience in Chess and Robotics subject areas, with a strong passion for sharing your expertise with youth.A genuine enthusiasm for teaching and mentoring (coaching/teaching experience is highly encouraged).Excellent class management skills and the ability to work effectively with students in grades K-8.Reliable transportation and a valid driver’s license or State ID.Ability to pass a background check.Successful candidates must undergo and provide proof of negative TB testing.Willingness to undergo additional training as required.Ability to lift and carry approximately 20-50 lbs. occasionally, with or without accommodations.Details:Wage: 32/hourJob Type: Part-TimeAvailability: Tuesdays and Thursdays 2:45PM - 4PM | August 2024 - December 2024Brains and Motion Education is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, physical or mental disability, age, veteran status, or any other basis protected by federal or state or local law.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9092233?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Splunk", "type": "Internet & Software" },
    "title": "User Experience Research Ops Intern/Co-op (US - Remote, Fall 2024)",
    "dates": {
      "posted": "Posted 1 week ago",
      "apply_by": "Apply by July 31, 2024 at 4 AM"
    },
    "wage": " $31/hrMedical, dental, and vision coverage",
    "location": "Remote, based in United States",
    "position": {
      "length": "Full-time∙From September 3 to December 13",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:43:11 AM"
    },
    "details": "Splunk is here to build a safer and more resilient digital world. The world's leading enterprises use our unified security and observability platform to keep their digital systems secure and reliable. While customers love our technology, it's our people that make Splunk stand out as an amazing career destination and why we've won so many awards as a best place to work. If you become a Splunker, we want your whole, authentic self, what we call your \"million data points\". So bring your work experience, problem-solving skills and talent, of course, but also bring your joy, your passion and all the things that make you, you.Role SummaryYou will experience Splunking and what defines our culture while honing the skills which separate our development teams from others. As a member of the Research and Insights team you will have the opportunity to learn about building processes, practices and systems that empower a team of Researchers and their partners (Designers, Product Managers and Engineers) to do their best work.This role is for anyone who loves to find problems to solve in how people work, collaborate and find information and to come up with better, simpler solutions that help us work smarter.Maybe you're the kind of person who has thought \"I could use this tool for something different\" and then made it happen. Maybe you are the one who gets others organized to achieve common goals. Maybe you've observed a real world problem and created a smart system that addressed that issue in a way that's repeatable.What you'll get to doLearn about the exciting new field of Research Operations through direct mentoring, shadowing and helping out with a range of brand new initiatives that help put people at the center of technology. Example projects could include helping design a research library (one place where all Splunkers can find insightful information about our customers) or building a suite of templates to allow as many Splunkers as possible to talk to customers.Be responsible for project from start to finish that supports to goals of the Research and Insights team and the Research Operations strategy with supervision.Be mentored by Partner with UX Researchers, with Program Managers.Must-have QualificationsActively pursuing a Bachelors, Master's, or PhD in any field.At least one semester/quarter remaining to complete after the internship.Available to work 40 hours a week for 15 weeks.Nice-to-have QualificationsWe’ve taken special care to separate the must-have qualifications from the nice-to-haves. “Nice-to-have” means just that: Nice. To. Have. So, don’t worry if you can’t check off every box. We’re not hiring a list of bullet points–we’re interested in the whole you.We are especially interested in applications from folks from a community that has been systemically excluding from the tech sector (any major) or folks pursuing Library Sciences, Humanities, Social Sciences or Arts.Highly organized. You stay on top of what needs to get done.Curious. You always want to know 'why?' and you are interested in what makes other people tickCollaborative. You know you don't have all the answers and want to get things done together with others.It helps if you have some understanding of what UX Research is and if you believe in the power of knowledge and science to help people make better decisions.Splunk is an Equal Opportunity EmployerAt Splunk, we believe creating a culture of belonging isn’t just the right thing to do; it’s also the smart thing. We prioritize diversity, equity, inclusion, and belonging to ensure our employees are supported to bring their best, most authentic selves to work where they can thrive. Qualified applicants receive consideration for employment without regard to race, religion, color, national origin, ancestry, sex, gender, gender identity, gender expression, sexual orientation, marital status, age, physical or mental disability or medical condition, genetic information, veteran status, or any other consideration made unlawful by federal, state, or local laws. We consider qualified applicants with criminal histories, consistent with legal requirements.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9054246?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Associated Students Inc.,",
      "type": "Higher Education"
    },
    "title": "Operations Assistant Supervisor \"Student Position\"",
    "dates": {
      "posted": "Posted 2 weeks ago",
      "apply_by": "Apply by December 24, 2024 at 6 AM"
    },
    "wage": " $18/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for Operations Assistant Supervisor, not related to software engineering, web/app development, data analytics, or machine learning",
      "date": ""
    },
    "details": "Work Schedule: 15-20 hours per week; shifts based on operational need of the organization. This position will be working on campus with the potential of performing some work hours remotely (from home) and also includes working during academic breaks. OVERVIEWAssociated Students, Inc. employs student-focused professionals with equity-mindsets. Established in 1963, ASI is a non-profit corporation guided by a student board and managed by full-time professional staff.  ASI is considered a part of the Cal Poly Pomona Division of Student Affairs with a dashed reporting line to Administrative Affairs. ASI serves the entire campus population, including over 27,000 students, by providing opportunities for student engagement, student employment, and a multitude of programs and services such as recreation and wellness, student union and activities, student government, and childcare. ASI operational support areas include human resources, financial services, information technology, facilities management, and marketing.  ASI is engaged in the work of being a learning organization. Currently, the guiding ideas of the organization are “under construction” as the team re-imagines its vision, mission, and core values. ASI is looking for dynamic team members who value team learning, co-creation, and adaptability to best serve the needs of our students.The Bronco Recreation and Intramural Complex (BRIC) Operations team is one of the largest departments in all of Campus Recreation. Operations consist of three teams that oversee equipment maintenance, pool operations, building and member safety and providing outstanding customer service to our members and guests. Operation's primary function is to keep the building open and operational but also plays a significant role in enhancing the facility through purchasing new equipment for members to use as well as improving the overall functionality of the building. Operations provides an excellent opportunity to be a part of a large community of fellow student employees as well as develop a strong network through day-to-day interactions with colleagues and members.POSITION DEFINITIONUnder general supervision from the BRIC Operations Manager, the Operations Assistant Supervisor oversees the daily operations in the BRIC and acts as the Assistant Supervisor for the Operations Staff. The Operations Assistant Supervisor performs routine and complex assignments requiring specialized knowledge, prior relevant experience, and moderate independent judgment and decision-making. Assist with the overall management of the Bronco Recreation and Intramural Complex’ (BRIC) day-to-day operations. ESSENTIAL DUTIES Assist with the overall management of the Bronco Recreation and Intramural Complex’ (BRIC) day-to-day operations and special event shiftsAssist with development, coordination, and management of operations attendant staff schedulesAssist with interviewing, hiring, onboarding, training, developing, and coaching operations staffAssist with the management of multiple projects and assisting service area to meet required deadlinesAssist with development and implementation of operational strategiesEnforce rules and regulations regarding BRIC useProvide emergency care and treatment as required until the arrival of emergency medical servicesPresent professional appearance and attitude always, and maintain a high standard of customer serviceBe familiar with all operations positions in the BRIC to fill in, if needed.Report and follow up on basic facility and equipment operational maintenancePrepare and maintain appropriate activity reportsAttend and assist in development and execution of orientations and trainingsPerform other related duties as assignedQUALIFICATIONSCurrent American Red Cross Administering Emergency Oxygen, and CPR/AED for the Professional Rescuer certifications (Employment offer contingent on obtaining certification within 30 days of hire, training provided by ASI)Current American Red Cross First Aid for Public Safety Personnel (Title 22) (Employment offer contingent on obtaining certification within 30 days of hire, training provided by ASI)Experience working in a fitness, recreation, or similar environmentAbility to react calmly and effectively in emergency situationsAbility to follow routine verbal and written instructionsAbility to effectively communicate clearly and concisely, both verbally and in writingAbility to maintain professional work conductAbility to make independent decisions and make recommendationsAbility to adhere to work rules, follow directions, use time effectively and work productively without close supervisionDemonstrated ability to work with a diverse student population and campus communityAbility to operate a computer workstation using word processing, spreadsheet, and other computer applicationsAbility to satisfactorily complete a background check (including a criminal records check)POSITION SENSITIVITY Based on the duties and responsibilities of this position, this position has been designated to be a sensitive position with access to sensitive data.    BACKGROUND CHECK A background check (including a criminal records check) must be completed satisfactorily before any candidate can begin employment with Associated Students, Inc., Cal Poly Pomona. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current ASI employees who apply for this position. EMPLOYMENT ELIGIBILITY Employment with ASI is open to any Cal Poly Pomona student who is at least 16 years old and of legal status to work in the United States. In addition, the employee must be currently enrolled for at least 6.0 units (undergraduate) and 4.0 units (graduate), international student employees must be enrolled in a minimum of 12.0 units (undergraduate) and 6.0 units (graduate) at the end of the drop-add period, have a minimum 2.0 GPA (both Cal Poly Pomona and overall GPA) and be in good standing with the University. Individuals enrolled only in Extended University are not eligible for hire. Exceptions to the unit load requirement are allowed during the summer and winter semesters and for students who have applied for graduation for the current semester.    WORK ENVIRONMENTWhile performing the duties of this job, the employee is frequently required to sit, talk, and hear; manual dexterity, eye-hand coordination, and verbal communication; use of office equipment: telephones, calculator, copier, and fax. Must be able to walk, stand, bend, and lift up to 45 pounds.Position subject to an occupational exposure to bloodborne pathogens. Annual bloodborne pathogen training is required. The initial training must be completed before the employee is assigned duties that may result in exposure to blood or bodily fluids. Hepatitis B vaccination will be offered after the training.MANDATED REPORTING REQUIREMENT In compliance with the California Child Abuse and Neglect Reporting Act (CANRA) and the CSU Executive Order 1083, each ASI employee is designated as a mandated reporter and is required to sign an Acknowledgment of Mandated Reporter Status and Legal Duty to Report Child Abuse and Neglect. SYSTEMWIDE SMOKE AND TOBACCO FREE ENVIRONMENT EO 1108:   Cal Poly Pomona is a smoke and tobacco-free campus. Please refer to the link below for policy information. http://www.calstate.edu/EO/EO-1108.html COVID-19 VACCINATIONCSU, along with Associated Students Inc., strongly recommends all staff who are physically accessing campus facilities or programs to be fully vaccinated against COVID-19, which includes obtaining a COVID-19 booster dose. See policy at https://calstate.policystat.com/policy/11030468/latest. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9066884?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Honda", "type": "Automotive" },
    "title": "Data Management and Analysis Co-op/Intern – Spring 2025",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by November 1, 2024 at 3 AM"
    },
    "wage": " $20.45–27.42/hr",
    "location": "Onsite, based in Torrance, California, United States, Lincoln, Alabama, United States, +5",
    "position": {
      "length": "Full-time∙From January 20 to April 25",
      "type": "Cooperative Education"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is not in the desired location and does not specify a remote option",
      "date": ""
    },
    "details": "Data Management and Analysis Co-op/Intern – Spring 2025 This job description reflects potential openings for the Spring 2025 Co-op/Internship Session (January - April). This is a general job description and represents multiple openings in various departments. Honda offers both single and multi-semester co-ops and internships. College students must apply to the requisition pertaining to their major and semester of interest. Please note: Sponsorship for employment visa status for these positions is unavailable. Applicants requiring sponsorship for employment visa status now or in the future (e.g., F-1 CPT/OPT, H-1B, TN, etc.) will not be considered. Honda Co-operative and Learning InternshipsHere at Honda, we pride ourselves in the invaluable experience we provide our Co-ops and Interns with. Honda Co-ops/ Interns are tasked with hands on, project based worked relevant to their department of placements current needs (this means no coffee runs or stereotypical intern duties). Projects may be as large as developing a new test, designing systems, traveling to suppliers or serving as a project manager! In addition to the full-time associate work that our Co-ops/ Interns are given the access to work on, Honda Co-ops/ Interns are invited to participate in a variety of paid work events and experiences offered by the Honda Co-op and Internship program team. Events include but are not limited to Q&A sessions with high level associates, tours of various Honda facilities, social events, volunteer opportunities and much more! Dreams l Joy l Passion l Respect l Challenging SpiritThe ideal Honda Co-op/ Intern candidate feels connected to our core values and is looking to make an impact within a global organization with all 7 continents running Honda equipment or vehicles (yes, even Antarctica). You are a dreamer and often identify areas of opportunity and take initiative to improve them yourself. You are passionate about your work and respect others. You want to be a part of something larger than you- the joy of creating, selling and buying! These values define Honda and encapsulate our rich history and what continues to push us forward in a competitive era of mobility. It’s a big team for a big effort, and we need individuals with varying perspectives to make our products great. Because different people, with different perspectives and ideas are the key to helping Honda bring the future! More about the Data Management and Analysis Co-op/ Intern at HondaThe below descriptions reflect potential environments and duties within our various Data Management and Analysis Co-op/ Intern positions that we offer. Work environments and projects may include but are not limited to:ManufacturingWorking with various manufacturing departments and production control teams to develop required reports for department project roll-outsInterface with appropriate upper management and production leadership to determine musts and wants for project data and reporting functionsDesign, create and issue appropriate production associate reporting paperwork within the ISO framework for areas as neededSupport development of operation standards and/ or training materials for project implementation What you need to be successful in this roleRequired:Legally authorized to work in the U.S. without sponsorshipBasic Business courseworkMinimum 2.5 Cumulative GPA or higher (You will be required to provide your current transcript)Class status- Sophomore (by credit hour) or aboveAvailability to work a minimum of 10 weeks at 40 hours per weekEnrollment in a Bachelor's or Master's degree program studying Data Analytics, Business, or related fieldValid U.S. Driver's License (exceptions considered on a case-by-case basis)Ability to secure own transportation to and from work each day*Public transportation and ride share services are limited in some of our locations.  Co-ops are responsible for securing their own transportation to and from work each day, and must have a reliable plan for transportation in order to be eligible for a position. Regular in-person attendance is required, and transportation issues will not be excused.Desired:Programming with languages like Python, R or Java, Data Management or modeling, Data Mining, Visual Analytics, Statistics Position LocationsData Analytics Co-op/ Intern positions are offered in the cities/ states listed below, if you are selected to move forward in the process, you will be given the opportunity to make selections on your location preferences:Anna, Ohio (45 minutes north of Dayton, Ohio)Raymond, Ohio (45 minutes northwest of Columbus, Ohio)Marysville, Ohio (45 minutes northwest of Columbus, Ohio)Lincoln, Alabama (45 minutes northeast of Birmingham, Alabama)Torrance, CA (30 minutes south of Downtown Los Angeles)East Liberty, Ohio (55 minutes northwest of Columbus, Ohio) Honda Co-operative and Learning Internships Program BenefitsHousing Accommodations: Honda offers housing at a shared cost or a housing stipend based on location for our Co-ops and Interns. It is not required to opt-in to but is available should you need housing at the time of your Co-op/ Internship with Honda.Textbook Reimbursement: If applicable.Honda Business Resource Groups: One of the ways Honda gives diversity a voice is through its business resource groups. The associate-led, company-supported groups have members aligned across different dimensions of diversity such as gender, ethnicity, ability, life stage and experiences. The groups provide networking opportunities, a chance to give back and professional development. Some groups have even given feedback on Honda products, making them more appealing to all. Embracing all views is what will drive us into the future. Honda wants passionate, driven people to be a part of that future.Performance Feedback: Honda Co-ops and Interns will have the opportunity to receive informal and formal feedback from their leaders, ask questions and express future interest in a scheduled mid-term and final evaluation.Mentorship: Each Co-op/ Intern is assigned a mentor in your department to help you navigate your time at Honda.On-site Wellness Center: Co-ops and Interns have access to join our Wellness Centers (varies by location). Our Wellness Centers are full gyms equipped with cardio machines, weights, basketball courts, pools, dieticians, personal trainers and group fitness classes.Paid overtime: Co-ops and Interns will receive 1.5 times their hourly rate of pay for any overtime worked.Hourly Wage Range: $20.45-$27.42Pay will be based on several variables that include, but not limited to, geographic location, work experience, education, etc.Consideration for full time employment: Our Cooperative Learning Internships program is utilized as a talent pipeline for our full-time positions!Additional details regarding Honda Co-op and Intern benefits are provided upon offer.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9031940?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Finta", "type": "Internet & Software" },
    "title": "Software Engineering Internship - A.I. iOS App",
    "dates": {
      "posted": "Posted 3 days ago",
      "apply_by": "Apply by August 30, 2024 at 3 AM"
    },
    "wage": " $15–20/hr",
    "location": "Remote, based in United States",
    "position": {
      "length": "Part-time∙10 hours a week∙From September 2 to December 20",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "More documents required",
      "date": "7/9/2024, 2:43:17 AM"
    },
    "details": "OverviewAre you a college student with computer science experience who's looking for the ultimate internship experience? Look no further than Finta, an innovative AI driven copilot for private companies to fundraise capital from investors, and we're looking for an ambitious, curious, and entrepreneurial-minded intern to join our team. About us and the roleFinta is a cloud-based deal room platform that aims to improve the fundraising experience for entrepreneurs and help them grow their companies more efficiently. Finta's mission is to \"Help Founders Improve The Lives Of One Billion People\" by providing a secure platform that enables teams to improve deal workflow, insights, and speed. Finta is built by a team with years of experience helping hundreds of entrepreneurs start their dream company. As a Finta intern, you'll be working on cutting-edge technology that will change the way founders raise capital, working alongside a talented team of experienced professionals who are dedicated to helping you learn and grow and passionate about what they do. Our remote-first work culture means that you can work from anywhere and have the flexibility to fit your work around your schedule. We're a team that values collaboration, creativity, and innovation, and we're excited to welcome someone who shares our passion for pushing the boundaries of what's possible in the tech industry.We believe in providing our interns a supportive and inclusive environment where everyone is encouraged to share their ideas and opinions. You'll have the opportunity to work on a variety of projects and gain hands-on experience with the latest tools and technologies. And because we know that everyone has different learning styles, we'll work with you to develop a personalized learning plan that will help you achieve your goals.At Finta, we're passionate about helping founders improve the lives of one billion people. As a member of our team, you'll have the opportunity to meet with members of the startup community, from first-time entrepreneurs to successful CEOs, and develop an understanding of the company building process. You'll be executing on the product roadmap, defining and building new product features, and helping to build a culture of engineering excellence.Weekly commitment: 10 hours.Please note that this internship is available for college credit. We encourage all applicants to speak with their academic advisor or career services office to confirm eligibility and requirements for receiving credit. Upon acceptance of the position, we will work with you and your institution to ensure that all necessary documentation is completed to receive credit for the internship.﻿ QualificationsWe're looking for someone who is passionate about technology, with a strong background in computer science and a desire to learn and grow. You should have experience with programming languages such as Javascript, React and Swift, as well as a solid understanding of web development technologies like HTML, CSS, Google Cloud, and Firebase Firestore. Familiarity with LangChain and the Open AI API's.But more importantly, we're looking for someone who is excited about the possibilities of what we can achieve together with a strong sense of ‘WHY’. We want someone who is open to new ideas and willing to take risks, someone who isn't afraid to fail and is always looking for ways to improve. SkillsAs a Finta intern, you'll be part of a team that is committed to helping you succeed. We're looking for someone with a strong propensity towards taking action,love for building and creating new concepts,an innate ability to prioritize, and excellent written communication skills,an ability to work in a remote setting with diverse teamsBeing comfortable with critical feedback How to apply To apply for this position, please include a cover letter that includes a paragraph on why you'd like to work with Finta and a second paragraph that tells us about the most entrepreneurial thing you've ever created. At Finta, we believe that our interns are the future of our company, and we're excited to help you grow and succeed. Come join the most exciting startup in the industry and experience the best internship of your life!",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9092877?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - University Housing Services",
      "type": "Higher Education"
    },
    "title": "Residence Life Team Student Assistant",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by August 30, 2024 at 6 AM"
    },
    "wage": " $16/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙From August 22 to May 30",
      "type": "On Campus Student Employment"
    },
    "application_status": { "applied": false, "reason": "", "date": "" },
    "details": "Residence Life Team Student Assistant Department Overview: University Housing Services {UHS} is a residential community with 12 buildings. The department is comprised of three areas: Residence Life, Facilities, and Business Services. The Residence Life Team {RLT} includes the Director, 3 Senior Coordinators, 2 Coordinators, 7 Area Coordinators, and approximately 90 Student Leaders.  The RLT Student Leader will assist the Director with various administrative tasks. An exemplary candidate will possess the following qualifications - excellent people/customer service skills; basic computer skills desired; word processing and spreadsheet experience preferred. Must be punctual and report to work as scheduled.  Job Description: Maintain knowledge of processes and procedures related to University Housing ServicesDaily interaction with students, parents/guardians, faculty, staff and administratorsSpecial projects assignedMaintain confidential informationBasic usage of StarRez (student housing database)Available for special events and programmingPosition Compensation & Parameters:   Currently enrolled undergraduate or graduate student, full or part-time for 2024 – 2025 school yearWork Hours: Up to 20 hours a weekPay Rate: $16.00 per hour As part of the hiring process, once a student accepts an offer for employment, the department will conduct a soft background check. This background check includes verifying GPA and grades, a conduct inquiry, and calling references to confirm employment history and/or ask about performance. The employment offer is contingent upon receipt of satisfactory verification of information.  For questions or concerns, email JD Dantzler at uhsls@cpp.edu and include \"RLT Student Assistant\" in the subject line {response turnaround is a minimum of three business days}. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8987766?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Intercollegiate Athletics",
      "type": "Higher Education"
    },
    "title": "CPP Billy Bronco Mascot",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by July 31, 2024 at 6 AM"
    },
    "wage": " $16/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙From August 22 to May 16",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for a mascot role, not related to software engineering, web/app development, data analytics/science, or machine learning.",
      "date": ""
    },
    "details": "OVERVIEW: The Cal Poly Pomona mascot known as Billy Bronco will work with the Assistant Director, Marketing and Creative Services within the Bronco Intercollegiate Athletics Department. Billy Bronco represents Cal Poly Pomona Intercollegiate Athletics home games and community appearancesDUTIES: This position performs as Billy Bronco at Cal Poly Pomona Intercollegiate Athletics home games and community appearances; Remains in character while wearing the costume; Represents Cal Poly Pomona Intercollegiate Athletics mission and core values in a positive and friendly manner through performances at on and off-campus events; Commits to the assigned schedule of Billy Bronco appearances at on-campus and off-campus events; Interacts, in character, with Cal Poly Pomona students, faculty, staff, parents & families, children, alumni, and communities’ members; Works events throughout the year, including summers, evenings and weekends, as applicable; Distributes Cal Poly Pomona promotional items designed to create goodwill and increase school spirit; Poses for photographs and communicates without speaking as directed; Interacts with Billy Bronco fans on Cal Poly Pomona Intercollegiate Athletics official social networking sites. SKILLS:Must possess required skills and be able to explain and demonstrate, with or without reasonable accommodations, that the essential functions of the job can be performed.Outgoing and creative personality with a willingness and desire to have fun.Ability to perform wacky promotional activities in front of audiences.Ability to work scheduled event dates, including evenings, weekends and during university breaks if necessary. RECOMMENDED WORK TRAITS: Must possess required skills and be able to explain and demonstrate, with or without reasonable accommodations, that the essential functions of the job can be performed.Outgoing and creative personality with a willingness and desire to have fun.Ability to perform wacky promotional activities in front of audiences.Ability to work scheduled event dates, including evenings, weekends, and during university breaks if necessary. JOB REQUIREMENTSMust be able to wear the Billy Bronco costume comfortably and support the weight of the costume for extended periods of time.Ability to lift and move 50 pounds without assistance.Must have good posture and physical ability to perform Billy Bronco actions (i.e. standing, running, kneeling, reaching, jumping, bending, waving hands/arms, etc.).Work is performed in and out of doors, with exposure to varying temperatures.Current Cal Poly Pomona student, enrolled in credit classes at least three quarters per academic year.Maintain a cumulative Cal Poly Pomona GPA of 2.0 or higher.Be in good academic standing with the university and not subject to university discipline per the Student Handbook. HOURS: Prefer someone with the ability to work evenings and weekends. (about 10-20 hours/week when in season)  ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9014699?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Associated Students Inc.,",
      "type": "Higher Education"
    },
    "title": "Projects and Operations Assistant \"Student Position\"",
    "dates": {
      "posted": "Posted 2 weeks ago",
      "apply_by": "Apply by December 24, 2024 at 6 AM"
    },
    "wage": " $17.33/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:43:17 AM"
    },
    "details": "Work Schedule: 15-20 hours per week; shifts based on operational need of the organization. This position will work primarily in-person with the opportunity to work remotely.OVERVIEWAssociated Students, Inc. employs student-focused professionals with equity-mindsets. Established in 1963, ASI is a non- profit corporation guided by a student board and managed by full-time professional staff. ASI is considered a part of the Cal Poly Pomona Division of Student Affairs with a dashed reporting line to Administrative Affairs. ASI serves the entire campus population, including over 27,000 students, by providing opportunities for student engagement, student employment, and a multitude of programs and services such as recreation and wellness, student union and activities, student government, and childcare. ASI operational support areas include human resources, financial services, information technology, facilities management, and marketing. ASI is engaged in the work of being a learning organization. Currently, the guiding ideas of the organization are “under construction” as the team re-imagines its vision, mission, and core values. ASI is looking for dynamic team members who value team learning, co-creation, and adaptability to best serve the needs of our students.Founded in 1995, award-winning Marketing, Design & Public Relations (MDPR) is one of the most respected Marketing groups at Cal Poly Pomona. It maintains its creativity and dynamic marketing strategies through an experienced, talented team of students and professional staff in combination with the use of today’s most cutting-edge technology. Its goal is to connect their clients to their respective audiences with a fresh and innovative solution. MDPR not only serves all of ASI’s internal marketing needs, but it provides the campus and local community the opportunity to utilize their experience-driven, competitively priced, design and marketing communications services as well. Some of the services the team provides are logo design, brochure design, digital bulletin boards advertisements, and event/program poster design.POSITION DEFINITIONUnder general supervision of the Marketing and Production Coordinator and additional supervision and delegation of duties provided by the Projects and Operations Supervisor, the Projects and Operations Assistant performs routine and non-routine tasks in support of Marketing, Design and Public Relations’ (MDPR) business operations. The Operations Assistant collaborates with department staff to maintain a steady project workflow amongst the MDPR team and serves as the key customer service representative for MDPR.  ESSENTIAL DUTIES Responds to a variety of customer inquiries in a timely and professional mannerServes as a project manager for a variety of creative requests to ensure projects meet various milestonesGenerates marketing material quotes and batch invoices for completed projectsSupports the Projects and Operations Supervisor with sourcing new vendors and productsResponsible for seeking quotes from a variety of vendors and provide price comparisons for clientsAssists the department staff with the financial closing of projects and with tracking department revenue and expensesProcesses and manages incoming work ordersSupports the Projects and Operations Supervisor with creating name badges for the organizationConducts inventory for all incoming deliveries to ensure orders are correctly shippedFollows up with vendors with any order discrepanciesProvides follow-up with vendors regarding the status of promotional materialsOrders and maintains office suppliesPerforms other duties as assigned QUALIFICATIONSSix months to one year of customer service experience preferredDemonstrated ability to provide friendly and pleasant customer-oriented serviceAbility to communicate clearly and concisely, both orally and in writingStrong analytical and problem-solving skills with the ability to perform accurate, timely and detailed workKnowledge of estimating and working with vendors preferredAbility to perform accurate math calculations including markup and tax calculationsAbility to efficiently utilize Microsoft Office Suite, especially Excel and WordAbility to adhere to work rules, follow directions, use time effectively and meet deadlinesAbility to operate an office workstation, utilizing word processing, spreadsheet and other softwareDemonstrated ability to work with a diverse student population and campus communityEMPLOYMENT ELIGIBILITY Employment with ASI is open to any Cal Poly Pomona student who is at least 16 years old and of legal status to work in the United States. In addition, the employee must be currently enrolled for at least 6.0 units (undergraduate) and 4.0 units (graduate), international student employees must be enrolled in a minimum of 12.0 units (undergraduate) and 6.0 units (graduate) at the end of the drop-add period, have a minimum 2.0 GPA (both Cal Poly Pomona and overall GPA) and be in good standing with the University. Individuals enrolled only in Extended University are not eligible for hire. Exceptions to the unit load requirement are allowed during the summer and winter semesters and for students who have applied for graduation for the current semester.    WORK ENVIRONMENTWhile performing the duties of this job, the employee is frequently required to sit, talk and hear; manual dexterity, eye-hand coordination, and verbal communication; use of office equipment: telephones, calculator, copier and fax. Must be able to walk, stand, bend, and lift to 45 pounds.Position subject to an occupational exposure to bloodborne pathogens. Annual bloodborne pathogen training is required. The initial training must be completed before the employee is assigned duties that may result in exposure to blood or bodily fluids. Hepatitis B vaccination will be offered after the training.MANDATED REPORTING REQUIREMENT In compliance with the California Child Abuse and Neglect Reporting Act (CANRA) and the CSU Executive Order 1083, each ASI employee is designated as a mandated reporter and is required to sign an Acknowledgment of Mandated Reporter Status and Legal Duty to Report Child Abuse and Neglect. SYSTEMWIDE SMOKE AND TOBACCO FREE ENVIRONMENT EO 1108:  Cal Poly Pomona is a smoke and tobacco-free campus. Please refer to the link below for policy information. http://www.calstate.edu/EO/EO-1108.html COVID-19 VACCINATIONCSU, along with Associated Students Inc., strongly recommends all staff who are physically accessing campus facilities or programs to be fully vaccinated against COVID-19, which includes obtaining a COVID-19 booster dose. See policy at https://calstate.policystat.com/policy/11030468/latest. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9066993?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Coding Mind Academy", "type": "K-12 Education" },
    "title": "Coding Instructor - On-Site - Irvine, CA",
    "dates": {
      "posted": "Posted 5 months ago",
      "apply_by": "Apply by August 2, 2024 at 6 AM"
    },
    "wage": " $20–25/hr",
    "location": "Onsite, based in Irvine, California, United States",
    "position": { "length": "Part-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Position is for a coding instructor role at Coding Mind Academy which does not match the desired positions listed",
      "date": ""
    },
    "details": "Job DescriptionWe are looking for passionate coding instructors to teach K-12 students in after-school programs, weekend workshops, and camps. We maintain a low teacher-student ratio (about 1:4) where possible, and keep students and instructors together throughout an entire course for a meaningful experience.Instructors will take on a number of basic responsibilities:Teach students of all ages (K-12)Lead weekly classes on a number of different programming subjectsWork with students to create their own coding projects and presentationsRun trial classes to inspire future programmersAs your experience grows, there is room to take on more responsibility, from independent projects to curriculum development.RequirementsComputer/Engineering/STEM/Education related majors or relevant experienceInterest in learning new programming languages and tools (e.g., Python, Minecraft MakeCode, Scratch, App Inventor, Unity, Roblox)At least one afternoon/evening available per weekEnjoy working with kids of all agesExercise patience and humilityA passion for learning and educationPreferred Experience (but not necessary)Familiarity with popular programming languages (Python, Java, C#, HTML/CSS, JavaScript)AI and Machine LearningGame DevelopmentWeb DevelopmentAlgorithmsBenefitsSalary is $20-$25/hr based on experience-level and performanceFlexible class schedule that can fit your availabilityHave a positive impact on the next generation of programmersDevelop new skills in a community centered on learningLearn new programming topics that broaden your understanding of computer scienceImprove your communication and ability to breakdown complex topicsAbout Coding Minds AcademyFounded in the fall of 2017, Coding Minds Academy (http://codingmindsacademy.com/) seeks to educate students of all ages in computer science through interactive lessons and enriching programming projects. There are multiple sites located in California, and we are expanding online programs for students nationwide and abroad. We offer after-school programs, weekend workshops, camps, and 1-on-1 mentorship. We believe in the learn-by-doing philosophy, so all of our coding curricula involve development of real world applications, such as robotics, mobile apps, and games. Join us on our journey as we build a community centered on programming empowerment!",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8654977?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Student Innovation Idea Labs",
      "type": "Higher Education"
    },
    "title": "Sewing and Embroidery Student Technician - Student Innovation Idea Labs",
    "dates": {
      "posted": "Posted 1 week ago",
      "apply_by": "Apply by July 16, 2024 at 6 AM"
    },
    "wage": " $16–17/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙10 hours a week",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for Sewing and Embroidery Student Technician, not relevant to software engineering/web/app development/data analytics/machine learning",
      "date": ""
    },
    "details": "This is a student assistant position that will provide support for the Student Innovation Idea Labs (SIIL) starting in Fall 2024. Our spaces include the Innovation Orchard (IO), iLab, and Maker Studio. The position will include supporting SIIL activities and operating and maintaining equipment at the IO, iLab and Maker Studio, specifically with our sewing and embroidery machines. We are looking for a person who is excited to learn how to use new equipment, but has proficient  experience with sewing and embroidery machines.Duties and Responsibilities:- Assist other student staff with keeping SIIL spaces and equipment orderly and operational- Perform equipment maintenance across all three spaces- Attend weekly staff meeting with the SIIL team- Train student, faculty and staff on the various equipment we have available- Help develop equipment training programs for SIIL equipment- Assist other students with help on using modeling software- Other duties as assigned that help further the mission of the SIIL.Minimum Qualifications:- Excellent English verbal communication and writing skills- Ability to work in teams with other student staff- Ability to interact positively with university faculty and Staff- Proficient with Microsoft Office 365 software- Experience using wood working, metal working, CNC machining, laser cutting, 3D printing, or other fabrication or manufacturing equipment and techniquesRequired Qualifications:-Previous experience using and/or teaching others on sewing and embroidery machinery, techniques, and skills. -Experience doing product research and skill at learning how to use equipment with little formal instruction-Experience troubleshooting equipment- Innovative and creative enough to take initiative and start projects with minimum guidance- Responsible and dependable- Motivated to stay organized and complete a variety of tasks- Great organizational, learning, and research skills- Machine experience (either via coursework or industry experience)",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9070100?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "NextLabs, Inc.", "type": "Internet & Software" },
    "title": "IT Interns",
    "dates": {
      "posted": "Posted 5 months ago",
      "apply_by": "Apply by January 28, 2025 at 6 AM"
    },
    "wage": " $16–20/hr",
    "location": "Remote, based in United States",
    "position": {
      "length": "Part-time∙From January 30 to January 29",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "More documents required",
      "date": "7/9/2024, 2:44:02 AM"
    },
    "details": "IT Interns – System and Operations SupportLocation: San MateoNextLabs®, Inc. is the leading provider of policy-driven information risk management (IRM) software for large enterprises. Our software offers a cohesive solution for improving compliance and mitigating information risk by helping companies achieve safer and more secure internal and external collaboration, prevent data loss, and ensure proper authorization to applications and data. We are proud of our truly world-class organization, and are seeking other individuals who share our passion for excellence. The System and Operations Support Intern will be involving in supporting and implementing system and operation procedure including helpdesk, product deployment, key business applications, as well as supporting and maintaining servers (QA LAB, DEV LAB and DEMO LAB), security, network systems, and end-user workstations.  Troubleshoot and provide solutions to address network performance issues and server downtime.Monitor and maintain network, virtual workstation, server and other networking equipment.Plan, coordinate, and implement new IT systems and applications.Assist in design and implementation of network security programs and procedures.Work with the Network and Security Engineering teams to implement companywide IT initiatives. Required Skills:Knowledge and experience in troubleshooting computers, networking systems, and software applications.Knowledge of cloud computing and virtual machine technology is a plus.Passion to design and implement new technology for complex business requirements.Ability to deal with end user problems.Good written and verbal communication skills. Ability to work in a team environment.Major in Computer Science, Information System, Information Technology, Management Information System, or Engineering with strong exposure to computer systems and hardware.Excellent time management",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8633288?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "InnovoCommerce", "type": "Internet & Software" },
    "title": "Artificial Intelligence Engineer (RAG)",
    "dates": {
      "posted": "Posted 2 weeks ago",
      "apply_by": "Apply by December 22, 2024 at 6 PM"
    },
    "wage": " $80–90K/yrMedical, dental, and vision coverage plus paid time off",
    "location": "Hybrid, based in Irvine, California, United States",
    "position": { "length": "Full-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Position not at Cal Poly Pomona, Fontana, Pomona, or remote",
      "date": ""
    },
    "details": "Overview:InnovoCommerce is a leading SaaS provider of eClinical solutions for the global life sciences industry. Today, the largest pharmaceutical firms in the world use our StudyCloud platform for their clinical trials. We are seeking an experienced Artificial Intelligence Engineer that will play a pivotal role in implementing retrieval-augmented generation (RAG) with pretrained generative models in the context of our domain. The ideal candidate will have expertise and a proven track record of implementing RAG with state-of-the-art techniques in conjunction with domain-specific workflows. Responsibilities:Collaborate with cross-functional teams to discern project needs and identify best-suited solutions & architectural decisions.Develop and optimize a robust RAG pipeline utilizing best-practice techniques to tailor generative content for specific use cases with high accuracy.Work closely with the development team in implementing domain-specific workflows and APIs with the current application (i.e. integrating multimodal data sources, enhancing answer generation workflows). Requirements:2+ years of professional experience in build RAG pipelines and LLM evals.Solid understanding of state-of-the-art RAG techniques and fine-tuning processes to achieve high levels of accuracy across specific contexts.Proficiency in tools such as Azure Copilot/AI Search, Nvidia AI Solutions, etc.Experience in designing and implementing APIs for integrating with applications, data sources, etc.Excellent communication skills to articulate technical concepts and collaborate effectively with cross-functional teams. Benefits:Flexible hybrid positionHealth InsuranceDental InsuranceVision InsurancePTO InnovoCommerce is an equal opportunity employer; all employment decisions are made on the basis of qualifications, merit, and business need.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9064610?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Industrial Manufacturing & Engineering",
      "type": "Higher Education"
    },
    "title": "Student Tech, Engineering",
    "dates": {
      "posted": "Posted 8 months ago",
      "apply_by": "Apply by September 27, 2024 at 6 AM"
    },
    "wage": " $16/hr",
    "location": "Onsite, based in Pomona, California, United States, or 3801 W Temple Ave, Pomona, California 91768, United States",
    "position": {
      "length": "Part-time∙20 hours a week∙From October 20 to May 30",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "More documents required",
      "date": "7/9/2024, 2:44:02 AM"
    },
    "details": "This is open to all students, we are looking for engineering students that are good with their hands, can follow directions and work safely. They must be able to commit to their schedules, be on time every time and be able to work with minimal supervision. Their duties can include everything from cleaning the parking lot to assembling/building equipment.  The purpose of these positions is to support the labs and the college of engineering, but in the process, there will probably be many opportunities to learn. Due to the type of work to be done, 3 or more hour blocks are required. You will be expected to get dirty and to work your allotted hours from start to finish doing mostly manual labor.  Cell phones will only be used for emergencies and ear buds will not be allowed because of safety concerns. You will be required to have closed toe shoes, long pants, Personal Protective Equipment (PPEs). Long hair must be secured. Engineering students are preferred but the positions are open to all majors.  ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8347276?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Futronics (NA) Corporation",
      "type": "Electronic & Computer Hardware"
    },
    "title": "Software Engineering Intern",
    "dates": {
      "posted": "Posted 2 months ago",
      "apply_by": "Apply by December 31, 2024 at 6 AM"
    },
    "wage": " $15–20/hr",
    "location": "Onsite, based in Pasadena, California, United States",
    "position": { "length": "Full-time", "type": "Internship" },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:44:02 AM"
    },
    "details": "SummaryFutronics, a global leading AI robotics company in stealth mode, is looking for Software Intern to join the team in Pasadena, CA. You will have the opportunity to work on the new portfolio of service robots for the healthcare domain as well as innovate on core technologies to differentiate our products. The R&D team is made up of an incredibly diverse set of skilled researchers and engineers with different areas of expertise including Autonomous Navigation, Perception and Computer Vision, Human-Robot Interaction and NLP, Manipulation and Control, Mechatronics, and Cloud Computing.Responsibilities·       Develop dynamic applications for desktop web and touchscreen devices·       Integrate with APIs to leverage data from the Cloud and on-device systems·       Collaborate with agile, cross-functional teams to display information and control robot actions·       Conduct code reviews and document best practices·       Support Continuous Integration with an emphasis on software quality best practices·       Engineer solutions that are safe for robotic platforms that interact with humansQualifications·       Experience in web application development·       Experience with modern JavaScript frameworks (Vue.js, React, Angular)·       Strong knowledge of containerized Linux development (Docker)·       Understanding of automated testing, CI, build, and deployment to production-ready systems·       Understanding of data structures and object-oriented design·       Analytical, problem solving, and communication skills·       Experience working with UX/UI designers to deliver intuitive user interfaces·       Experience building customer facing products and services·       Bachelor’s Degree in Computer Science or related field·       Currently pursuing 4th year for a bachelor's degree or currently pursuing a master's degreeAbout Us: Futronics is a global leading AI and humanoid robotics company and the world’s most valuable AI and Robotics Start-up. At Futronics, we conduct fundamental research, applied research, and innovative engineering to create various robotic products, which have been significantly impacting the global market and changing the world. As the leader in the intelligent service robot industry, we are the only company, which successfully commercialized humanoid robotic products for consumers in the world. Our mission is to bring a robot into every home, and truly integrate intelligent robots into the daily lives of everyone creating a more intelligent way of life. Location: Pasadena, CA",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8931763?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - College of Business/IBM",
      "type": "Higher Education"
    },
    "title": "Marketing Analytics Specialist",
    "dates": {
      "posted": "Posted 5 days ago",
      "apply_by": "Apply by July 31, 2024 at 8 AM"
    },
    "wage": " $20/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙20 hours a week",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "More documents required",
      "date": "7/9/2024, 2:44:08 AM"
    },
    "details": "The Center for Customer Insights and Digital Marketing is hiring a Marketing Analytics Specialist. The job description is below.Position Name: Marketing Analytics Specialist.Major Function: The position holder will assist the center directors in planning and executing marketing analytics activities intended to assess the current engagement with its constituency both online and offline and generate insights that will enhance community engagement outcomes. Responsibilities Support the directors in developing strategies to deliver results and incorporate research needs into surveys, messaging, and planning as needed. Support digital marketing and analytics community events.Major responsibilities include, but are not limited to, the following:Update existing center web pages and create new pages as needed. Create and implement on-site and off-site SEO plans. Update and operate the CRM platform (i.e., HubSpot) to monitor KPIs on social media platforms and web pages.Report KPIs on social media platforms and web pages periodically.Update the center’s various databases along with the customer engagement and conversion funnels to support the center’s email efforts.Report email marketing performance metrics periodically.Assist in updating contacts for the center’s email program (i.e., Mailchimp) Prepare and run a Virtual Workshop on marketing analytics.Collaborate with various partners on campus.Perform other duties as assigned.Identifies and aligns with CCIDM’s missions and work culture. Required Qualifications: Strong research and analytical skills and interest.Curiosity to learn and apply new technology to the center job process. Effective interpersonal skills.Skilled with Microsoft Office Suit tools and Google Drive toolsFamiliarity with digital marketing concepts and tools (e.g., Canva, Google Analytics).Ability to operate with independence, under pressure, to meet deadlines and commitments. Ability to set priorities, manage a multitude of details simultaneously in a fast-paced environment, and work effectively both independently and in a team environment.Proficiency in data science tools such as R/Python, Tableau/Power BI, Excel Preferred Qualifications: Applicants who will be enrolled in a graduate program at the Singelyn Graduate School of Business, College of Business Administration, are strongly preferred.Minimum of 6 months of professional experience in digital marketing, marketing, or related fields.Experience in web design and tools (e.g., WordPress, Adobe Creative Suite, basic HTML coding, etc.)Ability to operate with independence, under pressure, to meet deadlines and commitments. Ability to set priorities, manage a multitude of details simultaneously in a fast-paced environment, and work effectively both independently and in a team environment.Knowledgeable in the HubSpot CRM tool.   Compensation: Salary will start at $20 an hour for 10 hours to 20 hours per week (typical hours may vary ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9089196?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - University Housing Services",
      "type": "Higher Education"
    },
    "title": "FRONT DESK ASSISTANT - 2024/25 RESIDENT ADVISORS ONLY",
    "dates": {
      "posted": "Posted 1 week ago",
      "apply_by": "Apply by August 22, 2024 at 6 PM"
    },
    "wage": " $16/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙20 hours a week",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for a Front Desk Assistant role, not related to software engineering, web/app development, data analytics/science, or machine learning.",
      "date": ""
    },
    "details": "Front Desk Assistant - Job DescriptionScope of FunctionFront Desk Assistants (FDAs) serve as an integral part of University Housing Services (UHS) at Cal Poly Pomona (CPP). FDAs serve as the first impression of UHS and the residential community. FDAs have the opportunity through their role to develop customer service, communication, and problem-solving skills. FDAs assist in creating a safe, secure, and welcoming environment within the residential community front desks for residents, CPP community members, and guests.AppointmentAppointment begins Fall 2024 and ends May 2025CompensationThe pay rate is $16.00 per hourAbout University Housing ServicesUHS delivers a comprehensive housing experience, including residence life, business operations, facilities management, conference services, marketing, and information systems to students in eleven (11) residential halls/suites. FDAs work at community front desks to provide exceptional customer service, assist with community-specific and UHS administrative tasks, and support on-campus housing residents and guests.ResponsibilitiesThe primary responsibilities of the FDA include: Maintain a positive and approachable demeanor and welcoming environment for residents and guests at UHS community front desks Be knowledgeable of University and UHS policies and procedures, UHS housing processes, CPP resources and events; provide directions as needed Answer and address questions; relay important information to UHS staff and/or appropriate CPP departments.  Perform departmental operations involving keys (check-in/outs, room changes, lockouts) Utilize Housing Management Software (StarRez) Check-out equipment to residents following established procedures Assist in emergency response for various situations including building lobby evacuation, informing residents of evacuation location, etc. Receive and maintain lost and found items such as resident keys, Bronco ID cards, etc.; inform UHS staff of items Support residents with facilities concerns by guiding them through work order processes and promptly inputting work orders as needed Adhere to/enforce University and UHS policies and procedures, promptly reporting emergencies, suspicious activities, and policy violations as necessary Maintain resident confidentiality as required by FERPA Maintain a clean and professional environment at community front desk during every shift by wiping down counters, taking out trash, etc. Assist UHS professional staff with administrative tasks and complete other FDA tasks as assigned.QualificationsMust be an enrolled CPP student and maintain a 2.0 or greater semester and cumulative GPA at time of application and throughout period of appointment Remain in good student conduct and financial standing within UHS and CPP at time of application and throughout the appointment period Must be able to work with others with limited supervision and lead presence; ability to work independently Must demonstrate courtesy, respect, and exceptional customer service Must work effectively with a diverse population of residents, students, staff/faculty, administrators, parents, and guests Must have excellent communication skills and always maintain professionalism Work flexible hours including evenings",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9071047?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Splunk", "type": "Internet & Software" },
    "title": "Software Engineer - Early in Career (Frontend)",
    "dates": {
      "posted": "Posted 1 week ago",
      "apply_by": "Apply by July 31, 2024 at 4 AM"
    },
    "wage": " $119–178K/yrMedical, dental, and vision coverage",
    "location": "Remote, based in United States",
    "position": { "length": "Full-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:44:07 AM"
    },
    "details": "Splunk is here to build a safer and more resilient digital world. The world's leading enterprises use our unified security and observability platform to keep their digital systems secure and reliable. While customers love our technology, it's our people that make Splunk stand out as an amazing career destination and why we've won so many awards as a best place to work. If you become a Splunker, we want your whole, authentic self, what we call your \"million data points\". So bring your work experience, problem-solving skills and talent, of course, but also bring your joy, your passion and all the things that make you, you.Role Summary:Splunk is looking for new grads or early in career talent to join our team. As a Front-end Software Engineer, you will work on real projects that go to market. You will also have an opportunity to enjoy our dynamic, startup-like environment. You will get invaluable work experience at a leader in “Big Data”, the hottest software market now.You will experience Splunking and what defines our culture while honing the skills which separate our development teams from others. Working to support internal and external customer needs, you will collaborate with cross-functional teams, receive mentorship, and gain insight into our values-driven process. Our goal is both to support your growth and development while empowering you for a successful start to your career.What you'll get to do:You will get to work with smart and hardworking individuals who are doing state of the art development work (native mobile, front-end and back-end, DevOps) in areas of machine learning, data analytics, infrastructure and event correlations across silos to build best-in-class business analytics software. You will be interacting with product management and customers to understand detailed requirements. You will also work with other engineering teams across Splunk to design and build high-performance solutions.Design, develop, code and test software systems, or applications for software improvements and new products.Build innovative solutions that enable rapid development.Contribute through participation in agile development of project timelines, implementation design specifications, system flow diagrams, documentation, testing, and ongoing support of systems.Make an impact through your recommended modifications to processes and procedures, and directly contribute to standard methodologies, architecture, and implementation.Must-have Qualifications:A Bachelor's, Master's, or PhD in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Mathematics or a related technical field, and a strong record of academic achievement.Nice-to-have Qualifications:We’ve taken special care to separate the must-have qualifications from the nice-to-haves. “Nice-to-have” means just that: Nice. To. Have. So, don’t worry if you can’t check off every box. We’re not hiring a list of bullet points–we’re interested in the whole you.Strong interest in front-end/UI developmentFamiliarity with frontend JavaScript technologies including React/Redux, (nice to have: Typescript, jQuery, Backbone)Exposure to styling web applications using CSSExperience with modern version control system, such as Git and etcExposure to test automation, such as Karma, Mocha, Jest, Storybook, etcUnderstanding of CI/CDExperience building meaningful software applications: in a class, as a personal hobby, as a job, as part of an open source projectExposure to Agile developmentExperience collaborating with others in a fast-paced environmentStrong communication skills, verbal and writtenMinimum 6 months relevant work or internship experienceSplunk is an Equal Opportunity EmployerAt Splunk, we believe creating a culture of belonging isn’t just the right thing to do; it’s also the smart thing. We prioritize diversity, equity, inclusion, and belonging to ensure our employees are supported to bring their best, most authentic selves to work where they can thrive. Qualified applicants receive consideration for employment without regard to race, religion, color, national origin, ancestry, sex, gender, gender identity, gender expression, sexual orientation, marital status, age, physical or mental disability or medical condition, genetic information, veteran status, or any other consideration made unlawful by federal, state, or local laws. We consider qualified applicants with criminal histories, consistent with legal requirements.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9052080?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "GITAI USA Inc.", "type": "Aerospace" },
    "title": "Software Engineer Intern",
    "dates": {
      "posted": "Posted 2 weeks ago",
      "apply_by": "Apply by July 20, 2024 at 6 AM"
    },
    "wage": " $30–40/hr",
    "location": "Onsite, based in Torrance, California, United States",
    "position": {
      "length": "Full-time∙From July 15 to September 13",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:44:07 AM"
    },
    "details": "***Please submit all applications through Greenhouse (link attached). Applications through Handshake WILL NOT be reviewed*** Company Overview:GITAI is the world’s leading space robotics startup, aiming to provide safe and affordable labor in space and reduce operational costs in space by 100 times. GITAI is developing highly capable, safe, and reliable robots to help build and maintain satellites, space stations, lunar bases, and cities on Mars.As part of GITAI’s elite team, you will collaborate with some of the brightest visionaries in the field, including esteemed researchers from the University of Tokyo and accomplished Founders & CxOs with successful exits to industry giants such as Google and American Express. Our rapidly growing company offers a dynamic and intellectually stimulating environment, tailored for the relentless pursuit of innovation. Position Overview:We are seeking an enthusiastic and dedicated Intern to join our Software Engineer team. This internship provides an excellent opportunity for those passionate about space exploration, robotics, and software engineering to gain hands-on experience. The position will serve a critical role in enhancing GITAI’s robotic capability by adopting state-of-the-art techniques and software. Key Responsibilities:Enhance what GITAI’s robots can do through tangible demonstrationsIdentify project priorities, software/hardware requirements, and design constraints with team members and translate those into minimum-viable systemsWork with other engineers and the manufacturing team to correct any problems with the robot.Develop software that matches GITAI's quality standardsPerform any testing necessary to maintain the software. Including manual testing using actual equipment and automated testing. Requirements:Legally authorized to work in the United StatesCurrently enrolled in a Master’s or Ph. D’s degree in Robotics, Computer Science, or a related fieldDemonstrable experience with robotics software and hardware, including sensors, controllers, actuators, and communication devices.Experience with C++ and PythonExperience developing software with ROS and LinuxBasic understanding of robotic kinematics and computer vision.Excellent problem-solving skills and attention to detail Benefits:Competitive Compensation: Attractive salary packages to reward your talent and dedicationDynamic Work Environment: Collaborate and innovate with a passionate teamOffice Perks: Enjoy free snacks and drinks, plus regular social events to foster team spirit.Cutting Edge Experience: Work alongside state-of-the-art robots, driving the future of space technology Location and Position Type:Torrance, CA (On-Site)Internship Important Notice:This position is subject to compliance with U.S. export control requirements including EAR and ITAR. We are interested in every qualified candidate who is legally authorized to work in the United States. We are not able to sponsor visas for this position.GITAI USA Inc. is Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9060428?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "LA-Tech.org", "type": "Non-Profit - Other" },
    "title": "PAID STEM Internships in Tech",
    "dates": {
      "posted": "Posted 5 months ago",
      "apply_by": "Apply by December 31, 2024 at 11 PM"
    },
    "wage": " $16.68–50/hr",
    "location": "Remote, based in United States",
    "position": {
      "length": "Part-time∙From February 5 to December 31",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is remote, but not located near Fontana or Pomona, California",
      "date": ""
    },
    "details": "Embark on a transformative journey into the heart of the Los Angeles tech scene with LA-Tech.org’s PAID internship program! *Designed for ambitious scholars eager to dive into the dynamic world of technology, the LA Tech Internship Program offers a unique opportunity to kickstart your career and make meaningful connections in one of the most vibrant tech ecosystems.Why Choose LA Tech's Internship Program?Hands-On Experience: Gain invaluable hands-on experience working on real projects, solving industry challenges, and contributing to cutting-edge innovations.Industry Knowledge: Build a powerful network by connecting with seasoned professionals, mentors, and fellow interns.Accelerated Growth: Fast-track your career with mentorship, skill development, and exposure to the latest trends in tech.Diverse Opportunities: Explore a wide range of PAID roles! Program Highlights: 160 hours of PAID learningReceive competitive compensation for your contributionsGain access to exclusive learning resources, workshops, and seminars to enhance your technical and professional skillsWho is Eligible?The Paid Internship Program is available to any member over the age of 18!STEM Paid Internship Areas: Software engineeringInformation technology (IT)CybersecurityBackend engineerWeb development, and more!Don’t miss your chance to launch your career in the LA tech industry!",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8660657?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Link Munch", "type": "Internet & Software" },
    "title": "Urgently Hiring Full-Stack Developer",
    "dates": { "posted": "Posted 6 days ago", "apply_by": "Applied" },
    "wage": " $50–60/hr",
    "location": "Remote, based in United States",
    "position": { "length": "Full-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:44:15 AM"
    },
    "details": "Job DescriptionLink Munch is an innovative online platform that rewards users for creating content for businesses. As an early-stage, pre-launch startup, we're looking to hire 2-3 talented full-stack developers to join our dynamic team. As a full-stack developer, you will be instrumental in the technical design, development, and deployment of our products. We're seeking motivated, highly-collaborative, and self-starting individuals who are comfortable owning and driving the development of new features and have a proven track record in building successful software products. As we are pre-launched, we offer shares as part of the compensation package, with salary payments commencing once we secure revenue or investment. Responsibilities- Enhance current frontend features of our mobile apps.- Develop and implement new user-facing features using React Native.- Optimize components and clean up existing code for better performance.- Collaborate with the development team to update and improve app features.- Contribute to the design and development of new products and services across the tech stack.- Maintain high-quality standards in software delivery.- Build and maintain reusable code and libraries for future use.- Support and maintain products and services in a production environment.- Develop, test, document, and release full-stack, end-to-end features for Link Munch mobile apps. Required Qualifications- Minimum 1 year of experience with React Native in mobile development (Android and iOS).- Proficiency in JavaScript/TypeScript.- Proficiency in Python.- Solid understanding of Version Control (Git).- Minimum 1 year of experience with AWS (Lambda, S3, DynamoDB).- Experience with API development and integration.- Hands-on experience deploying and supporting software solutions in a production environment.- Excellent verbal and written communication skills. Join us at this exciting time and be a part of building something truly impactful from the ground up!",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9085647?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "New-Indy Containerboard LLC",
      "type": "Manufacturing"
    },
    "title": "Process Engineer Intern",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by November 30, 2024 at 6 AM"
    },
    "wage": " $23/hr",
    "location": "Onsite, based in Ontario, California, United States",
    "position": { "length": "Part-time", "type": "Internship" },
    "application_status": {
      "applied": false,
      "reason": "Position is for Process Engineer Intern in manufacturing field, not related to software engineering, web/app development, data analytics/science, or machine learning",
      "date": ""
    },
    "details": "New-Indy Ontario rotates its Process Engineer Interns through different departments throughout their internship. Below are summaries of the roles in each department. In order to effectively evaluate our interns for future full-time positions, we do our best to assign meaningful projects to all interns and provide continuous feedback. CONTROLSSummary:  Assist with maintenance and reliability and process control improvement efforts at the New-Indy Ontario recycled containerboard mill including project management, specification research, failure analysis and documentation, and controls implementation. Flexible schedule.Essential Duties and Responsibilities:Provide professional Controls engineering support, leadership, and services in the analysis, planning, and control of the manufacturing process.Perform day-to-day engineering tasks in support of the long-term strategic plan for integrating reliability based maintenance activities into the routine business of the organization.Participate in Cost Assessment processAssist controls, and I/E teams on complex, controls and Instrumentation driven projectsEstimate Instrumentation, control valves, and controls, engineering and design for potential new projects.Prepare Instrumentation and valve specifications.Prepare equipment specifications and bid packages.Oversight of development of equipment layouts and general arrangements.Oversight of layout of piping systems.Coordination of Instrumentation and controls design with vendor supplied equipmentPreparation of construction bid packages and construction specifications.Other functions that may be assigned. MAINTENANCESummary:   Assist with maintenance and reliability efforts at the New-Indy Ontario recycled containerboard mill including project management, specification research, failure analysis and documentation. Flexible schedule. Essential Duties and Responsibilities:   Provide professional mechanical engineering support, leadership, and services in the analysis, planning, and control of the manufacturing process.Perform day-to-day engineering tasks in support of the long-term strategic plan for integrating reliability-based maintenance activities into the routine business of the organization.Participate in Cost Assessment processAssist mechanical team on complex, mechanically driven projectsEstimate mechanical and piping engineering and design for potential new projects.Prepare pipe and valve specifications.Prepare equipment specifications and bid packages.Oversight of development of equipment layouts and general arrangements.Oversight of layout of piping systems.Coordination of mechanical and piping design with vendor supplied equipmentPreparation of construction bid packages and construction specifications.Other functions that may be assigned. PRODUCTIONSummary:   The Process Engineer Intern assists with optimizing manufacturing systems and processes. Essential Duties and Responsibilities:  Provide Production Team support as directed.Learn and apply knowledge within the containerboard field. Develop operator interfaces to promote efficient operation, effective standard operation procedures, and improved process monitoring of key operating parameters. Keep abreast of liner and medium paper making industry trends and implement improvements as appropriate. Work with the L&W and paper testing equipment vendors service technicians and assist in managing the service contracts for the paper testing lab  Work with production manager in the execution mill goals. Coordinate work with other groups within the company.Assist employees in gathering and analyzing data used in continuous improvement efforts.Assist in maintenance projects that involve instrumentation and process control. Assist operations in managing shutdown jobs. Works in a manner consistent with safety for all parties and promotes safe working practices Other functions as assigned. Competencies: To perform the job successfully, an individual should demonstrate the following:Technical Skills - Assesses own strengths and weaknesses; Pursues training and development opportunities; Strives to continuously build knowledge and skills; Shares expertise with others.Interpersonal Skills - Focuses on solving conflict, not blaming; Maintains confidentiality; Listens to others without interrupting; Keeps emotions under control; Remains open to others' ideas and tries new things.Teamwork - Balances team and individual responsibilities; Exhibits objectivity and openness to others' views; welcomes feedback; Contributes to building a positive team spirit; Puts success of team above own interests; Able to build morale and group commitments to goals and objectives; Supports everyone's efforts to succeed.This position works closely with Electrical, Mechanical/Piping, Operations, and Process Engineers to improve Process control.Organizational Support - Follows policies and procedures; Completes administrative tasks correctly and on time; supports organization's goals and values; Benefits organization through outside activities; Supports affirmative action and respects diversity.Safety and Security - Observes safety and security procedures; Reports potentially unsafe conditions; Uses equipment and materials properly.Qualifications: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Education and/or Experience: Chemical, Electrical, or Mechanical Engineering student.Communication Skills: Intermediate skills in English; ability to read, write routine reports and correspondence and speak effectively before groups of customers or employees of the organization.Mathematical Skills: Basic mathematical skills; ability to add, subtract, multiply and divide whole numbers.Reasoning Ability: Intermediate skill level with the ability to apply common sense understanding to carry out instructions furnished in written, oral or diagram form. Computer Skills: The company utilizes Microsoft products including; Outlook, Word, Excel and Power Point. Basic knowledge with these products is preferred. General computers Skills an asset. To perform this job successfully, an individual should also be able to navigate through various Manufacturing software platforms.Certificates, Licenses, Registrations: A valid California Driver's License is required for any position requiring travel. Physical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. An Applicant or Employee must notify Human Resources as soon as they are aware that a reasonable accommodation is needed in order for the individual to perform the essential functions of this job.While performing the duties of this Job, the employee is regularly required to stand and walk [more than 2/3 of 8 hour shift]. The employee is frequently required to reach with hands and arms; climb or balance; and talk or hear [approximately 1/2 of an 8 hour shift]. The employee is occasionally required to sit; Use hands to type on a Computer keyboard.; and stoop, kneel, crouch, or crawl [about 1/3 of an 8 hour shift]. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision, color vision and depth perception.Work Environment: The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this Job, the employee is frequently exposed to wet and/or humid conditions and works with moving mechanical parts. The employee is occasionally exposed to high, precarious places, outside weather conditions and extreme heat (summer). The noise level in the work environment is usually very loud. Employees are required to wear personal protective equipment including Head, Hand, Foot, Eye, and Ear protection.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9012292?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Design West Technologies Inc.", "type": "Defense" },
    "title": "Quality Engineering Intern",
    "dates": {
      "posted": "Posted 1 week ago",
      "apply_by": "Apply by July 31, 2024 at 6 AM"
    },
    "wage": " $19–21/hr",
    "location": "Onsite, based in Tustin, California, United States",
    "position": { "length": "Part-time∙20 hours a week", "type": "Internship" },
    "application_status": {
      "applied": false,
      "reason": "Position is for Quality Engineering Intern at Design West Technologies Inc., Tustin, California, not in the preferred fields or locations",
      "date": ""
    },
    "details": "Design West Technologies Inc. of Tustin, CA has an immediate need for a part-time Quality Engineering Intern (estimating 20-24 hours per week). The successful candidate will be responsible for providing support to Quality department, facilitating production of projects for the Department of Defense. In this role, you will work with quality, manufacturing, engineering and planning departments. If this sounds like the opportunity for you, apply today!ABOUT DESIGN WEST TECHNOLOGIES INC.Founded in 1994, DWT is a nontraditional defense contractor with the expertise and technical capabilities to design new systems or develop and implement enhancements to existing products through comprehensive testing and analysis. Vertically integrated from R&D to final assembly and testing, we offer a unique combination of electrical, chemical, and mechanical product development for weapons and CBRN systems with CNC machining, injection molding, robotic welding, assembly, design, testing, and engineering capabilities. DWT is a dynamic and innovative company committed to delivering cutting-edge solutions to meet the evolving needs of the industry. Our team is driven by a passion for pushing the boundaries of technology.A DAY IN THE LIFE AS AN QUALITY ENGINEERING INTERN AT DWTYou will perform dimensional, mechanical or visual inspection of sub-assemblies or incoming parts to ensure conformance to blueprints, engineering specifications and customer requirements; collect and maintain results according to procedure; prepare part approval documentation in accordance with company and customer procedure; collect and analyze data in support of short-term projects, support the development of verification, and other instructions with graphics and text. These tasks will assist you in developing an understanding of AS91000D Quality System and government/DCMA inspections.QUALIFICATIONS:Pursuing or recent graduate B.S. degree in mechanical, electrical, aerospace or Industrial EngineeringStrong MS Office skills, particularly Word and ExcelAttention to detailAbility to read blueprints and engineering drawings preferredWell organized and ability to compile accurate dataCommunicate effectively, both orally and in writingThis Company Describes Its Culture as:Detail-oriented -- quality and precision-focusedInnovative -- innovative and risk-takingOutcome-oriented -- results-focused with strong performance culturePeople-oriented -- supportive and fairness-focusedTeam-oriented -- cooperative and collaborativeARE YOU READY TO JOIN OUR TEAM?If you feel that you would be right for this position working on, please fill out our initial mobile friendly application so that we can review your information. We look forward to meeting you!We are an EQUAL OPPORTUNITY EMPLOYER including Disability/Vets",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9079988?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "UC Irvine - PREVENT Lab", "type": "Research" },
    "title": "Research Participant ",
    "dates": {
      "posted": "Posted 14 months ago",
      "apply_by": "Apply by July 21, 2031 at 12 AM"
    },
    "wage": " $30–60/hr",
    "location": "Remote or onsite, based in Irvine, California, United States",
    "position": { "length": "Part-time", "type": "Volunteer" },
    "application_status": {
      "applied": false,
      "reason": "Position is volunteer-based and not paid",
      "date": ""
    },
    "details": "Paid research participants ages 12-34 needed for a research study about predicting the risk of psychosis through computerized tasks! Researchers from University of California, Irvine are looking for participants ages 12-34 to participate in a 6-session research study. The purpose of this study is to see how unusual thoughts, suspiciousness or paranoia, and unusual experiences with seeing or hearing things that are not really there can be used to predict risk of psychosis through computerized tasks. All participants will be compensated $30 per hour. Study sessions will take place online over a secure videochat application. The study sessions will be scheduled at a time that is convenient for you. If you’re interested, please fill out this survey https://redcap.link/PREVENTscreen, and email at caprstudy.uci@gmail.com, or visit our website at https://sites.uci.edu/leaps/. STU00211351: CAPR Principal investigator: Jason Schiffman",
    "link": "https://cpp.joinhandshake.com/stu/jobs/7803591?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cyan Systems",
      "type": "Electronic & Computer Hardware"
    },
    "title": "Software Engineer - Image Processing",
    "dates": {
      "posted": "Posted 2 months ago",
      "apply_by": "Apply by November 8, 2024 at 6 AM"
    },
    "wage": " $18–24/hr",
    "location": "Hybrid or onsite, based in Santa Barbara, California, United States",
    "position": { "length": "Part-time∙28 hours a week", "type": "Internship" },
    "application_status": {
      "applied": false,
      "reason": "Position is a part-time internship located in Santa Barbara, not near Fontana or Pomona, and the wage is $18-24/hr which may not meet the requirement for a paid position.",
      "date": ""
    },
    "details": "Job title:  Software engineer – Image ProcessingJob description:Computer Scientist/Engineer will develop CPU/GPU and FPGA embedded software for image processing applications and user interfaces.About the company:Cyan Systems, an innovator in advanced infrared imaging sensors, cameras, and image processing technology, designs and produces cutting edge focal plane arrays, advanced camera cores, and fully integrated camera systems for the commercial and military markets.  Cyan Systems is recognized in the industry for their high resolution, high sensitivity, and high definition imaging sensors that enable a variety of challenging applications.  Our offices are located in Santa Barbara and Santa Maria, CA.  For more information go to Cyan-Systems.com.Key skills and experience desired:Software development on Ubuntu (Linux) and Windows OS, including in depth knowledge of OS performance improvement techniques involving hardware/software optimization.Real time image processing development for operation on GPU and CPU, involving multi-threading, multi-core, parallel processing techniques and CUDA.C++/Csharp and github code implementation of various image processing AI programs.GUI design and console applications development, compiling for software release and in-service product updates.Design for reliability, including quality testing and certification.Develop peripheral interfaces and protocols including GigE/local network streaming, TCP/UDP, RS232/UART and USB.Prepare technical documentation, user manuals, and the like.Desired Education:Minimum of Bachelor of Science degree in Computer Science or Electrical/Computer Engineering (or equivalent).At least 2 years work experience in several of the above described areas is preferred.Desired Qualifications:AI Machine Learning.Expert C++/OpenCV/Java/HTML programming capability required.  Knowledge of other languages and frameworks such as Caffe/Python is highly desired.  Working knowledge of CNN/DNN is a plus.Operating system experience in Windows, Linux.  Code development within Visual Studio, Eclipse.Knowledge of infrared sensors and detectors a plus.Ability to optimize and accelerate code for real-time processing in GPU/CPU/FPGA cores.  Experience with embedded programming tools such as SDSoC is desired.Experience with GPUs and hardware/development kits.Experience with software product development and lifecycle.Superior communication and technical writing skills.About You:We are looking for individuals who relish working on high technology, can work independently in a small company environment, and possess the following characteristics:Ability to work in small teamsHighly self-motivatedHave an innate curiosityPossess a strong work ethicNimble and able to focus on specific tasksCreative and visionary in conceiving new products and capabilitiesThrives in a culture of innovation and teamworkMaintains focus on customer requirements Work Authorization:Candidate must be a U.S. citizen or hold a Permanent Resident Card, i.e. Green Card, or be an allowable per changing government hiring regulations.  Security Clearance:Prior or active U.S. government authorized security clearance desirable.Contact Cyan Systems:  john@cyan-systems.com",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8961578?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "University of San Francisco",
      "type": "Higher Education"
    },
    "title": "Simulation Assistant",
    "dates": {
      "posted": "Posted 5 days ago",
      "apply_by": "Apply by July 2, 2025 at 9 PM"
    },
    "wage": " $30.75–32.29/hr",
    "location": "Onsite, based in Orange, California, United States",
    "position": { "length": "Part-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Position is for a Simulation Assistant, not related to software engineering, web/app development, data analytics/science, or machine learning",
      "date": ""
    },
    "details": "Simulation AssistantUniversity of San FranciscoR0009444Orange County CampusJob Title:Simulation AssistantJob Summary:The role of the Office Assistant IV (OAIV) - Simulation Assistant is to set up, operate, maintain, troubleshoot, and in some cases do basic repairs of simulation equipment (defined as hospital-type equipment used in simulation activities, and AV/IT equipment used in simulation activities). The OAIV - Simulation Assistant assists simulation director in orienting faculty and learners in the use of technical equipment used in simulation. In addition, assists in operational activities such as staff and maintenance scheduling, and inventory/purchasing functions. The OAIV - Simulation Assistant is familiar with the various modalities of simulation education and has a working knowledge of simulation educational principles; thus is able to assist in the development, setup, and delivery, and takedown of simulation education sessions. They will also assist in staff on-boarding and other activities as required.Full Job Description:Key Accountabilities:Simulation Equipment• Sets up and uses functionality of equipment as appropriate for the requirements of each simulation activity and overall activities of the center.• Maintains storage areas to a high standard; selects appropriate storage areas for equipment.• Maintains the clinical and educational equipment to a high standard including cleaning and basic maintenance.• Attends vendor training sessions, conferences, etc. for training on simulation, hospital, and AV/IT equipment.• Operates and is able to troubleshoot hospital equipment used in the simulation/in situ environment (beds, pumps, ventilators, etc.).• Control, program, maintain, and troubleshoot patient simulators (voice and physiological parameters) during scenario-based training sessions, open days, and demonstrations.• Maintains an equipment inventory and schedule of maintenance and technical activities.• Maintains equipment including routine cleaning and care, advanced maintenance (including parts repair and replacement), and coordinates with vendors to send equipment for repair/servicing when needed.Simulation Environment• Sets up using appropriate checklists for environment/simulation.• Operates equipment/AV system in rooms including equipment, supplies, moulage, etc. for simulation activities• Take down and debriefingAudiovisual equipment/LMS• Has knowledge of LMS (Laerdal Medical Systems) and AV systems and can assist and advise clinical educators to maximize use.• Oversees installation, installs, tests, and operates IT and AV equipment and software or delegates to appropriate technicians.• Operates AV/LMS systems in context of overall simulation infrastructure.• Operates AV system components/functions including cameras, recording/playback, exporting, etc.; troubleshoots AV system; understands interface with hospital AV systems.• Operates AV systems remotely and uses mobile AV systems.Script or scenario• Involved with scenario planning and design and can give advice on the integrity of the scenario by contributing to testing.• Assists with the running of scenarios including directing and coordination of scenarios.• May be involved with the educational aspects of scenarios including debriefing/feedback.• Instructs actors or acts during scenarios; acts as voice of manikin during scenarios.Quality Assurance• Under the direction of the Simulation Director, maintains systems, staff availability and scheduling, and equipment to a high standard.• Under the direction of the Simulation Director, ensures compliance with the legal and regulatory.• Actively involved in implementing quality improvement programs using simulation to promote standards and policies.Inventory Control/Purchasing• Maintains stock levels to meet maintenance needs.• Makes recommendations for the purchase of equipment, supplies, and materials required for simulation-based sessions to the Director of Simulation.Advisory• Introduces to instructors the different modalities of simulation training to meet learning objectives appropriate to selected learners - mannequin, part task trainer, SP, etc.• Advises instructors during the design and running of scenarios.• Assists with other staff from the simulation team to develop training programs and clinical scenarios. Involved with scenario planning and design and can give advice on the integrity of the scenario by contributing to testing.Other• Collaborates with other staff from the simulation team to run training programs and clinical scenarios.• Supports learners to maintain a safe learning environment.• May be involved with the educational aspects of scenarios including debriefing/feedback.• Assists with other simulation staff to develop training programs and clinical scenarios.• Suggests and implements solutions to enhance the delivery of simulation-based education through technological developments and creation of artifacts, such as moulage.• Assists with the piloting and delivery of simulation-based training and other educational activities undertaken during the simulation project, commissioning, and operational phases.• Troubleshoots technical issues with mannequins and equipment and can mobilize resources to ensure functionality of equipment for course requirements.IT/Technical Duties• Coordinates with Technical Services (IM and Biomedical Engineering) to ensure the AV/IT system, simulation equipment, and hospital-type equipment for simulation center-based and in-situ training is always operational.• Contributes to the strategic planning of the technical infrastructure of the simulation centre in relation to its mission statement.• Reports any technical issues or risks to the Operations Manager that could impact delivery of services.Coordination of Activities• Maintains awareness of scheduling issues in relation to availability of physical and technical resources.• Coordinates and maintains operations manuals in conjunction with vendors and supplies teaching aids to support the clinical educators.Professional Development• Participates in professional and educational activities to maintain professional competencies and current knowledge base.In view of the evolving needs and opportunities, this position may be required to perform other duties as assigned and reporting relationships may vary.Requirements:• Post high school education preferred• Training or experience equivalent to two years of clerical experience or related education• At least two years' experience as a technician in a simulation center including experience in maintaining an equipment inventory and maintenance schedule• Demonstrated ability to operate, maintain, and troubleshoot simulation, hospital, and IT/AV equipment and software used in a clinical education environment• Thorough and comprehensive knowledge of office procedures, practices and methods, and the ability to interpret needs and take the appropriate course of actions• Ability to communicate technical information to non-technical audiences• Demonstrated adaptability and resourcefulness• Ability to acquire new skills and learn new procedures• Fluency in written and spoken English.• Experience working with computer database systems, word processing and spreadsheet software.• Experience with and demonstrated ability to work with a diverse student body, faculty and staff.• Must be customer service and team oriented.Full-Time/Part-Time:Part timePay Rate:HourlySalary Range :$30.75-$32.29 per hourTo apply, visit https://apptrkr.com/5369670.The University of San Francisco is located in the heart of one of the world’s most innovative and diverse cities, and is home to a vibrant academic community of students and faculty who achieve excellence in their fields. Its diverse student body enjoys direct access to faculty, small classes and outstanding opportunities in the city itself. USF is San Francisco's first university, and its Jesuit Catholic mission helps ignite a student’s passion for social justice and a desire to “Change the World From Here.” For more information, visit http://www.usfca.edu.Copyright ©2024 Jobelephant.com Inc. All rights reserved.https://www.jobelephant.com/jeid-023d0036d4a96549875034b2f9de5151",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9088958?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Sensofly Inc", "type": "Other Industries" },
    "title": "Part Time Drone Instructor",
    "dates": {
      "posted": "Posted 6 days ago",
      "apply_by": "Apply by January 2, 2025 at 2 PM"
    },
    "wage": " $20–32/hr",
    "location": "Onsite, based in Fullerton, California, United States, Tustin, California, United States, +1",
    "position": { "length": "Part-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Position does not align with candidate's qualifications and location preferences.",
      "date": ""
    },
    "details": "Sensofly is a Southern California center of excellence for drone training, photography, and engineering services. We have trained clients from a variety of industries (real estate, construction, facilities, public safety, and more). We currently have an exciting opportunity for a Part Time Drone Instructor throughout Orange County, where you can share your passion and knowledge of drones.In this role, you will be teaching drone lessons in one or more of the following topics: flight fundamentals, photography, video, mapping, FPV racing, Part 107 preparation. This part time job has flexible hours and class times and locations are arranged depending on student and instructor availability. Teaching locations will occur in the target region specified in the job title and will typically be a public park or company property (for corporate customers). Class sizes range from 1 to 20 students. Maximum student teacher ratio of 6, large classes will have be multiple instructors.Responsibilities:Teach drone classes in one or more of the following topicsIntro to DronesDrones for Kids (afterschool & summer)Photography & VideoMapping & InspectionFPVPart 107 Test PreparationRequired Knowledge, Skills, and Abilities:Must be able to travel to various teaching locations (within your local region of Southern California)Ability to work with students of diverse ethnic backgrounds, academic profiles, ages, and skill levels.Strong interpersonal, organizational, and communication skills.Knowledge and ability to demonstrate skill in drone piloting and instruction.Passion for drones and teachingAbility to accept on lessons with as little as 3 days notice.Preferred CandidateFAA Part 107 certifiedAt least 100 hours as Pilot-in-Command (PIC) on DJI DroneOwn a DJI Drone that students can use in the class.Teaching experienceDrone specialty skills (Mapping, GIS, thermal, inspection)Technical skills (build FPV or custom drones)Creative skills (Photography, video, and post processing editing)Manned Pilot Certifications (i.e. Private Pilot, Instrument rating)Multilingual (Spanish and Chinese preferred)Job Type: Part-timePay: $20.00 - $32.00 per hourExpected hours: 1 – 19 per weekSchedule:Choose your own hours Work setting:In-person Application Question(s):Do you own a DJI Drone?Are you in Orange County, CA? Experience:Drone Piloting: 1 year (Preferred) Work Location: In person",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9087899?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - College of Business/IBM",
      "type": "Higher Education"
    },
    "title": "Brand Community Engagement Specialist",
    "dates": {
      "posted": "Posted 5 days ago",
      "apply_by": "Apply by July 31, 2024 at 6 AM"
    },
    "wage": " $20/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙20 hours a week",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for Brand Community Engagement Specialist, not related to software engineering, web/app development, data analytics/science, or machine learning.",
      "date": ""
    },
    "details": "The Centerfor Customer Insights and Digital Marketing is hiring a Brand Community Engagement Specialist. The job description is below.Position Name: Brand Community Engagement Specialist.Major Function: The position holder will assist the center directors in planning and executing brand engagement activities that will increase awareness and drive engagement with its constituency both online and offline.ResponsibilitiesSupport the directors in developing strategies to deliver results and incorporate research needs into surveys, messaging, and planning as needed. Champion digital marketing and analytics community events.Create and execute various digital marketing plans (e.g., email, contact update, social media posts, organizing events, etc.) to increase awareness, engagement, and conversation about the center programs among key audiences, such as alumni, business professionals, current and potential MSDM students, and undergraduate students.Collaborate with center directors and various partners on campus to develop creative and effective communication and engagement materials. Identifies and aligns with CCIDM’s missions and work culture. Perform other duties as assigned. Required Qualifications: Strong written and verbal communication skills are required.Excellent interpersonal skills requiring knowing when to use courtesy, tact, and/or diplomacy to effectively communicate with all constituents. Strong project management skills Skilled with Microsoft Office tools and Google Drive toolsFamiliarity with graphics tools (e.g., Adobe Creative Suite, Canva, etc.) Ability to operate with independence, under pressure, to meet deadlines and commitments. Ability to set priorities, manage a multitude of details simultaneously in a fast-paced environment, and work effectively both independently and in a team environment.  Preferred Qualifications: Applicants who will be enrolled in a graduate program at the Singelyn Graduate School of Business, College of Business Administration, are strongly preferred.Minimum of 6 months of professional experience in digital marketing, marketing, or related fields.Familiar with digital marketing tools such as Google Analytics, HubSpot CRM tool, and MailChimp.  ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9089754?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  null,
  {
    "employer": { "name": "Silvus Technologies", "type": "Telecommunications" },
    "title": "Intern - Software Engineer",
    "dates": {
      "posted": "Posted 5 months ago",
      "apply_by": "Apply by July 16, 2024 at 6 AM"
    },
    "wage": " $27/hr",
    "location": "Onsite, based in Los Angeles, California, United States",
    "position": {
      "length": "Full-time∙From March 4 to May 31",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:44:21 AM"
    },
    "details": "Intern - Software Test EngineerLos AngelesSilvus Technologies is dedicated to one mission: connecting those who keep us safe. We do so by delivering the most advanced Mobile Ad-hoc Network (MANET) radios powered by our custom and ever evolving Mobile-Networked MIMO waveform. Together, our radios and waveform provide the vital communications for mission critical applications in the harshest environments from underground tunnels to high altitude balloons.Silvus StreamCaster™ radios are being rapidly adopted by customers all over the world ranging from the U.S. and Allied Nations Departments of Defense, to International, Federal, State and Local Law Enforcement agencies, all the way to the Superbowl, Grammys and industry-leading drone, robot, and other unmanned systems manufacturers.Wouldn’t you like to join an incredibly talented group of people, doing very challenging work, with the prime directive of “Keeping Our Heroes Connected”?Silvus’ rapid growth is fueled by a focus on research and innovation and a team of the most passionate, skilled, and creative thinking individuals. If you are looking for a challenging experience, you owe it to yourself to learn how Silvus can provide a rewarding internship that creates a pathway to a fulfilling career.POSITION SUMMARYThe Intern – Software Test Engineer position reports to the Director of Software Engineering within the Software Engineering team.  The successful individual in this role will be actively involved in supporting and developing test automation projects. This internship position is full-time, on-site daily Monday through Friday. The location for this role is Silvus Technologies’ HQ in the heart of vibrant West LA.ROLE AND RESPONSIBILITIESAutomate the verification processes for our StreamCaster GUI and automate API tests.Work closely with cross-disciplinary teams to identify software quality risks, develop test plans, and execute these plans to ensure software integrity.Triage software defect reports and coordinate with engineers for their resolution.Perform exploratory and verification testing on new features and bug fixes.REQUIRED QUALIFICATIONSIn-progress bachelor's or master’s degree in computer science or other related technical fields.Python, Bash Scripting.Root Cause Analysis.PREFERRED KNOWLEDGE SKILLS AND ABILITIESIn-progress bachelor's or master’s degree in computer electronics.C / C++Software automation or software testing experience.TCP/IP networking experience.Familiarity with RF concepts.WORKING CONDITIONS & PHYSICAL REQUIREMENTSIndoor air-conditioned facility.Lift equipment for setup of demos and testing.Walking/Moving in the lab.COMPENSATIONThe pay range is NOT a guarantee. It is based on market research and peer data, and will vary depending on the candidate’s experience and qualifications.CA Pay Range$27 - $27 USDNOTE - As a US Federal Contractor, Silvus Technologies requires that ALL candidates being considered for employment for any position (regardless of level) MUST be a U.S. Person (permanent resident or citizen).  Stricter U.S. Citizen ONLY requirements (needed for some Engineering or R&D roles) will be included in the Required Qualifications section of the posted position.  Employment is contingent upon the successful clearance of a background check. This does not apply to international positions; only job postings for positions located in the US.Silvus is proud to be an equal opportunity employer, and we value diversity. We do not discriminate on the basis of race, color, age, religion or belief, ancestry, national origin, sex (including pregnancy), sexual orientation, gender identity and/or expression, marital, civil union, or domestic partnership status, physical or mental disability, protected veteran status, genetic information, political affiliation, or any other factor protected by applicable federal, state, or local laws.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive benefits and privileges of employment. Please contact us to request accommodation.*Silvus does not accept unsolicited resumes from individual recruiters or third-party recruiting agencies in response to job postings. No fee will be paid to third parties who submit unsolicited candidates directly to Silvus Technologies.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8587932?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Siemens Digital Industries Software",
      "type": "Internet & Software"
    },
    "title": "Software Product Quality Assurance Intern",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by September 30, 2024 at 3 AM"
    },
    "wage": " $20–30/hr",
    "location": "Hybrid, based in Huntsville, Alabama, United States",
    "position": {
      "length": "Full-time∙From September 2 to December 20",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is a Software Product Quality Assurance Intern role in Huntsville, Alabama, not in the preferred location or field of interest",
      "date": ""
    },
    "details": "Siemens Industry Software Inc.Strategic Student Program (SSP)Discover your career with us at Siemens Industry Software!We are a leading global software company dedicated to the world of computer aided design, 3D modeling and simulation— helping innovative global manufacturers design better products, faster! With the resources of a large company, and the energy of a software start-up, we have fun together while creating a world class software portfolio. Our culture encourages creativity, welcomes fresh thinking and focuses on growth, so our people, our business, and our customers can achieve their full potential.We’re currently recruiting students for our Fall 2024 Strategic Student Program. Our intern positions will allow you to find a career path that most inspires you. Here, you will apply your education to solve real-world problems, and turn theory into practice. At Siemens, our goal is to empower our students to become the next leaders of our company.Baseline Requirements:Currently enrolled as a university student (undergraduate or graduate) in their Sophomore year or above.Minimum 3.0 GPAAvailable to work Full-time starting Fall 2024 and rotating every other semester.Authorized to work in the United States without the need for current or future sponsorship by the companyHybrid – Huntsville, AlabamaPerks:Paid volunteer time offEmployee discounts at our top customer sitesNetworking with our global leadersMentorship from senior engineersIndividual career development planningProfessional and technical workshopsEnergetic student communityLeadership opportunitiesPotential for full time offers after university graduation and completion of the programElectronic Board Systems (EBS) -Product Quality Assurance (PQA) TeamSoftware Development InternshipWe are looking for dedicated candidates to join our team as Software PQA Intern. As a Software PQA Intern, you will play a crucial role in ensuring the quality and productivity of Siemens EDA applications. This opportunity offers hands-on experience, mentorship, and a dynamic work environment where you will contribute to the development and enhancement of software products.Key Responsibilities:Collaborate within an Agile Software Development Team, working alongside experienced members who will provide guidance, training, and daily support.Participate in the software development life cycle, including testing, validation, and debugging.Contribute to quality assurance efforts to meet customer expectations and ensure compliance with design and implementation requirements.Assist in identifying and resolving issues, implementing test cases, and verifying software functionality.Engage in continuous learning and skill development as part of the engineering team.Gain hands-on experience in software quality assurance within a supportive and collaborative team.Work with cutting-edge technology and tools in a dynamic, Agile development environment.Engage in opportunities for mentorship and professional growth as you contribute to real-world projects.Contribute to products that impact industries and society as a whole.Build a foundation for a successful career in software engineering.Qualifications:Enrolled in a Bachelor's or Master's program majoring in Electrical Engineering, Computer Engineering, or Computer Science.At least a sophomore-level student or above in an Undergraduate or Graduate degree program.Strong educational background and technical skills aligned with the position's requirements.A passion for growth and a commitment to achieving excellence as an engineer.Excellent problem-solving skills and a keen interest in software development.If you're looking to jumpstart your career in software quality assurance and engineering, we invite you to apply and join our team. We value diversity, innovation, and a passion for excellence. Together, we can drive innovation and shape the future of technology.We are SiemensA collection of over 377,000 minds building the future, one day at a time in over 200 countries. We're dedicated to equality, and we welcome applications that reflect the diversity of the communities we work in. All employment decisions at Siemens are based on qualifications, merit, and business need. Bring your curiosity and creativity and help us shape tomorrow! We offer a comprehensive reward package which includes a competitive basic salary, bonus scheme, generous holiday allowance, pension, and private healthcare.Working at Siemens Software | Why us?Working at Siemens Software means flexibility - Choosing between working at home and the office at other times is the norm here. We offer great benefits and rewards, as you'd expect from a world leader in industrial software.We are an equal opportunity employer and value diversity at our company. We do not discriminate based on race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Equal Employment Opportunity StatementSiemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.Reasonable AccommodationsIf you require a reasonable accommodation in completing a job application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please fill out the accommodations form by clicking on this link Accomodation for disablity form If you’re unable to complete the form, you can reach out to our AskHR team for support at 1-866-743-6367. Please note our AskHR representatives do not have visibility of application or interview status.EEO is the LawApplicants and employees are protected under Federal law from discrimination. To learn more, Click here.Pay Transparency Non-Discrimination ProvisionSiemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.California Privacy NoticeCalifornia residents have the right to receive additional notices about their personal information. To learn more, click here. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9024577?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - College of Business/IBM",
      "type": "Higher Education"
    },
    "title": "Marketing and International Business Assistant",
    "dates": {
      "posted": "Posted 2 weeks ago",
      "apply_by": "Apply by September 30, 2024 at 6 AM"
    },
    "wage": " $16–20/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙20 hours a week",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "More documents required",
      "date": "7/9/2024, 2:44:27 AM"
    },
    "details": "The IBM Department in the College of Business is seeking an organized, motivated and outgoing individual. Under the supervision of Dr. Jun Myers, the Student Assistant will be responsible for the following primary duties:Passion in supporting student success on campus.Desire to grow professionally in Marketing, International Business, or other management related disciplinesExperienced in customer serviceProficiency with Microsoft Office suite particularly Excel, PowerPoint, and Canvas, Zoom, Google Drive toolsExperienced or had training/courses in marketing communications including social media and digital platforms (please send your visual and written samples)Self-motivated, detail oriented, and attentive to deadlinesExcellent team communication skills: follow oral and written instructions; work cooperatively with faculty, staff, and students; communicate effectively with all levels; and read and write English at a level appropriate to the positionStudent is authorized to work in the United States and can provide employment eligibility documents.QUALIFICATIONS:The requirements listed below include the equipment and knowledge, skills, and/or abilities required. (eg. Computer skills)1. Education/Experience● Strong oral and written communication skills in English are required.● Education or job experience in an office environment is a plus but not required.● Education or job experience in event planning, hospitality, journalism, communications, organizational development, marketing and/or public relations is a plus but not required.2. Knowledge, Skills, Abilities required● Ability to communicate clearly, effectively and congenially in spoken and written English.● Ability to speak and write in a second language is a plus but not required.● Ability to work independently with minimal supervision.● Ability to multi-task and prioritize tasks to meet deadlines.● Intermediate or advanced proficiency in Google applications.● Intermediate or advanced proficiency in Microsoft Office Professional suite.● Novice or intermediate proficiency in Adobe Creative Cloud suite.● Novice or intermediate proficiency in social media platforms is a plus.● Detail-oriented and diligent to follow-up and complete tasks for assigned projects.● A positive, pleasant attitude with good problem-solving skills.● Professional attire may be required for special events.2PHYSICAL REQUIREMENTS:The requirements listed below include physical abilities required to complete essential duties (eg. ability to lift 50 lbs using a fork truck)Reasonable accommodations may be made to enable individual with disabilities to perform the essential functions.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9060254?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  null,
  {
    "employer": { "name": "Lavner Education", "type": "Other Education" },
    "title": "Paid STEM Instructor Intern - UCLA, UC Irvine",
    "dates": {
      "posted": "Posted 6 months ago",
      "apply_by": "Apply by July 12, 2024 at 3 PM"
    },
    "wage": " $18/hr",
    "location": "Onsite, based in Los Angeles, California, United States, or Irvine, California, United States",
    "position": {
      "length": "Full-time∙From July 8 to August 16",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for a STEM Instructor Intern at Lavner Education, not in software engineering, web/app development, data analytics/science, or machine learning field.",
      "date": ""
    },
    "details": "﻿Apply to Work at In-Person Tech Camps for Summer 2024!Job Locations and Dates: UCLA: July 8 - August 16UC Irvine: August 5 - August 16Job Hours: Monday-Friday, 8am - 4pmPay Rate: $18 per hourHousing is not provided so you must be able to commute daily to and from campusLavner Education is seeking passionate and engaging individuals who want to grow their tech, teaching, and leadership skills in a fun and rewarding environment this summer. Gain hands-on STEM experience, build your resume, and make a positive impact teaching students this summer! WHY JOIN CAMP TECH REVOLUTION?Gain meaningful STEM, teaching, and leadership experiencePaid positionBuild your resumeExcellent letters of recommendation for great workDetailed curriculum and full-time supportReceive training from EdTech experts in the fieldBecome a valued member of Lavner Education's robust network of team members, alumni, and affiliates across the educational landscape Lavner Education, one of the world's leading EdTech companies for kids, powers the Lavner Camps, Tech Revolution, Lavner IQ, and Lavner Fitness brands, offering year-round camps, classes, tournaments, and online tutoring to kids worldwide. Whether at locations like UPenn, NYU, WashU, UW-Seattle, and UCLA, or through online camps and private instruction, our multi-layered approach to education is redefining the industry like never before. By embracing the concept that kids should love what they do and have the opportunity for high-quality live, interactive learning in an inclusive environment, we create cutting-edge learning experiences that feature top-notch curricula and superstar instructors, all backed by a dedicated and mission-driven leadership team.  JOB RESPONSIBILITIESDeliver quality, educational instruction to elementary and middle school-aged students in a class and one-on-one environment from the provided curriculum for topics including Coding, Robotics, Minecraft, Roblox, Game Design, STEM & Medicine, 3D Modeling & 3D Printing, All-Girls STEAM, Science, Chess, and much moreAssist with the setup and maintenance of on-site computer hardware, software, and internet connectivityProvide ongoing troubleshooting and technical support to staff and studentsCommunicate tech issues quickly and effectively to company headquarters and offer solutionsPerform weekly inventory management and trackingBe a positive role model for campers and staff, arriving every day with an inclusive, professional, and upbeat attitude QUALIFICATIONSEducation, training, or experience in Computer Science, Engineering, Education, or related STEM fieldsA background in working with kids and teens is highly recommended, but not requiredWillingness to perform all job duties with enthusiasm and a positive outlookDeep appreciation for teamwork and drive to be part of a high-level teamCandidates must demonstrate flexibility, leadership abilities, and strong communication skillsRequired clearances, or ability to obtain them prior to start date. Lavner Education will reimburse employees for the costs of the clearances if they need to be obtained. For more information on our summer tech camps and locations please visit lavnercamps.comEmail: hr@lavnercamps.com",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8518255?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "POLY Consulting", "type": "Other Industries" },
    "title": "Data Analyst",
    "dates": { "posted": "Posted 3 weeks ago", "apply_by": "Applied" },
    "wage": " $60–70K/yrMedical, dental, and vision coverage plus paid time off",
    "location": "Onsite, based in Huntington Beach, California, United States",
    "position": { "length": "Full-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Position is onsite in Huntington Beach, not near Fontana or Pomona",
      "date": ""
    },
    "details": "We are looking for a data driven person to help identify, gather and analyze the data necessary for the client growth strategies identified by the strategists.  You need to be very good at Python and Excel to build multi-layered models.  We will train you on our marketplace research tools.  A general knowledge of AI is helpful.  You must have the ability to effectively communicate and present the data in an understandable format for business decision making.You will be working directly with the Business Leads, Strategists and Senior Management.This is an entry level full time in-office position with close collaboration with the team.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9051874?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Whova, Inc.", "type": "Internet & Software" },
    "title": "Software Engineer",
    "dates": {
      "posted": "Posted 3 weeks ago",
      "apply_by": "Apply by January 1, 2025 at 6 AM"
    },
    "wage": " $70–100K/yrMedical, dental, and vision coverage plus paid time off",
    "location": "Hybrid or onsite, based in San Diego, California, United States",
    "position": { "length": "Full-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Position is based in San Diego, not near Fontana or Pomona",
      "date": ""
    },
    "details": "Whova is seeking full-time Software Engineers! As a member of our engineering team, you will tackle challenging issues of scale, reliability, and security while delivering a delightful, simple user experience to a global user base. You can either join the front end team for building and improving the mobile and web platforms or the backend team for building and improving the backend services across all Whova products.Whova is a fast-growing company with customers in more than 100 countries. We are proud to receive the San Diego Business Journal's Best Places to Work in San Diego award, five years in a row.** Watch the 2-min video to learn more about our culture **Responsibilities & Requirements:Build scalable front-end applications to support the growing needs of the businessDesign, develop and deploy backend services with the focus on high availability, low latency, and scalabilityHelp improve our code quality through writing unit tests, automation and performing code reviewsWork with the product and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solutionDive into difficult problems and successfully deliver results on scheduleDesired Skills & ExperienceYou have a deep understanding of how the computer system worksYou are comfortable writing PythonExperience with JavaScript, HTML, CSS, and other front-end technologiesYou have a good understanding of data structures and algorithms, and understand how to apply them to design pragmatic solutionsYou find satisfaction in a job well done and want to solve head-scratching challengesBenefitsSalary: $70K-$100K per year, based on experiences and skills in software development (Front end(web/mobile), Backend, Full stack, database experiences, etc)Health benefits package (medical, dental, vision)401k after 6 months3 weeks paid time off, 3 days paid sick leave, paid holidaysCollaborative office environmentIn-office gymTwo company-provided lunches each weekWorking from home every Friday",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8931606?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "American Institute for Behavioral Research and Technology",
      "type": "Research"
    },
    "title": "Data Analyst Intern",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by August 15, 2024 at 6 AM"
    },
    "wage": " Unpaid",
    "location": "Onsite, based in San Diego, California, United States",
    "position": { "length": "Part-time∙10 hours a week", "type": "Internship" },
    "application_status": {
      "applied": false,
      "reason": "Position is unpaid and not in preferred locations or meeting payment requirement",
      "date": ""
    },
    "details": "The American Institute for Behavioral Research and Technology (https://aibrt.org) is looking for talented and highly motivated students and/or graduates to work with our non-profit development team under the supervision of distinguished psychologist Dr. Robert Epstein. Dr. Epstein is the former editor-in-chief of Psychology Today magazine, a Ph.D. of Harvard University, and the author of 15 books and more than 300 articles. He is also one of the most frequently interviewed psychologists in the world (https://drrobertepstein.com/index.php/media-coverage).RequirementsAs a data analyst intern, you will gain exceptional experience working on a highly-skilled, multidisciplinary team of researchers and professionals. Interns are quickly assigned to one or more projects that match their interests and learn valuable skills as they go. Candidates should be self-starters with strong programming and statistical analysis skills. Candidates must have advanced Python and MySQL knowledge. Experience with PHP, R, SPSS, C++, and Java Script would be helpful. Experience with research and large data sets is also a plus.Please note that this position requires interns to work on-site here in North County San Diego. Remote applicants will not be considered. Summer or winter break interns generally work at least 20 hours per week on-site. School-year interns must work a minimum of 10 hours per week on-site. Interns work at a coastal facility about 30 minutes north of beautiful San Diego, California. It's close to the beach and just a short train ride away from Pacific Beach and downtown San Diego. This is an unpaid internship, although some expenses might be covered. Additionally, you will be eligible to receive a letter of recommendation from Dr. Epstein after completing 140 hours of on-site work. This is a fantastic opportunity for motivated and skilled writers looking to improve their application to graduate school and/or gain meaningful experience for their resumes.Current projects at AIBRT cover a wide range of topics:Search Engine Manipulation Effect (SEME)AdolescenceCreativityLove and relationshipsParentingStress managementMotivationMorality& many more In order to apply, please provide the following: CVCover letter is recommended but not requiredA sample of your programing or web development work  About American Institute for Behavioral Research & TechnologyThe American Institute for Behavioral Research and Technology is a nonprofit, nonpartisan 501(c)(3) organization based in Vista, California, USA, which promotes and conducts research that has the potential to increase the well-being and functioning of people worldwide. It currently has ongoing research projects in eleven different topic areas. Please be sure to visit our organizations website (http://aibrt.org/) before applying for any intern position in order to view our on-going activities. In addition, if you would like to know more about Dr. Epstein's career in Psychology then click the link below to view Dr. Epstein's STEM-Talk Episode. https://www.ihmc.us/stemtalk/episode-89/ If you plan on e-mailing anyone associated with AIBRT, please do so via Proton Mail (https://protonmail.com/). If we are e-mailed with any other e-mail it will not be read due to our need for security and privacy. Thank you.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8978492?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Design West Technologies Inc.", "type": "Defense" },
    "title": "Web Developer",
    "dates": {
      "posted": "Posted 1 week ago",
      "apply_by": "Apply by September 30, 2024 at 6 AM"
    },
    "wage": " $100–110K/yrMedical, dental, and vision coverage plus paid time off",
    "location": "Onsite, based in Tustin, California, United States",
    "position": { "length": "Full-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Position is onsite in Tustin, California, not near Fontana or Pomona",
      "date": ""
    },
    "details": "Design West Technologies Inc. (DWT) is a leading provider of cutting-edge aerospace and military technologies. With a commitment to excellence and innovation, we specialize in designing, manufacturing, and delivering high-performance solutions for our clients worldwide. Our team comprises passionate professionals dedicated to pushing the boundaries of what is possible in aerospace and defense.Position Overview:DWT has an immediate need for Web Developer (onsite position). Under minimal supervision, responsible for analyzing business requirements and designing solutions to meet those requirements. They will also be responsible for testing, implementing, and maintaining software applications and systems to improve business processes.Key Job Duties:Collaborate with business stakeholders to understand their requirements and identify opportunities for process improvementDevelop detailed requirements and use cases for software development projectsConduct research to identify new technologies and methods to improve business processesAnalyze and troubleshoot software issues, identify root causes, and implement solutionsDevelop and maintain documentation such as user manuals, training materials, and technical specificationsUsing PHP MySQL to develop various web application to help improve productivity and project management.Maintain and improve company internal website.Provide backup IT desktop support (desktop and network support) as neededRequirements:Bachelors in Software Engineering, Computer Science or related field preferred1-3 years of experience in a manufacturing environment preferredExperience with PHP, MySQL, JavaScript, HTML, CSS, C# preferredExperience with Sage preferredExperience with both front-end GUI and backend database preferred.Excellent problem-solving skills and attention to detailStrong analytical and critical thinking skillsEffective communication and interpersonal skillsAbility to work independently and in a team environmentProficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Visio)Participate in software testing and quality assurance activitiesCommunicate project status and progress to team members and stakeholdersProvide support to end-users and resolve issues in a timely mannerKnowledge of software development methodologies and programming languagesExperience with software testing and quality assuranceFamiliarity with project management tools and techniquesUnderstanding of Agile or Scrum software development methodologiesKnowledge of SQL and database management systemsOnsite positionBenefits:Competitive salary commensurate with experience.Comprehensive benefits package including medical, dental, and vision coverage.401(k) retirement savings plan.Paid time off and holidays.Exciting and challenging work in a dynamic industry with opportunities for growth and advancement.Join our team and be a part of shaping the future of aerospace and defense technology! If you have the skills, experience, and passion to excel in this role, we encourage you to apply.Design West Technologies Inc. is an equal opportunity employer and is committed to diversity in the workplace. We encourage applications from all qualified individuals, including those with diverse backgrounds and those with disabilities.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9077651?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "BILL", "type": "Financial Services" },
    "title": "Machine Learning Engineer Intern",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by November 30, 2024 at 5 AM"
    },
    "wage": " $44–62/hrMedical, dental, and vision coverage plus paid time off",
    "location": "Hybrid or onsite, based in San Jose, California, United States, or Draper, Utah, United States",
    "position": {
      "length": "Full-time∙From May 27 to August 8",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:44:32 AM"
    },
    "details": "BILL is a leader in financial automation software for small and midsize businesses (SMBs). As a champion of SMBs, we are dedicated to automating the future of finance so businesses can thrive. Hundreds of thousands of businesses trust BILL solutions to manage financial workflows, including payables, receivables, and spend and expense management. With BILL, businesses are connected to a network of millions of members, so they can pay or get paid faster. Through our automated solutions, we help SMBs simplify and control their finances, so they can confidently manage their businesses, and succeed on their terms. BILL is currently recruiting for a Machine Learning Engineer Intern for Summer 2025. This position is based in San Jose, CA or Draper, UT. We’d love to chat if you have:Proficiency in programming languages commonly used in machine learning, such as PythonExperience with machine learning frameworks and libraries, including TensorFlow, PyTorch, XGBoost, or scikit-learnExperience with data wrangling tools such as SQL and PandasStrong problem-solving skills in the context of designing and implementing machine learning modelsFamiliar with the latest developments in machine learning and artificial intelligenceAn analytical mindset with a focus on creating solutions that align with business objectives and end-user needsRequirements:Must be currently enrolled at an accredited university in the USGraduating with a PhD or Master's degree in Computer Science, Machine Learning, or a related field between December 2025 and July 2026About the BILL Intern Program:The BILL Summer Intern Program is full of fantastic opportunities to immerse yourself in our #incrediBILL culture and live our company values during your 11-week, paid experience. During your internship, you’ll own comprehensive projects that have real impacts on small-to-medium sized businesses, our products, and our employees, and you’ll be provided many mentorship and development opportunities along the way to foster a shared passion for SMBs. You’ll engage with leaders through our executive speaker series, and be immersed in our Employee Resource Group initiatives and events so you can get a feel of what matters most here at BILL. No matter which of our offices you’re based out of - San Jose, Houston, or Draper - you’ll experience our Fun value firsthand with Intern Nights Out and group events, and countless other chances to connect with your fellow interns. Sound like your kind of summer? Come join us. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9012669?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Environmental Health and Safety",
      "type": "Higher Education"
    },
    "title": "Student Assistant Positions",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by November 22, 2024 at 6 AM"
    },
    "wage": " $16–16.50/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙From June 1 to May 16",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "More documents required",
      "date": "7/9/2024, 2:44:33 AM"
    },
    "details": "Benefits:Valuable work experience, collaborative team environment, rolling out new chemical inventory software.Summary:The department of Environmental Health and Safety is seeking 2 student assistants to start in the Summer 2024 term to gain valuable work experience in the field of Environmental Health and Safety. Each student assistant position will be allowed to work 30-40/hrs per week during the summer and 15-20/hrs per week while classes are in session. We will interview on-campus in May/June 2024.Duties:Implementing a new chemical inventory system, inventorying chemicals, assisting with hazard analysis, performing equipment inventories and monthly equipment audits, and GIS data input. Responding to official department inquiries (phone and email), conducting indoor air quality assessments using monitoring equipment, process all incoming food permit requests, conduct regular inspections of temporary food facilities, assist in performing inspections with the Deputy State Fire Marshal, maintain department records, imaging and organizing department files, follow department record retention policies, assist with department training's such as fire extinguisher training's, perform regular inspections on campus fire extinguishers, perform monthly inspections on safety showers and emergency eye wash stations, fume hoods and bio-safety cabinets. The incumbent will be responsible for assisting the department in developing a safety equipment database where records of inspection and testing are to be housed. Other job duties can include hazardous waste management, weekly hazardous water facility inspections, compliance surveys, office management, website updates, PPE management, COVID related tasks, and spill kit management.Minimum Qualifications:Applicants should be enrolled in classes and maintain a minimum of 3.0 GPA.It is recommended that applicants are in their second year or greater.Must be able to work at least 18-20 hours per week.Background Check:Satisfactory completion of a background check (including a criminal records check) is required for employment. CSU will make a conditional offer of employment, which may be rescinded if the background check reveals disqualifying information, and/or it is discovered that the candidate knowingly withheld or falsified information. Failure to satisfactorily complete the background check may affect the continued employment of a current CSU employee who was conditionally offered the position.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8995014?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Braintrust", "type": "Internet & Software" },
    "title": "AI Code Trainers (Part-Time, Remote)",
    "dates": {
      "posted": "Posted 3 months ago",
      "apply_by": "Apply by September 29, 2024 at 6 AM"
    },
    "wage": " $16–55/hr",
    "location": "Remote",
    "position": { "length": "Part-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:44:39 AM"
    },
    "details": "Opportunity OverviewThis role is a fantastic way to supplement your earnings, such as when seeking more stable or full-time opportunities. You will contribute to the advancement of innovative AI models with your specialized knowledge. Our client has already onboarded over 100 talented individuals and is planning to hire many more!Flexibility is key in this role. You can tailor your workload to your availability - we recommend around 20 hours per week, but this is not a cap. The onboarding process is easy, enabling you to start within 48 hours. What to Expect: If you meet the criteria, you'll undergo an ID verification and be invited for a 30-minute technical interview, typically arranged within 2 days. This interview will test your expertise in the area of your choice: JavaScript, Java, C++,  Python, etc. If you successfully pass the interview, you’ll be approved and able to begin work ASAP. Otherwise, the next step will be to complete an async rating & writing assessment. In both scenarios, you will be compensated up to $175 upon successful completion. Required Qualifications:Fluency in English is crucial for clear communication about code and abstract concepts.Skilled in one or more of the following languages: Python, Java, JavaScript / TypeScript, SQL, C/C++/C#, or HTML.Preferred Qualifications:Bachelor’s or Master’s degree in Computer Science or related fields. Students are welcome to apply.Proficiency in one or more additional programming languages or technologies, such as Swift, Ruby, Rust, Go, .NET, Matlab, PHP, HTML, DART, R, Apex, or Shell.Experience in Data Science is a plus.Note: Scale AI uses platforms like Remotask and Outlier to execute this work. Your Responsibilities:Join our client in their partnership with various organizations to refine AI large language models, aimed at enhancing the quality of AI-generated code.Potential tasks include:Assessing AI-generated code quality with detailed justificationsTackling coding problems and crafting functional, efficient solutionsOptimizing code for performanceDeveloping thorough test cases to verify code functionality and efficiencyProducing clear written summaries of coding challengesExplaining how code addresses problems and assessing different solution approachesNo prior AI experience is required! Further instructions will be provided post-application and verification process. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8843230?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Orange County Sanitation District",
      "type": "Utilities and Renewable Energy"
    },
    "title": "Student Intern - Information Technology",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by November 22, 2024 at 6 AM"
    },
    "wage": " $21–24/hr",
    "location": "Onsite, based in 10844 Ellis Avenue, Fountain Valley, California 92708, United States",
    "position": {
      "length": "Part-time∙From July 1 to July 1",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:44:39 AM"
    },
    "details": "Orange County Sanitation District Student Intern - Information TechnologySALARY$21.00 - $24.00 HourlyLOCATIONCA 92708, CAJOB TYPEInternJOB NUMBER687DEPARTMENTAdministrative ServicesDIVISIONInformation TechnologyOPENING DATE05/22/2024CLOSING DATE6/6/2024 5:00 PM PacificDescriptionWhat do you value in your next job?At the Orange County Sanitation District our Core Values form the framework of our organization and reinforce our professional work ethic. If the following values ring true with you, we'd love to invite you to explore our career opportunities further.Integrity, Inclusion, Honesty, and RespectWe aspire to the highest degree of integrity, inclusion, honesty, and respect in our interaction with each other, our suppliers, our customers, and our community. We strive to demonstrate these values in our actions, commitments, and service.  Leadership, Teamwork, and Problem SolvingWe lead by example, acknowledging the value of our resources and using them wisely to achieve our mission. We strive to reach OC San goals through cooperative efforts and collaboration with each other and our constituencies. We work to solve problems in a creative, cost-effective, and safe manner, and we acknowledge team and individual efforts.  Customer Service, Transparency, and AccountabilityWe are committed to acting in a timely, accurate, accessible, and transparent manner through excellent customer service. We are committed to act in the best interest of our internal and external stakeholders.  Resiliency, Innovation, and LearningWe continuously develop ourselves, enhancing our talents, skills, and abilities. We recognize that only through personal growth and development will we progress as an agency and as individuals.  SafetyWe are committed to providing a safe work environment. We will demonstrate leadership, promote individual accountability, and participate actively in the advancement of our health and safety practices. OC San is currently looking to fill the position of Student Intern (Information Technology).Under close supervision, provides technical assistance and support to OC San staff for network, hardware, and software issues. Works with staff to provide technical assistance as requested, providing training on software and hardware use, determining causes of malfunctions through root cause analysis with the assistance of OC San IT staff. Conducts research and provides support for the development of current and new projects within the IT department. Specifically, the successful candidate will be responsible for supporting the major functions within the IT division, to:Assist with user requests for service, troubleshoot issues and help develop solutions.Support PC hardware components, desktop operating systems, and applications. Record activities, solutions, and other responses to incidents and service requests within ticketing application.Work with vendors, perform research and evaluate products to assist with the selection and purchase of system upgrades. Assist with user training for hardware and software.Assists with maintaining records within inventory management application and client management application.Assists with the creation of automated scripts to perform software installs, uninstalls, and other common operating system processes. Perform other duties/projects as assigned.Qualifications & RequirementsRequired High school diploma or equivalent.Full-time college student of at least junior level in good standing in a bachelor’s or graduate degree program in a field of study related to the Sanitation District’s activities.Valid California Class C Driver’s License. DesiredMajoring in Information Technology or closely related field.Proficient in Microsoft Office 365, SharePoint and Windows 10 operating system.Ability to prioritize tasks and effectively manage time.Customer service oriented and experience working in a customer service driven environment.Ability to exercise good judgement and effectiveness in working within a team environment.Ability to develop, maintain, and promote strong relationships. Strong written and verbal communication skills.Ability to define problems, collect data, establish facts, and draw valid conclusions.Familiarity with software installations as well as basic network and computer configurations.Eligibility: Undergraduate and graduate students must be enrolled full-time at a college or university, be in good standing, and maintain a GPA of 2.0 or better to be eligible for a paid internship with the Orange County Sanitation District.Only students who have at least one year of school remaining will be considered.Verification of enrollment from the registrar's office indicating \"student in good standing\" prior to employment with OC San.Applicants must provide a letter of recommendation from a professor, previous employer or internship supervisor as part of their application.Work Schedule: This internship will run concurrently with school and will require a minimum of 15 hours of work on-site each week (and up to 20 hours a week) typically during Monday through Friday between the hours of 7 a.m. and 5 p.m. with some weekend work. OC San will also allow flexibility during final exam periods. Recruitment & Selection ProcessVacancies: 1Apply online at: www.ocsan.gov/jobs  APPLICATION FILING DEADLINE: Thursday, June 6, 2024, by 5:00 PM    Application Process:In order to receive full consideration for an internship with OC San, applicants are required to attach the following documents to their online application:Verification   of   enrollment   from the school, indicating full-time enrollmentLetter of recommendation from a professor, previous employer or internship supervisorCompensation: Undergraduate Student: $21.00/Hour Graduate Student: $24.00/Hour  Supplemental InformationPhysical DemandsMust possess mobility to work in a standard office setting or laboratory, if applicable, and use standard office equipment, including a computer; vision to read printed materials and a computer screen; and hearing and speech to communicate in person and over the telephone. This is primarily a sedentary office classification although standing in work areas and walking between work areas may be required. Finger dexterity is needed to access, enter, and retrieve data using a computer keyboard, typewriter keyboard, or calculator and to operate standard office equipment. Positions in this classification occasionally bend, stoop, kneel, reach, push, and pull drawers open and closed to retrieve and file information. Employees must possess the ability to lift, carry, push, and pull materials and objects up to 25 pounds. Environmental ElementsEmployees work in an office or laboratory, if applicable, environment with moderate noise levels, controlled temperature conditions, and no direct exposure to hazardous physical substances. Employees may interact with upset staff and/or public and private representatives in interpreting and enforcing departmental policies and procedures.Other Information For the full range of duties, responsibilities, and essential job functions please review the Classification Specification for this position found on our website. Applicants must clearly demonstrate, through their application materials, that they meet the minimum requirements as outlined in the job announcement and class specification to receive further consideration. However, meeting the minimum requirements does not guarantee an interview. All properly completed applications will be reviewed, and the most appropriately qualified individuals will be invited to continue in the selection process. False statements may be cause for disqualification, removal from the eligible list, or discharge from employment. All statements made on applications are subject to investigation and verification. To ensure your application is accurate and complete, please review the Job Application Guide.Employment is contingent upon successful completion of OC San’s pre-employment process, which includes a background investigation and a physical examination. For some positions, this may include a drug screen. False statements may be cause for disqualification, removal from the eligible list, or discharge from employment. All statements made on applications are subject to investigation and verification. Reference Checks will be conducted by OC San to verify employment related information for all potential employees once a contingent job offer is made during the background investigation process. This is done to ensure that individuals who join OC San are well qualified and have a strong potential to be successful in their employment. The extent of the inquiry will depend on the position being applied for, but will at least include: Verification/Reference from current and past employersConfirmation of necessary licenses, certificates, and degrees. Please have all necessary documentation ready. Additional inquiries may be necessary depending on the position for which you are applying. Human Resources will also schedule a post-offer physical examination once a job offer has been made.OC San only accepts applications submitted via our online application system. Applications submitted via mail, fax or email will not be accepted. The provisions of this announcement do not constitute an expressed or implied contract. Any provision contained in this announcement may be modified or revoked without notice.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8994711?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Associated Students Inc.,",
      "type": "Higher Education"
    },
    "title": "ASI Care Student Assistant \"Student Position\"",
    "dates": {
      "posted": "Posted 3 weeks ago",
      "apply_by": "Apply by December 17, 2024 at 6 AM"
    },
    "wage": " $16.28/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is not related to software engineering, web/app development, data analytics/science, or machine learning",
      "date": ""
    },
    "details": "Work Schedule: 10-20 hours per week; shifts based on operational need of the organization. This position will be working on campus. OVERVIEWAssociated Students, Inc. employs student-focused professionals with equity-mindsets. Established in 1963, ASI is a non-profit corporation guided by a student board and managed by full-time professional staff.  ASI is considered a part of the Cal Poly Pomona Division of Student Affairs with a dashed reporting line to Administrative Affairs. ASI serves the entire campus population, including over 27,000 students, by providing opportunities for student engagement, student employment, and a multitude of programs and services such as recreation and wellness, student union and activities, student government, and childcare. ASI operational support areas include human resources, financial services, information technology, facilities management, and marketing.  ASI is engaged in the work of being a learning organization. Currently, the guiding ideas of the organization are “under construction” as the team re-imagines its vision, mission, and core values. ASI is looking for dynamic team members who value team learning, co-creation, and adaptability to best serve the needs of our students. POSITION DEFINITIONUnder the direct supervision from the ASI Poly Pantry Manager, the ASI Care Student Assistant performs routine tasks in support of the Poly Pantry’s daily operations, including providing quality customer service, stocking the pantry, managing open hours, promoting the pantry programs and services, maintaining inventory, and a clean environment for the shoppers.  The ASI Care Student Assistant may also assist in planning and implementing programs to educate and inform students about food safety, health, diet, and shopping on a budget.  The Poly Pantry serves to provide access to food and basic necessities, by connecting students impacted by food insecurity, to campus and community-based resources, thereby maximizing student success.   ESSENTIAL DUTIES Operations  Maintain utilization records of shoppers in the Poly Pantry including scanning IDs, processing donations, performing data entryMaintain food inventory, quality control, and rotation of food supply in accordance with policies and proceduresKeep space and storage area clean and organized, including wiping down shelving and refrigerators, organizing, stocking, and quality control and pest inspectionsManage appointments during busy times in the PantryTrack student usage, eligibility requirements and inventory management for reporting purposes.Customer support  Provide quality and consistent customer service to all patrons of the Poly Pantry and provide additional resources and information to assist students in addressing their needsMaintain a caring, respectful, and inclusive environment for all visitors to the Poly PantryMaintain positive and professional working relationships with external agencies, within ASI, and with the campus community including students, staff and alumniPresent a professional appearance and positive attitudeOutreach Assess the needs of the students at large as it relates to programs and servicesRemain current and knowledgeable of services and resources available on and off campus, such as free food at upcoming events and programsRefer students to additional resources available through the Broncos Care Basic Needs Program and the Integrated Care Network on campusAssist in the planning and execution of programs and events related to food insecurity and student healthGeneral Attend staff meetings and all required trainings as scheduledPerform other related duties as assigned  QUALIFICATIONSDemonstrated ability to provide friendly and pleasant customer-oriented service and maintain a professional work conductThree months of customer service experience preferredDemonstrated ability to maintain confidentiality with diplomacy and in a professional demeanorAbility to adhere to work rules, follow routine verbal and written instructions, use time effectively and work productively with general supervisionStrong interpersonal and networking skillsAbility to effectively communicate clearly and concisely, both verbally and in writingStrong conflict resolution skillsAbility to perform research through a variety of methods including the internetMust be safely able to stand, lift and carry 25-35lbsDemonstrated ability to work with a diverse student population and campus communityKnowledge of food insecurity issues at CPP and previous experience with basic needs efforts, preferredExperience tutoring or peer-counseling, preferredRetail experience in market environment, preferredAbility to satisfactorily complete a background check (including a criminal records check)POSITION SENSITIVITY Based on the duties and responsibilities of this position, this position has been designated to be a sensitive position with access to sensitive data.  BACKGROUND CHECK A background check (including a criminal records check) must be completed satisfactorily before any candidate can begin employment with Associated Students, Inc., Cal Poly Pomona. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current ASI employees who apply for this position.EMPLOYMENT ELIGIBILITY Employment with ASI is open to any Cal Poly Pomona student who is at least 16 years old and of legal status to work in the United States. In addition, the employee must be currently enrolled for at least 6.0 units (undergraduate) and 4.0 units (graduate), international student employees must be enrolled in a minimum of 12.0 units (undergraduate) and 6.0 units (graduate) at the end of the drop-add period, have a minimum 2.0 GPA (both Cal Poly Pomona and overall GPA) and be in good standing with the University. Individuals enrolled only in Extended University are not eligible for hire. Exceptions to the unit load requirement are allowed during the summer and winter semesters and for students who have applied for graduation for the current semester.    WORK ENVIRONMENTWhile performing the duties of this job, the employee is frequently required to sit, talk and hear; manual dexterity, eye-hand coordination, and verbal communication; use of office equipment: telephones, calculator, copier and fax. Must be able to walk, stand, bend and lift to 45 pounds.Position subject to an occupational exposure to bloodborne pathogens. Annual bloodborne pathogen training is required. The initial training must be completed before the employee is assigned duties that may result in exposure to blood or bodily fluids. Hepatitis B vaccination will be offered after the training. MANDATED REPORTING REQUIREMENT In compliance with the California Child Abuse and Neglect Reporting Act (CANRA) and the CSU Executive Order 1083, each ASI employee is designated as a mandated reporter and is required to sign an Acknowledgment of Mandated Reporter Status and Legal Duty to Report Child Abuse and Neglect.  SYSTEMWIDE SMOKE AND TOBACCO FREE ENVIRONMENT EO 1108: Cal Poly Pomona is a smoke and tobacco-free campus. Please refer to the link below for policy information. http://www.calstate.edu/EO/EO-1108.html COVID-19 VACCINATIONCSU, along with Associated Students Inc., strongly recommends all staff who are physically accessing campus facilities or programs to be fully vaccinated against COVID-19, which includes obtaining a COVID-19 booster dose. See policy at https://calstate.policystat.com/policy/11030468/latest. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9052268?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Learning Resource Center",
      "type": "Higher Education"
    },
    "title": "Learning Resource Center Student Assistant Test Proctor",
    "dates": {
      "posted": "Posted 8 months ago",
      "apply_by": "Apply by September 30, 2024 at 6 PM"
    },
    "wage": " $16/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "More documents required",
      "date": "7/9/2024, 2:44:39 AM"
    },
    "details": "The Learning Resource Center (LRC) is seeking an organized and motivated individual to join our Testing Services team. The LRC offers make-up testing to CPP students who need to reschedule their exam due to serious and compelling reasons and have received prior approval from their instructor.Under the supervision of the LRC Support Services Coordinator and underthe day-to-day supervision of the LRC Testing Services Coordinator, the Student AssistantTest Proctor will be responsible for: Essential Duties and Responsibilities·     Provide support and assistance to Testing Services Coordinator.·     Assist Coordinator in scheduling and arranging test times for make-up testing.·     Direct examinees to the assigned testing location and seat.·     Assist in ensuring examinee has required materials for examination.·     Observe examinee(s) during the in-person examination.·     Report incidents that may occur during testing to the Testing Services Coordinator.·     Answer incoming inquiries using professional etiquette.·     Disinfect tables in testing area after each session.QUALIFICATIONS: The requirements listed below include the equipment and knowledge, skills, and/or abilities required:   Education/Experience   ·      Strong oral and written communication skills are required.  ·      Applicants must be a current Cal Poly Pomona student and must have and maintain a 2.0 GPAand be enrolled full-time.   Knowledge, Skills, Abilities required   ·      Impeccable integrity and a commitment to upholding standards. ·      Familiarity with common exam practices and procedures. ·      Ability to communicate in person, by phone and email. ·      Ability to multi-task and prioritize tasks to meet deadlines.  ·      Intermediate proficiency in Microsoft Office Professional suite.  ·      Detail-oriented and diligent to follow-up and complete tasks for assignedprojects.  ·      A positive, pleasant attitude with good problem-solving skills.  ·      Must be available to work a minimum of 15 hours per week. If interested, please submit your resume, cover letter, and the Cal Poly Pomona student employment application.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8330442?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Holywudd LLC", "type": "Internet & Software" },
    "title": "Office Admin & Technology Intern (Hollywood)",
    "dates": {
      "posted": "Posted 6 days ago",
      "apply_by": "Apply by January 2, 2025 at 6 AM"
    },
    "wage": " $15.75–55/hr",
    "location": "Hybrid, based in Los Angeles, Los Angeles, California 90028, United States",
    "position": { "length": "Part-time∙30 hours a week", "type": "Internship" },
    "application_status": {
      "applied": false,
      "reason": "Position is for Office Admin & Technology Intern, not related to software engineering, web/app development, data analytics/science, or machine learning",
      "date": ""
    },
    "details": "Begin your professional journey as an Intern in a vibrant Hollywood Talent and Technology Agency, specializing in talent and technology!This Internship has the potential to transition into an hourly position for the right candidate. Are you a detail-oriented individual with a flair for technology? Do you possess a drive to make a positive impact and a keen curiosity about the business aspects of talent and technology? If so, we have an exciting opportunity waiting for you! We are in search of enthusiastic and driven interns to join our dynamic team for a Digital Marketing, Technology, and Administrative Internship. This role offers an exceptional chance to acquire valuable experience in a competitive industry while contributing to an organization dedicated to creating a positive societal impact. **Key Responsibilities:** 1. Aid in the research and identification of potential new talent and business clients. 2. Assist the team in business development by crafting business proposals for prospective clients and companies. 3. Maintain a database of new clients and monitor application statuses. 4. Contribute to team meetings and strategic planning sessions. **Qualifications:** 1. Exceptional written and verbal communication skills. 2. Strong research capabilities and meticulous attention to detail. 3. Proficiency in Gmail Office Suite, Shopify, WIX. 4. Excellent multitasking abilities, deadline-oriented, and highly computer savvy. 5. Interest in technology and web design. **What We Offer:** 1. Hands-on experience in talent, technology, and office administration. 2. Mentorship from seasoned professionals in the industry. 3. Opportunities to work on meaningful projects. 4. Flexible work schedule and a supportive, collaborative work environment. 5. This internship is commission-based, ideal for individuals seeking college credit or valuable work experience. We are dedicated to fostering your professional growth and will provide a comprehensive introduction to the realms of talent, technology, design, and administrative work. If you are enthusiastic about making a difference and eager to learn, we encourage you to apply today and embark on a rewarding professional journey! We are an equal opportunity employer, committed to diversity and inclusivity for all employees and interns.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9086213?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Orange County Sanitation District",
      "type": "Utilities and Renewable Energy"
    },
    "title": "Student Intern (Design)",
    "dates": {
      "posted": "Posted 2 months ago",
      "apply_by": "Apply by October 24, 2024 at 6 AM"
    },
    "wage": " $21–24/hr",
    "location": "Onsite, based in Fountain Valley, California, United States",
    "position": { "length": "Part-time", "type": "Internship" },
    "application_status": {
      "applied": false,
      "reason": "Position is not in software engineering, web/app development, data analytics/science, or machine learning.",
      "date": ""
    },
    "details": "What do you value in your next job? At the Orange County Sanitation District our Core Values form the framework of our organization and reinforce our professional work ethic. If the following values ring true with you, we'd love to invite you to explore our career opportunities further.  Integrity, Inclusion, Honesty, and RespectWe aspire to the highest degree of integrity, inclusion, honesty, and respect in our interaction with each other, our suppliers, our customers, and our community. We strive to demonstrate these values in our actions, commitments, and service. Leadership, Teamwork, and Problem SolvingWe lead by example, acknowledging the value of our resources and using them wisely to achieve our mission. We strive to reach OC San goals through cooperative efforts and collaboration with each other and our constituencies. We work to solve problems in a creative, cost-effective, and safe manner, and we acknowledge team and individual efforts. Customer Service, Transparency, and AccountabilityWe are committed to acting in a timely, accurate, accessible, and transparent manner through excellent customer service. We are committed to act in the best interest of our internal and external stakeholders. Resiliency, Innovation, and LearningWe continuously develop ourselves, enhancing our talents, skills, and abilities. We recognize that only through personal growth and development will we progress as an agency and as individuals. SafetyWe are committed to providing a safe work environment. We will demonstrate leadership, promote individual accountability, and participate actively in the advancement of our health and safety practices.OC San is currently looking to fill the role of a Student Intern (Design). Under close supervision, the selected candidate will perform a variety of duties / tasks as part of the Design Division in its support of the Capital Improvement Program. The successful candidate will work closely with staff on engineering design, design standards and construction support tasks. This may include but is not limited to, updating standards, coordination of design reviews and design records, reviewing construction submittals and shop drawings, investigating design and construction issues, analyzing design drawings and specifications, compiling information, creating presentations, and performing field walks. In addition, the selected candidate will assist with maintaining and organizing files, preparing correspondence, spreadsheets, logs, and performing other related duties as assigned.The ideal candidate for this internship will have the basic understanding and experience in Engineering design and standards, familiarity with design and reading engineering drawings; have a basic understanding in Microsoft Word, Outlook, and Excel; will possess strong verbal and written communication skills; will have the ability to complete tasks in an organized and accurate manner; and will show initiative when given assignments. Moreover, the candidate should be adept to working both collaboratively and independently to achieve project goals efficiently and will adhere to safety guidelines to maintain a secure work environment.  Qualifications & Requirements RequiredHigh school diploma or equivalent; ANDFull-time college student of at least junior level in good standing in a bachelor's or graduate degree program in a field of study related to the Sanitation District’s activities.Licenses and Certifications: Valid California Class C Driver's License. EligibilityUndergraduate and graduate students must be enrolled full-time at a college or university, be in good standing, and maintain a GPA of 2.0 or better to be eligible for a paid internship with the Orange County Sanitation District.Majoring in civil, electrical, or mechanical engineering, or a related field.Only students who have at least one year of school remaining will be considered.Verification of enrollment from the registrar's office indicating \"student in good standing\" prior to employment with OC San.Applicants must provide a letter of recommendation from a professor, previous employer, or internship supervisor as part of their application. Work ScheduleThis internship will run concurrently with school and will require a minimum of 15 hours of work on-site each week (and up to 20 hours a week) typically during Monday through Friday between the hours of 7 a.m. and 5 p.m. OC San will also allow flexibility during final exam periods. Recruitment & Selection ProcessVacancies: 1 (effective July 1, 2024)(an eligible list may be established for future vacancies)Apply online at: www.ocsan.gov/jobs APPLICATION FILING DEADLINE: Wednesday, April 24, 2024, by 5 PM PST.(or until a sufficient number of qualified applications have been received)Application Process:In order to receive full consideration for an internship with OC San, applicants are required to attach the following documents to their online application:Verification of enrollment from the school, indicating full-time enrollmentLetter of recommendation from a professor, previous employer, or internship supervisorCompensation:Undergraduate Student: $21.00/Hour Graduate Student: $24.00/Hour Supplemental Information Physical DemandsMust possess mobility to work in a standard office setting or laboratory, if applicable, and use standard office equipment, including a computer; vision to read printed materials and a computer screen; and hearing and speech to communicate in person and over the telephone. This is primarily a sedentary office classification although standing in work areas and walking between work areas may be required. Finger dexterity is needed to access, enter, and retrieve data using a computer keyboard, typewriter keyboard, or calculator and to operate standard office equipment. Positions in this classification occasionally bend, stoop, kneel, reach, push, and pull drawers open and closed to retrieve and file information. Employees must possess the ability to lift, carry, push, and pull materials and objects up to 25 pounds.Environmental ElementsEmployees work in an office or laboratory, if applicable, environment with moderate noise levels, controlled temperature conditions, and no direct exposure to hazardous physical substances. Employees may interact with upset staff and/or public and private representatives in interpreting and enforcing departmental policies and procedures.Other informationFor the full range of duties, responsibilities, and essential job functions please review the Classification Specification for this position found on our website.Applicants must clearly demonstrate, through their application materials, that they meet the minimum requirements as outlined in the job announcement and class specification to receive further consideration. However, meeting the minimum requirements does not guarantee an interview. All properly completed applications will be reviewed, and the most appropriately qualified individuals will be invited to continue in the selection process.False statements may be cause for disqualification, removal from the eligible list, or discharge from employment. All statements made on applications are subject to investigation and verification.To ensure your application is accurate and complete, please review the Job Application Guide.Employment is contingent upon successful completion of OC San's pre-employment process, which includes a background investigation and a physical examination. For some positions, this may include a drug screen. False statements may be cause for disqualification, removal from the eligible list, or discharge from employment. All statements made on applications are subject to investigation and verification.Reference Checks will be conducted by OC San to verify employment related information for all potential employees once a contingent job offer is made during the background investigation process. This is done to ensure that individuals who join OC San are well qualified and have a strong potential to be successful in their employment. The extent of the inquiry will depend on the position being applied for, but will at least include:Verification/Reference from current and past employersConfirmation of necessary licenses, certificates, and degrees.Please have all necessary documentation ready. Additional inquiries may be necessary depending on the position for which you are applying. Human Resources will also schedule a post-offer physical examination once a job offer has been made.OC San only accepts applications submitted via our online application system. Applications submitted via mail, fax or email will not be accepted.The provisions of this announcement do not constitute an expressed or implied contract. Any provision contained in this announcement may be modified or revoked without notice.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8889624?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Office of New Student Programs & Family Engagement",
      "type": "Higher Education"
    },
    "title": "New Student Programs & Family Engagement Summer Office Assistant",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by September 27, 2024 at 6 AM"
    },
    "wage": " $16.50/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Full-time∙From May 31 to July 31",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "More documents required",
      "date": "7/9/2024, 2:44:47 AM"
    },
    "details": "General Roles & Responsibilities:Represent the office of New Student Programs & Family engagement by providing exemplary customer service to CPP students and their supporters, office guests, and on-campus partners.Utilize effective communication and problem-solving skills while answering emails, phone calls, live website chat, and in-person inquiries.Attend all trainings, events, and work shifts on time as scheduled and communicate any anticipated absences with advanced notice.Help students confirm or change their Orientation reservation and complete any administrative tasks needed to support in the execution of Orientation programming.Assist new students with their transition to campus life by referring them to the appropriate campus resources.Manage and organize office day-to-day operations, office equipment, and supplies.Assist with Office of New Student Programs & Family Engagement events as needed.Create relevant university content for the department’s social media and engage with student followers.Demonstrate the following interpersonal skills: self-motivated, personable, outgoing, team-oriented, reliable, respectful, polite, professional, and have Cal Poly Pomona pride.Other duties as assigned by professional staff members. This is a long-term commitment which requires a proactive approach to learn about various campus resources and the Orientation reservation database. Desired Qualifications:Proficient with Microsoft Outlook, Word, Excel, TeamsCurate creative social media contentGreat communication skills and ability to work well in a teamRequired Qualifications:Must be a current CPP student, enrolled in at least 6.1 units in the academic yearMinimum cumulative GPA of 2.20Must be able to work 10-15 hours per week during the academic yearMust be able to work 35-40 hours per week June-August",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8992934?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Virtualness", "type": "Internet & Software" },
    "title": "Summer 2024 - Web Developer Intern",
    "dates": {
      "posted": "Posted 3 months ago",
      "apply_by": "Apply by September 29, 2024 at 5 PM"
    },
    "wage": " $18/hr",
    "location": "Hybrid, based in Las Vegas, Nevada, United States",
    "position": { "length": "Full-time", "type": "Internship" },
    "application_status": {
      "applied": true,
      "reason": "Position is a paid internship in web development, aligning with candidate's interest in software engineering and web/app development.",
      "date": "7/9/2024, 2:45:11 AM"
    },
    "details": "PLEASE READ BEFORE APPLYING StepUp& Start Internship Program Statement: We have been reviewed by the College of Engineering Internship Coordinator and have been approved for the StepUp and StartUp Program. Only students registered for the StepUp & StartUp Internship (SUSU IP) can apply for this position. If you have questions about your eligibility, please contact Alejandro Chacon, College of Engineering Internship Coordinator, at 702-895-1892 or Alejandro.chacon@unlv.edu.  To register for Data Analyst Intern Web DeveloperCreator Economy | AI | Digital Collectibles | Blockchain HybridTeam 35+ employees About Us: https://about.virtualness.io/ A well-funded, oversubscribed, seed stage AI & Blockchain focused startup is looking for the technical Interns. Company is founded by ex-Facebook and ex-Softbank leaders who have experience building multi-billion dollar businesses & launching products used by billions plus people across the globe. Company’s investors are a list of who's-who in the world of web3, creator economy and leading venture capitalists and entrepreneurs from Silicon Valley. Job Summary:Become part of our innovative team as a Frontend Web Engineer Intern and contribute to projects at the forefront of the creator economy, blockchain, AI, and fantasy sports industries. As a Frontend Web Engineer Intern, you will collaborate with our talented team to design, develop, and maintain engaging and user-friendly web interfaces that enhance the user experience. This internship offers an exciting opportunity to gain practical experience in frontend web development while making meaningful contributions to our company's success.Key Responsibilities:Frontend Development: Design and implement responsive and interactive web interfaces using frameworks such as React, or next.jsUser Interface Design: Work closely with designers to translate design mockups and wireframes into functional and visually appealing frontend components and layouts.Cross-Browser Compatibility: Ensure compatibility and consistent rendering of web interfaces across different browsers and devices.Performance Optimization: Optimize frontend code and assets for performance, including minimizing load times and maximizing rendering speed.Accessibility: Implement accessibility best practices to ensure web interfaces are accessible to users with disabilities and comply with relevant standards and guidelines.Integration: Integrate frontend interfaces with backend APIs and services to enable seamless data exchange and functionality.Testing and Debugging: Conduct testing of frontend interfaces, identify and resolve issues and bugs, and ensure the reliability and usability of web applications.Documentation: Create clear and comprehensive documentation for frontend code, components, and development processes to facilitate collaboration and knowledge sharing.Skills Required:Proficiency in HTML, CSS, and JavaScript: Strong understanding of web development fundamentals, including HTML5, CSS3, and modern JavaScript.Frontend Frameworks: Experience with frontend frameworks/libraries such as React.js, Next.js, and familiarity with state management tools.Responsive Design: Knowledge of responsive web design principles and techniques to create interfaces that adapt to various screen sizes and devices.Cross-Browser Compatibility: Understanding of cross-browser compatibility issues and techniques to address them.User Experience (UX) Design: Basic understanding of UX design principles and usability best practices to create intuitive and user-friendly interfaces.Problem-Solving Skills: Ability to analyze complex problems, debug issues, and develop effective solutions in a frontend web development context.Attention to Detail: Meticulous attention to detail to ensure pixel-perfect implementation of design mockups and wireframes.Communication Skills: Effective verbal and written communication skills to collaborate with team members and stakeholders, and document technical solutions and decisions.Preferred Qualifications:Previous experience with frontend web development, either through personal projects, coursework, or internships.Familiarity with version control systems such as Git for collaborative development.Knowledge of web performance optimization techniques and tools (e.g., Webpack, Lighthouse).Interest or experience in the creator economy, blockchain, AI, or fantasy sports industries. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8843443?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Eaton", "type": "Manufacturing" },
    "title": "Internship: Manufacturing Engineer - Santa Ana, CA (23633)",
    "dates": {
      "posted": "Posted 2 weeks ago",
      "apply_by": "Apply by July 17, 2024 at 3 AM"
    },
    "wage": " $19.38–31.73/hr",
    "location": "Onsite, based in Santa Ana, California, United States",
    "position": {
      "length": "Full-time∙From July 1 to October 1",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for Manufacturing Engineer, not aligned with desired roles",
      "date": ""
    },
    "details": "Eaton’s CPDI PDI division is currently seeking a Manufacturing Engineering Intern. The starting hourly rate for this position is $19.38- $31.73.Please note the salary information shown above is a general guideline only. Salaries are based upon candidate skills, experience, and qualifications, as well as market and business considerations.  What you’ll do:Eaton’s Electrical Sector is currently seeking a Manufacturing Engineer Intern to join our team. This position is based at our Santa Ana CA facility.Position Overview:The Manufacturing Engineer Intern will be responsible for one of manufacturing engineering projects dedicated to work instructions, and Standard Operating Procedure creation, in addition to other duties as assigned. The manufacturing engineering function is responsible for creating cycles of improvement throughout the organization by leading capital deployment, continuous improvement / cost-out projects, and other operations excellence initiatives.Making what matters work at Eaton takes the passion of every employee around the world. We create an environment where creativity, invention and discovery become reality, each and every day. It’s where bold, bright professionals like you can reach your full potential—and where you can help us reach ours.During your 11 week internship, you will:•    Create, update, and revise work instructions to capture manufacturing operation processes for training purposes•    Ensure processes conform to all applicable safety, quality, and statutory regulations.•    Work with engineering to ensure drawings are accurate to the work performed by operators•    Work with operations and engineering to create new documentation packages and deploy to the production floor.•    Create time studies for specific manufacturing processes.•    Work with Environment, Health, and Safety team on workstation assessment studies•    Other duties as assigned.When we embrace the different ideas, perspectives and backgrounds that make each of us unique, we — as individuals and as a company — are stronger. Qualifications:Required (Basic) Qualifications:•    Currently enrolled in an engineering discipline at an accredited education institutional institution (college or university)•    Minimum cumulative 2.8 GPA or higher•    Relocation is not provided for this role. Candidates must reside within the immediate geographic area to be considered•    Must be able to work in the United States without corporate sponsorship now and within the futurePreferred Qualifications:•    AutoCAD system experience and required working knowledge and experience with computers preferred•    Experience with MRP systems (SAP)•    Strong coaching and facilitation skills.•    Effective analytical and problem-solving skills.•    Proficiency with Microsoft Office Applications•    Experience with Microsoft Project Skills:Position Criteria:•    Knowledge of a wide variety of manufacturing processes including assembly and pull systems.•    Technical understanding and experience with Lean Manufacturing Systems and Six Sigma methodology.•    Ability to think strategically and see big picture in dynamic business environment •    Ability to work independently and in a team environment; to communicate articulately and professionally across many organizational levels and functions•    Highly motivated, works with a sense of urgency, driven to add value and deliver results  We are committed to ensuring equal employment opportunities for job applicants and employees. Our recruitment processes use balanced selection criteria and avoid unlawful discrimination against applicants on the basis of their age, colour, disability, marital status, national origin, gender, gender identity, genetic information, race or racial origin, religion, sexual orientation or any other status protected or required by law.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9054097?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Veterans Resource Center",
      "type": "Higher Education"
    },
    "title": "Horses for Heroes Program Assistant",
    "dates": {
      "posted": "Posted 1 week ago",
      "apply_by": "Apply by July 26, 2024 at 6 AM"
    },
    "wage": " $21/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙From August 12 to May 30",
      "type": "Job"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for Horses for Heroes Program Assistant, not related to software engineering, web/app development, data analytics/science, or machine learning",
      "date": ""
    },
    "details": "The W.K. Kellogg Arabian Horse Center and the Veterans Resource Center (VRC) will be hosting their Horses for Heroes program for the 2024-2025 academic year. Program Assistants will support program participants as they work with their assigned horses in providing them with special attention and care. This is a unique opportunity for Program Assistants to teach participants about horse behavior, husbandry, basic horse handling skills, and grooming. Responsibilities:Safely and enthusiastically assist participants in the care of animals.Teach participants basic horsemanship skills, such as haltering, leading, and groomingTeach participants basic equine safety.Must be able to recognize basic health and behavioral problems of horses, how to safely handle and care for the horses.Must maintain professional work conduct.Maintain a high standard of customer service.Communicate regularly and in a timely manner with the VRC and W.K. Kellogg Arabian Horse Center teams.Adhere to the rules and regulations of Cal Poly Pomona, the W.K. Kellogg Arabian Horse Center, and the Veterans Resource Center.Availability to work on weekends and evenings.Assists the with Horses for Heroes outreach events and activities. Assists the Veterans Resource Center with University events and activities.Participate in VRC department meetings and trainings.Support the VRC and W.K. Kellogg team in developing marketing for Horses for Heroes.Support the VRC with department day to day operations when needed.Knowledge, Skills, & Abilities:Must have and maintain good academic standing (minimum 2.0 GPA).Experience with horses is required. Previous Horse Center experience is a plus.Demonstrates safe and effective handling of horses.Ability to problem solve and make decisions.Ability to work in an outdoor environment with rain, extreme cold, or heat.Ability to lift minimum of 50 pounds.Ability to stand and walk on uneven surface for extended periods of time.Knowledge of basic horse behavior.Experience handling and working with horses.Ability to teach and thoroughly explain basic horse handling.Ability to react calmly and effectively in crisis situations.Ability to follow routine verbal and written instructions.Excellent interpersonal and communication skills.Familiarity with CPP’s military affiliated community.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9077555?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Virtualness", "type": "Internet & Software" },
    "title": "Summer 2024 - AI Engineer Intern",
    "dates": {
      "posted": "Posted 3 months ago",
      "apply_by": "Apply by September 29, 2024 at 5 PM"
    },
    "wage": " $18/hrVision coverage",
    "location": "Hybrid, based in Las Vegas, Nevada, United States",
    "position": { "length": "Full-time", "type": "Internship" },
    "application_status": {
      "applied": true,
      "reason": "AI engineering internship in Las Vegas is paid and aligns with software engineering and machine learning interests.",
      "date": "7/9/2024, 2:45:38 AM"
    },
    "details": "PLEASE READ BEFORE APPLYING StepUp& Start Internship Program Statement: We have been reviewed by the College of Engineering Internship Coordinator and have been approved for the StepUp and StartUp Program. Only students registered for the StepUp & StartUp Internship (SUSU IP) can apply for this position. If you have questions about your eligibility, please contact Alejandro Chacon, College of Engineering Internship Coordinator, at 702-895-1892 or Alejandro.chacon@unlv.edu. AI Engineer InternsCreator Economy | AI | Digital Collectibles | Blockchain HybridTeam 35+ employees About Us: https://about.virtualness.io/ A well-funded, oversubscribed, seed stage AI & Blockchain focused startup is looking for the technical Interns. Company is founded by ex-Facebook and ex-Softbank leaders who have experience building multi-billion dollar businesses & launching products used by billions plus people across the globe. Company’s investors are a list of who's-who in the world of web3, creator economy and leading venture capitalists and entrepreneurs from Silicon Valley. Job Summary:Join our dynamic team as an AI Engineer Intern and be part of cutting-edge projects at the intersection of the creator economy, blockchain, AI, and fantasy sports industries. As an AI Engineer Intern, you will collaborate with our experienced team to design, develop, and implement AI solutions that drive innovation and enhance user experiences. This internship offers a unique opportunity to gain hands-on experience in AI development while contributing to the advancement of our company's mission.Key Responsibilities:AI Model Development: Design, develop, and train machine learning models and algorithms to solve complex problems and address business needs.Data Preprocessing: Preprocess and prepare data for machine learning tasks, including data cleaning, feature engineering, and transformation.Model Evaluation: Evaluate the performance of machine learning models using appropriate metrics and techniques, and iterate on model improvements.Deployment: Deploy machine learning models into production environments, ensuring scalability, reliability, and efficiency.Integration: Integrate AI solutions with existing systems, applications, and platforms to enable seamless functionality and data exchange.Experimentation: Conduct experiments and exploratory analysis to identify opportunities for AI-driven innovation and improvement.Documentation: Create clear and comprehensive documentation for AI models, algorithms, and implementation processes.Collaboration: Collaborate with cross-functional teams, including data scientists, software engineers, and product managers, to deliver AI-driven solutions that meet business objectives.Skills Required:Machine Learning: Strong understanding of machine learning concepts, algorithms, and techniques, including supervised learning, unsupervised learning, and deep learning.Programming: Proficiency in programming languages commonly used in AI development, such as Python, and familiarity with libraries and frameworks like TensorFlow, PyTorch, or scikit-learn.Data Manipulation: Experience with data manipulation and analysis using tools like pandas, NumPy, or SQL.Model Deployment: Knowledge of deployment techniques and technologies for deploying machine learning models in production environments.Problem-Solving Skills: Ability to analyze complex problems, develop innovative solutions, and implement them using AI techniques.Communication Skills: Effective verbal and written communication skills to collaborate with team members, present findings, and explain technical concepts to non-technical stakeholders.Preferred Qualifications:Previous experience with AI development, either through personal projects, coursework, or internships.Familiarity with cloud platforms and services for AI development and deployment, such as AWS, or Google Cloud Platform.Knowledge of natural language processing (NLP), computer vision, or other specialized areas of AI.Interest or experience in the creator economy, blockchain, or fantasy sports industries.",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8843439?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Virtualness", "type": "Internet & Software" },
    "title": "Summer 2024 - Backend Engineer Intern",
    "dates": {
      "posted": "Posted 3 months ago",
      "apply_by": "Apply by September 29, 2024 at 5 PM"
    },
    "wage": " $18/hr",
    "location": "Hybrid, based in Las Vegas, Nevada, United States",
    "position": { "length": "Full-time", "type": "Internship" },
    "application_status": {
      "applied": true,
      "reason": "Position meets the criteria of being a paid internship and is within the preferred locations",
      "date": "7/9/2024, 2:45:32 AM"
    },
    "details": "PLEASE READ BEFORE APPLYING StepUp& Start Internship Program Statement: We have been reviewed by the College of Engineering Internship Coordinator and have been approved for the StepUp and StartUp Program. Only students who have been registered for the StepUp & StartUp Internship (SUSU IP) can apply for this position. If you have questions about your eligibility, please contact Alejandro Chacon, College of Engineering Internship Coordinator, at 702-895-1892 or Alejandro.chacon@unlv.edu. To regData Analyst Intern Backend EngineerCreator Economy | AI | Digital Collectibles | Blockchain HybridTeam 35+ employees About Us: https://about.virtualness.io/ A well-funded, oversubscribed, seed stage AI & Blockchain focused startup is looking for the technical Interns. Company is founded by ex-Facebook and ex-Softbank leaders who have experience building multi-billion dollar businesses & launching products used by billions plus people across the globe. Company’s investors are a list of who's-who in the world of web3, creator economy and leading venture capitalists and entrepreneurs from Silicon Valley. Job Summary:Join our team as a Backend Python Engineer Intern and be part of an exciting journey at the intersection of the creator economy, blockchain, AI, and fantasy sports industries. As a Backend Python Engineer Intern, you will collaborate with our skilled team to design, develop, and maintain robust and scalable backend systems that power our innovative projects. This internship offers a unique opportunity to gain hands-on experience in backend development while contributing to the growth and success of our company.Key Responsibilities:Backend Development: Design, develop, and maintain backend systems and APIs using Python and related frameworks such as Django or Flask.Database Management: Implement and optimize database schemas, queries, and transactions for efficient data storage and retrieval using SQL or NoSQL databases.API Integration: Integrate backend systems with external APIs, services, and third-party platforms to enable seamless functionality and data exchange.Scalability and Performance: Architect scalable and high-performance backend solutions to accommodate growing user bases and increasing data volumes.Security: Implement security best practices and protocols to ensure the integrity, confidentiality, and availability of data and backend systems.Testing and Debugging: Conduct thorough testing of backend systems, identify and resolve bugs and performance bottlenecks, and ensure reliability and stability.Documentation: Create clear and concise documentation for backend code, APIs, and systems architecture to facilitate collaboration and knowledge sharing.Skills Required:Proficiency in Python: Strong programming skills in Python, with experience in developing backend applications and services.Backend Frameworks: Familiarity with backend frameworks such as Django or Flask, and experience in building RESTful APIs.Database Management: Knowledge of SQL and/or NoSQL databases, and experience in designing database schemas and optimizing database queries.API Development: Understanding of API design principles and experience in building and consuming APIs for data exchange and integration.Problem-Solving Skills: Ability to analyze complex problems, debug issues, and develop effective solutions using Python and related technologies.Attention to Detail: Meticulous attention to detail to ensure the reliability, security, and performance of backend systems and code.Communication Skills: Effective verbal and written communication skills to collaborate with team members and stakeholders, and document technical solutions and decisions.Preferred Qualifications:Previous experience with backend development, either through personal projects, coursework, or internships.Familiarity with cloud platforms such as AWS, or Google Cloud Platform.Knowledge of containerization and orchestration technologies such as Docker and Kubernetes.Interest or experience in the creator economy, blockchain, AI, or fantasy sports industries. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8843444?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Associated Students Inc.,",
      "type": "Higher Education"
    },
    "title": "Children's Center Operations Assistant",
    "dates": {
      "posted": "Posted 2 weeks ago",
      "apply_by": "Apply by September 1, 2024 at 6 AM"
    },
    "wage": " $16.28/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time∙20 hours a week",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for Children's Center Operations Assistant, not related to software engineering, web/app development, data analytics, machine learning, and not remote",
      "date": ""
    },
    "details": "Work Schedule: 15-20 hours per week; shifts based on operational need of the organization OVERVIEWAssociated Students, Inc. employs student-focused professionals with equity-mindsets. Established in 1963, ASI is a non-profit corporation guided by a student board and managed by full-time professional staff. ASI is considered a part of the Cal Poly Pomona Division of Student Affairs with a dashed reporting line to Administrative Affairs. ASI serves the entire campus population, including over 27,000 students, by providing opportunities for student engagement, student employment, and a multitude of programs and services such as recreation and wellness, student union and activities, student government, and childcare. ASI operational support areas include human resources, financial services, information technology, facilities management, and marketing.  ASI is engaged in the work of being a learning organization. Currently, the guiding ideas of the organization are “under construction” as the team re-imagines its vision, mission, and core values. ASI is looking for dynamic team members who value team learning, co-creation, and adaptability to best serve the needs of our students.The Cal Poly Pomona Children’s Center is a high-quality preschool program that is operated jointly through a partnership between the Associated Students Inc. (ASI) and Cal Poly Pomona. The Children’s Center opened in 1974 to help support student parents achieve their educational goals while attending Cal Poly Pomona. The Children’s Center places a high value on intentional and respectful relationships among staff, our families, and the children. Our full-time and part-time staff are an integral part of our program as they perform a variety of tasks related to maintaining the children’s Learning Environments, providing active supervision of the children, and providing professional office support so that the needs of families and CPP students providing services at the center are met.POSITION DEFINITIONUnder the general supervision of the Children’s Center Director and direct supervision Children’s Center Supervisor, the Children’s Center Operations Assist provides general support for the day-to-day operations of the Children’s Center. This position provides management support for food and supplies as well as provides hands-on assistance in many facets of the Children’s Center.ESSENTIAL DUTIES Provides food service for children following proper food handling protocolsMonitors food inventory and places food orders as needed to meet the needs of the children servedDevelops and implements appropriate food menu for the children served at the centerSupports classrooms, outdoor learning environments, and program site(s), as needed to maintain a safe, clean, and well-prepared environment to serve and safeguard children Maintains kitchen and play areas in a safe and clean conditionRemoves items that may be a possible hazard to a childFollows program policies and procedures and any regulatory mandatesPerform other related duties as assignedQUALIFICATIONSCertification in Pediatric CPR/AED and First Aid within 30 days of employment (provided by ASI)No experience with food handling required, however, must have the ability to obtain a California Food Handler’s permit within the first 10 days of employment (provided by ASI)Demonstrated ability to provide friendly customer-oriented service Ability to perform accurate, detailed work Ability to work effectively in a team environmentAbility to perceive children’s needs and develop positive relationshipsAbility to communicate sensitive information with tact and considerationAbility to adapt willingly to frequent changes in activity, priorities, and/or work schedules.Ability to follow written and verbal instructionsAbility to anticipate and diffuse problems and disruptive situationsAbility to satisfactorily complete a background check (including a criminal records check)POSITION SENSITIVITYBased on the duties and responsibilities of this position, this position has been designated to be a sensitive position with access to sensitive dataBACKGROUND CHECKA background check (including a criminal records check) must be completed satisfactorily before any candidate can begin employment with Associated Students, Inc., Cal Poly Pomona. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current ASI employees who apply for this position.EMPLOYMENT ELIGIBILITY Employment with ASI is open to any Cal Poly Pomona student who is at least 16 years old and of legal status to work in the United States. In addition, the employee must be currently enrolled for at least 6.0 units (undergraduate) and 4.0 units (graduate), international student employees must be enrolled in a minimum of 12.0 units (undergraduate) and 6.0 units (graduate) at the end of the drop-add period, have a minimum 2.0 GPA (both Cal Poly Pomona and overall GPA) and be in good standing with the University. Individuals enrolled only in Extended University are not eligible for hire. Exceptions to the unit load requirement are allowed during the summer and winter semesters and for students who have applied for graduation for the current semester. WORK ENVIRONMENTWhile performing the duties of this job, the employee is frequently required to sit, talk, and hear; manual dexterity, eye-hand coordination, and verbal communication; use of office equipment: telephones, calculator, copier, and fax. Must be able to walk, stand, bend, and lift up to 45 pounds.Position subject to an occupational exposure to bloodborne pathogens. Annual bloodborne pathogen training is required. The initial training must be completed before the employee is assigned duties that may result in exposure to blood or bodily fluids. Hepatitis B vaccination will be offered after the training.MANDATED REPORTING REQUIREMENT In compliance with the California Child Abuse and Neglect Reporting Act (CANRA) and the CSU Executive Order 1083, each ASI employee is designated as a mandated reporter and is required to sign an Acknowledgment of Mandated Reporter Status and Legal Duty to Report Child Abuse and Neglect.  SYSTEMWIDE SMOKE AND TOBACCO FREE ENVIRONMENT EO 1108:  Cal Poly Pomona is a smoke and tobacco-free campus. Please refer to the link below for policy information. http://www.calstate.edu/EO/EO-1108.html  COVID-19 VACCINATION  CSU, along with Associated Students Inc., strongly recommends all staff who are physically accessing campus facilities or programs to be fully vaccinated against COVID-19, which includes obtaining a COVID-19 booster dose. See policy at https://calstate.policystat.com/policy/11030468/latest.  ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9064122?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Costa Mesa Sanitary District",
      "type": "Government - Local, State & Federal"
    },
    "title": "Intern (Part-time)",
    "dates": {
      "posted": "Posted 1 week ago",
      "apply_by": "Apply by July 30, 2024 at 4 PM"
    },
    "wage": " $19.86–26.81/hr",
    "location": "Onsite, based in 290 Paularino Avenue, Costa Mesa, California 92626, United States",
    "position": { "length": "Part-time", "type": "Internship" },
    "application_status": {
      "applied": false,
      "reason": "Position is onsite in Costa Mesa, not near Fontana or Pomona and wage is $19.86–26.81/hr, but not specified if paid.",
      "date": ""
    },
    "details": "DEFINITIONUnder direct supervision, assists, participates in, and performs various administrative and basic analytical duties for various District departments; prepares and maintains a variety of documents; and performs a variety of administrative and clerical duties relative to assigned area of responsibility.SUPERVISION RECEIVED AND EXERCISEDReceives direct supervision from assigned supervisory or management personnel. Exercises no direct supervision of staff.CLASS CHARACTERISTICSThe Intern is a temporary, part-time, non-benefited position. The incumbent works under close supervision of assigned supervisory or management personnel. The objective of the internship program is to provide a meaningful training ground for individuals to gain work experience and to increase their ability to compete in the workforce in entry-level positions.  Examples of Typical Job Functions:Performs administrative and basic analytical duties for various District departments including assisting professional staff as needed.Participates in routine projects and research in a variety of areas.Researches and evaluates data and presents facts, conclusions, and recommendations clearly and concisely to department staff, other District departments and agencies, and to the general public.Participates in the development and/or revisions of manuals, policies, and procedures.Conducts and participates in a variety of department studies and special projects including operational and procedural studies, service demand studies, and capacity studies.Compiles statistical data; provides recommendations regarding operational and service improvements; conducts quality control for imaged documents.Utilizes various computer applications and software packages; enters data; creates and updates databases and spreadsheets; maintains and generates reports from a database or network system.Responds to requests for information from outside agencies and organizations including surveys.  Operates a variety of office equipment including copiers, scanners, facsimile machines, and computers.Performs other duties as assigned.   Qualifications:Knowledge of:Principles, practices, and methods of administrative and organizational analysis.Effective business communications.Research techniques, methods, and procedures and report presentation.Basic principles and practices of report preparation.Modern office practices, methods, and computer equipment and applications related to the work, including word processing, database, and spreadsheet software.Basic mathematics.English usage, spelling, vocabulary, grammar, and punctuation.Ability to:Provide responsible administrative and basic analytical support to assigned area.Learn operations, services, and activities within the area of assignment.Participate in various administrative support functions.Formulate hypotheses and develop conclusions and prepare reports.Utilize good judgment in analyzing situations carefully and adopting effective courses of action.Gather, organize, compile, and summarize data.Read and interpret data, information, documents, policies, and procedures.Make accurate mathematical calculations.Learn and apply new information or skills.Work under deadlines with constant interruptions.Operate modern office equipment including computer equipment and specialized software applications programs.Maintain accurate logs, records, and basic written records of work performed.Understand and follow oral and written instructions.Communicate effectively, both orally and in writinEstablish, maintain, and foster positive and effective working relationships with those contacted in the course of work.Education and ExperienceAny combination of training and experience that would provide the required knowledge, skills, and abilities is qualifying. A typical way to obtain the required qualifications would be:Course work in progress leading to an undergraduate or graduate degree. One year of research, administrative support or analytical experience is desirable.Licenses and Certifications:Valid Class C California driver’s license and satisfactory driving record.  Supplemental Information:PHYSICAL DEMANDSMust possess the ability to operate a motor vehicle and visit various sites within the District’s jurisdiction. The position involves occasional fieldwork requiring walking in operational areas to inspect trash cart, take notes and identify problems. Must possess mobility to work in a standard office setting and use standard office equipment, including a computer; vision to read printed materials and a computer screen; and hearing and speech to communicate in person and over the telephone. This is primarily a sedentary office classification although standing and walking between work areas may be required.   Finger dexterity is needed to access, enter, and retrieve data using a computer keyboard, typewriter keyboard, or calculator and to operate standard office equipment.  Positions in this classification occasionally bend, stoop, kneel, reach, push, and pull drawers open and closed to retrieve and file information.  Employees must possess the ability to lift, carry, push, and pull materials and objects up to 25 pounds.ENVIRONMENTAL ELEMENTSEmployees mostly work in an office environment with moderate noise levels, controlled temperature conditions, and no direct exposure to hazardous physical substances. This position involves occasional fieldwork which may include driving and walking in cold and hot temperatures. Employees may interact with upset staff and/or public and private representatives in interpreting and enforcing District policies and procedures. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9071308?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Associated Students Inc.,",
      "type": "Higher Education"
    },
    "title": "Recreation Technician \"Student Position\"",
    "dates": {
      "posted": "Posted 1 week ago",
      "apply_by": "Apply by January 1, 2025 at 6 AM"
    },
    "wage": " $17.33/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is for a Recreation Technician, not for software engineering, web/app development, data analytics/science, or machine learning roles.",
      "date": ""
    },
    "details": "Work Schedule: 15-20 hours per week; work hours include early mornings, late nights and weekends; shifts based on operational need of the organization. This position will be working on campus. OVERVIEWAssociated Students, Inc. employs student-focused professionals with equity-mindsets. Established in 1963, Associated Students, Inc. (ASI) is a non-profit corporation guided by a student board and managed by full-time professional staff. ASI is a part of the Cal Poly Pomona Division of Student Affairs with a dashed reporting line to Administrative Affairs. ASI serves the entire campus population, including over 26,000 students, by providing opportunities for student engagement, student employment, and a multitude of programs and services such as recreation and wellness, student union and activities, student government, and childcare. ASI operational support areas include human resources, financial services, information technology, facilities management, and marketing. ASI employees exhibit our values of integrity, honor, dedication, loyalty, and respect in every interaction with each other, our students, the campus community, and guests of Cal Poly Pomona.The ASI Facility Operations department is one of the largest departments in ASI. The department consists of four units, BRIC Operations, BSC Operations, Custodial Services and Maintenance, that are responsible for the maintenance, cleanliness, day to day operations, safety and emergency management of the BRIC and the BSC. The Facility Operations department strives to transform our facilities to a welcoming home for all and is committed to providing exceptional customer service experiences that lead to a sense of belonging in all ASI facilities. Recreation Maintenance is responsible for the daily maintenance and upkeep of the Bronco Recreation and Intramural Complex by providing services to keep the buildings safe and operational for students, staff and community. Services include: Maintaining Pool Chemistry and pool systems. Perform maintenance on Fitness Equipment, Conduct routine checks on building facilities using the work order system. Develop and update Standard Operating Procedures. Maintain accurate documentation of maintenance activities. Assist in inventory management of parts & items.POSITION DEFINITIONUnder general supervision from the Associate Director of Facility Operations, the Recreation Technician is responsible for fitness, pool, recreation, and technical equipment operations. The Recreation Technician performs routine and non-routine complex assignments requiring specialized knowledge, prior relevant experience, and considerable independent judgment and decision-making.  ESSENTIAL DUTIES Maintains fitness equipment functionality and operationAssists with recreation equipment maintenance to include, but not limited to, repairing/replacing all sporting nets, maintaining equipment holders, storage devices, and divider curtainsAssists with basic fitness equipment maintenance to include, but not limited to, preventative care and small repairs for cardio, selectorized, and strength equipmentAssists with basic pool maintenance to include, but not limited to, pool vacuuming, conducting/monitoring daily equipment and pool chemistry checks, and basic troubleshootingAssist with technical equipment maintenance to include, but not limited to, lockers, key management system, and minor fixture repairs (emergency exit door batteries, water faucet batteries etc), facility turnstiles and large appliances (washer, dryer, dishwasher etc.)Assists with facilitating the BRIC’s day-to-day operationsAssists with implementation of equipment preventative maintenance and operational strategiesAdheres to all organizational, local, state, and national industry standard operating procedures and safety protocolsEnforces rules and regulations regarding BRIC useAlways presents a professional appearance and attitude; maintains a high standard of customer serviceReports basic facility maintenance and custodial needsCompletes appropriate activity logs and reportsAttend meetings, trainings and workshops as requiredPerforms other related duties as assignedQUALIFICATIONSAmerican Red Cross CPR/AED for the Professional Rescuer and Administering Emergency Oxygen Certifications (Employment offer contingent on obtaining certification within 30 days of hire, training provided by ASI)National Swimming Pool Foundation Pool Operator Certification, required (Employment offer contingent on obtaining certification within 30 days of hire, training provided by ASI)Experience working with fitness equipment maintenance and repair preferredExperience working with equipment preferably within a sports, fitness, recreation or university programming environmentAbility to follow routine verbal and written instructionsAbility to effectively communicate clearly and concisely, both verbally and in writingAbility to maintain professional work conductAbility to make independent decisions and make recommendationsAbility to adhere to work rules, follow directions, use time effectively and work productively without close supervisionDemonstrated ability to work with a diverse student population and campus communityAbility to operate a computer workstation using word processing, spreadsheet and other computer applications in useAbility to satisfactorily complete a background check (including a criminal records check)Must be able to pass an initial and annual fit test and Pulmonary Function Test for a respirator mask based on OSHA laws and compliance standards (facial hair must not interfere with seal of mask) and complete initial and annual respirator trainingPOSITION SENSITIVITY Based on the duties and responsibilities of this position, this position has been designated to be a sensitive position with access to sensitive data.  BACKGROUND CHECK A background check (including a criminal records check) must be completed satisfactorily before any candidate can begin employment with Associated Students, Inc., Cal Poly Pomona. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current ASI employees who apply for this position.EMPLOYMENT ELIGIBILITY Employment with ASI is open to any Cal Poly Pomona student who is at least 16 years old and of legal status to work in the United States. In addition, the employee must be currently enrolled for at least 6.0 units (undergraduate) and 4.0 units (graduate), international student employees must be enrolled in a minimum of 12.0 units (undergraduate) and 6.0 units (graduate) at the end of the drop-add period, have a minimum 2.0 GPA (both Cal Poly Pomona and overall GPA) and be in good standing with the University. Individuals enrolled only in Extended University are not eligible for hire. Exceptions to the unit load requirement are allowed during the summer and winter semesters and for students who have applied for graduation for the current semester.    WORK ENVIRONMENTWhile performing the duties of this job, the employee is frequently required to sit, talk and hear; manual dexterity, eye-hand coordination, and verbal communication; use of office equipment: telephones, calculator, copier and fax. Must be able to walk, stand, bend, and lift to 45 pounds.Position subject to an occupational exposure to bloodborne pathogens. Annual bloodborne pathogen training is required. The initial training must be completed before the employee is assigned duties that may result in exposure to blood or bodily fluids. Hepatitis B vaccination will be offered after the training.MANDATED REPORTING REQUIREMENT In compliance with the California Child Abuse and Neglect Reporting Act (CANRA) and the CSU Executive Order 1083, each ASI employee is designated as a mandated reporter and is required to sign an Acknowledgment of Mandated Reporter Status and Legal Duty to Report Child Abuse and Neglect. SYSTEMWIDE SMOKE AND TOBACCO FREE ENVIRONMENT EO 1108:  Cal Poly Pomona is a smoke and tobacco-free campus. Please refer to the link below for policy information. http://www.calstate.edu/EO/EO-1108.html COVID-19 VACCINATIONCSU, along with Associated Students Inc., strongly recommends all staff who are physically accessing campus facilities or programs to be fully vaccinated against COVID-19, which includes obtaining a COVID-19 booster dose. See policy at https://calstate.policystat.com/policy/11030468/latest. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9084261?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Westlake Financial Services",
      "type": "Financial Services"
    },
    "title": "IT DevOps Internship",
    "dates": {
      "posted": "Posted 1 month ago",
      "apply_by": "Apply by November 9, 2024 at 6 AM"
    },
    "wage": " $16.78–20/hr",
    "location": "Onsite, based in 4751 Wilshire Boulevard, Los Angeles, California 90010, United States",
    "position": {
      "length": "Full-time∙From May 20 to July 18",
      "type": "Internship"
    },
    "application_status": {
      "applied": false,
      "reason": "Position is onsite in Los Angeles, not near Fontana or Pomona, and may not align with preferred fields (software engineering, web/app developer, data analytics/science, machine learning)",
      "date": ""
    },
    "details": "IT DevOps InternshipLos Angeles, CA Corporate Office | On-site role* PLEASE READ THE REQUIREMENTS below to avoid disqualification. Applicants must be authorized to work for ANY employer in the U.S. We are UNABLE to sponsor or take over sponsorship of an employment Visa now or in the forseeable future. Westlake Financial Services Inc. operates as an internet-based finance company. The Company specializes in the acquisition of servicing of prime to sub-prime automotive retail installment contracts. Westlake Financial Services serves customers in the United States. Job Description:We are seeking a motivated and talented IT DevOps intern to join our team and gain hands-on experience in automating and streamlining our software development and operations processes. This internship will provide an excellent opportunity to work with cutting-edge technologies, collaborate with cross-functional teams, and contribute to the success of our IT operations. Key Responsibilities:Work closely with the Systems and Devops teams to support and improve our continuous integration/continuous delivery (CI/CD) pipelines.Assist in developing and maintaining automation scripts and tools for provisioning, configuration, deployment, and monitoring of infrastructure and applications.Participate in the implementation and management of containerization technologies such as Docker and container orchestration platforms like Kubernetes.Contribute to the design and implementation of infrastructure as code (IaC) using tools like Terraform or Ansible.Assist in monitoring and troubleshooting production systems to ensure high availability, reliability, and performance.Collaborate with software development teams to optimize build processes, improve code quality, and facilitate rapid delivery of features and updates.Learn and apply best practices for DevOps methodologies, including agile development, version control, and collaboration tools. Requirements:Graduating student or fresh graduate of Bachelor's or Master's degree program in Computer Science, Information Technology, or a related fieldStrong interest in DevOps practices, automation, and cloudBasic understanding of software development concepts, version control systems (e.g., Git), and agile methodologies.Familiarity with scripting languages such as Python, Bash, orKnowledge of Linux/Unix and Windows operatingExcellent problem-solving skills and attention toStrong communication and interpersonalAbility to work independently and in a teamEagerness to learn new technologies andAble to work on-site in our Los Angeles Office Advantages:Hands-on experience in a dynamic and collaborative DevOpsExposure to industry-leading technologies and tools used in software development andMentorship and guidance from experienced DevOpsNetworking opportunities with cross-functional teams and industryPotential for future career advancement and full-time employment What’s our pay rate?$16.78 - $20 per hour",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8964248?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": {
      "name": "Cal Poly Pomona - Associated Students Inc.,",
      "type": "Higher Education"
    },
    "title": "BRIC Operations Attendant",
    "dates": {
      "posted": "Posted 2 months ago",
      "apply_by": "Apply by October 25, 2024 at 6 AM"
    },
    "wage": " $16–17.50/hr",
    "location": "Onsite, based in Pomona, California, United States",
    "position": {
      "length": "Part-time",
      "type": "On Campus Student Employment"
    },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:45:45 AM"
    },
    "details": "Work Schedule: 12-20 hours per week (hire is contingent upon availability of 12-20 hours per week); work hours include early mornings (5AM), late nights (1AM) and weekends; shifts based on operational need of the organization. This position will be working on campus. Summer, Fall and Spring semester hours. OVERVIEWAssociated Students, Inc. employs student-focused professionals with equity-mindsets. Established in 1963, ASI is a non-profit corporation guided by a student board and managed by full-time professional staff.  ASI is considered a part of the Cal Poly Pomona Division of Student Affairs with a dashed reporting line to Administrative Affairs. ASI serves the entire campus population, including over 27,000 students, by providing opportunities for student engagement, student employment, and a multitude of programs and services such as recreation and wellness, student union and activities, student government, and childcare. ASI operational support areas include human resources, financial services, information technology, facilities management, and marketing.  ASI is engaged in the work of being a learning organization. Currently, the guiding ideas of the organization are “under construction” as the team re-imagines its vision, mission, and core values. ASI is looking for dynamic team members who value team learning, co-creation, and adaptability to best serve the needs of our students.The ASI Facility Operations department is one of the largest departments in ASI. The department consists of four units, BRIC Operations, BSC Operations, Custodial Services and Maintenance, that are responsible for the maintenance, cleanliness, day to day operations, safety and emergency management of the BRIC and the BSC. The Facility Operations department strives to transform our facilities to a welcoming home for all and is committed to providing exceptional customer service experiences that lead to a sense of belonging in all ASI facilities.The Bronco Recreation and Intramural Complex (BRIC) Operations team is one of the largest units that operate in the BRIC. Operations consist of two service areas that oversee building and member safety and providing outstanding customer service to our members and guests. Operation’s primary function is to keep the building open and operational but also plays a significant role in enhancing the facility through purchasing new equipment for members to use as well as improving the overall functionality of the building. Operations provides an excellent opportunity to be a part of a large community of fellow student employees as well as develop a strong network through day-to-day interactions with colleagues and members.    POSITION DEFINITIONUnder general supervision from the BRIC Operations Manager, the Operations Attendant provides frontline services in support of daily operations in the Bronco Recreation and Intramural Complex (BRIC) and acts as the shift lead. Must be available to attend all mandatory department wide and position specific trainings.    ESSENTIAL DUTIES Assists with facilitating the BRIC’s day-to-day operations Assists with implementation of operational strategies Enforces rules and regulations regarding BRIC use Maintains fitness equipment functionality, cleanliness, and operation Provides emergency care and treatment as required in a calm and effective manner  Presents a professional appearance and attitude at all times and maintains a high standard of customer service Assist with front desk functions  Assists with and reports basic facility maintenance and custodial needs  Completes appropriate activity reports  Performs other related duties as assigned    QUALIFICATIONSCurrent American Red Cross First Aid, Emergency Oxygen, and CPR/AED for the Professional Rescuer certifications (Employment offer contingent on obtaining CPR/AED certification within 30 days of hire)Experience working in a sports, fitness, recreation, or similar environment, preferred Ability to react calmly and effectively in emergency situations Ability to follow routine verbal and written instructions Ability to effectively communicate clearly and concisely, both verbally and in writing Ability to maintain professional work conduct Ability to make independent decisions and make recommendations Ability to adhere to work rules, follow directions, use time effectively and work productively without close supervision Demonstrated ability to work with a diverse student population and campus community Ability to operate a computer workstation using word processing, spreadsheet and other computer applications in use Ability to successfully pass a background screening as an offer of employment is contingent on background clearance  POSITION SENSITIVITY Based on the duties and responsibilities of this position, this position has been designated to be a sensitive position with access to sensitive data.   BACKGROUND CHECK A background check (including a criminal records check) must be completed satisfactorily before any candidate can begin employment with Associated Students, Inc., Cal Poly Pomona. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current ASI employees who apply for this position. EMPLOYMENT ELIGIBILITY Employment with ASI is open to any Cal Poly Pomona student who is at least 16 years old and of legal status to work in the United States. In addition, the employee must be currently enrolled for at least 6.0 units (undergraduate) and 4.0 units (graduate), international student employees must be enrolled in a minimum of 12.0 units (undergraduate) and 6.0 units (graduate) at the end of the drop-add period, have a minimum 2.0 GPA (both Cal Poly Pomona and overall GPA) and be in good standing with the University. Individuals enrolled only in Extended University are not eligible for hire. Exceptions to the unit load requirement are allowed during the summer and winter semesters and for students who have applied for graduation for the current semester.     WORK ENVIRONMENTWhile performing the duties of this job, the employee is frequently required to sit, talk and hear; manual dexterity, eye-hand coordination, and verbal communication; use of office equipment: telephones, calculator, copier and fax. Must be able to walk, stand, bend and lift to 45 pounds.Position subject to an occupational exposure to bloodborne pathogens. Annual bloodborne pathogen training is required. The initial training must be completed before the employee is assigned duties that may result in exposure to blood or bodily fluids. Hepatitis B vaccination will be offered after the training. MANDATED REPORTING REQUIREMENT In compliance with the California Child Abuse and Neglect Reporting Act (CANRA) and the CSU Executive Order 1083, each ASI employee is designated as a mandated reporter and is required to sign an Acknowledgment of Mandated Reporter Status and Legal Duty to Report Child Abuse and Neglect.  SYSTEMWIDE SMOKE AND TOBACCO FREE ENVIRONMENT EO 1108:  Cal Poly Pomona is a smoke and tobacco-free campus. Please refer to the link below for policy information.  http://www.calstate.edu/EO/EO-1108.html  COVID-19 VACCINATIONCSU, along with Associated Students Inc., strongly recommends all staff who are physically accessing campus facilities or programs to be fully vaccinated against COVID-19, which includes obtaining a COVID-19 booster dose. See policy at https://calstate.policystat.com/policy/11030468/latest. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8924321?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "APEX Imaging Services", "type": "Construction" },
    "title": "Software Developer",
    "dates": { "posted": "Posted 1 week ago", "apply_by": "Applied" },
    "wage": " $100–125/hrMedical, dental, and vision coverage plus paid time off",
    "location": "Onsite, based in Pomona, California, United States",
    "position": { "length": "Full-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Must Apply Externally",
      "date": "7/9/2024, 2:45:45 AM"
    },
    "details": "Job Description:Apex is a National GC-Management-Tech firm that services the retail, restaurant and petroleum industries as a high-volume multi-site solution provider in providing a customized tracking software to use both internally and externally with existing and potential clients. Corporately based in Pomona, CA we are seeking a candidate to join our team of for a gratifying full-time position developing a proprietary software of ours called ApexView. Job Overview:As one of our Software Developers, you will work on developing our Quickbase application day in and day out, creating custom dashboards, algorithms, and features to appease both our office staff and clients. Applicants must have a thorough knowledge in workflow management and how to develop in workflow forms. Responsibilities will include:Develop, test and implement new software programsClearly and regularly communicate with management and technical support colleaguesDesign and update software database. This includes, but is not limited to: Software Applications, Web Sites, Data Communication Processes and User InterfacesTest, maintain and recommend software improvements to ensure strong functionality and optimizationIndependently install, customize and integrate commercial software packagesFacilitate root cause analysis of system issuesWork with experienced team members to conduct root cause analysis of issues, review new and existing code and/or perform unit testingIdentify ideas to improve system performance and impact availabilityResolve complex technical design issuesDevelopment of technical specifications and plansAnalyze user requirements and convert requirements to design documentsMake good technical decisions that provide solutions to business challengesProvide comprehensive support to internal customers; achieve resolution to outstanding problems or issuesCompile timely, comprehensive and accurate documentation and or reports as requestedPossess up-to-date knowledge of technological developments in the industryCommunicate effectively and professionally in all forms of communication with internal and external customersPossess strong problem solving and decision-making skills while using good judgmentMulti-task and change from one task to another without loss of efficiency or composureMUST HAVE Qualifications and Skills: JavaScriptHTML5CSSPythonNodeJsExperience – Software Developing ExperienceProficiency in Microsoft Office (Word, Excel, Outlook) and other common portals.Effective, professional written and verbal communication skills (English)Ability to work well with others - Architects, Project Managers and Consults and clients.Ability to address multiple open projects simultaneouslyAbility to prioritize tasks and to meet deadlinesAbility to be organized and to give proper attention to detailSelf-starter who can take direction and redirection wellSomeone willing to work to build a business process and stream.Valid CA ID or Driver’s LicenseDesired Qualifications and Skills: ReactJSJinjaGoogle Cloud ConsoleStrong desire to grow and excelCommitment to timelinessAnalysisGeneral Programming SkillsSoftware DesignSoftware DebuggingSoftware DocumentationSoftware TestingProblem SolvingTeamworkSoftware Development FundamentalsSoftware Development Process",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9082499?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Lamini AI", "type": "Internet & Software" },
    "title": "Machine Learning Engineering Intern",
    "dates": {
      "posted": "Posted 2 months ago",
      "apply_by": "Apply by November 1, 2024 at 6 AM"
    },
    "wage": " $25–50/hr",
    "location": "Onsite, based in Menlo Park, California, United States",
    "position": { "length": "Full-time", "type": "Internship" },
    "application_status": {
      "applied": true,
      "reason": "Paid machine learning engineering internship based in California.",
      "date": "7/9/2024, 2:46:02 AM"
    },
    "details": "Lamini enables every enterprise to safely, quickly, and cost-effectively build their own Expert AI. Our customers own their own models, trained on their data. Lamini optimizes for Expert AI workloads with minimal hallucination, enterprise-grade security, and enterprise flexibility, running on any infrastructure. Our team is made up of highly committed engineers, researchers, and tech industry veterans excited by mission and technology. We’re backed by leading VCs as well as computing and technology companies.We're looking for a passionate ML Engineering intern to help us push the boundaries of what's possible with large language models (LLM). You'll work closely with our ML team. This is an “intern-to-full-time” position with possible conversion into full time employment.Key responsibilities include:Develop Natural Language Processing techniques like retrieval-augmentation, factual corrections, and model calibration to improve model accuracy and reduce hallucinations.Build tools and evaluation frameworks to objectively measure model performance, quality and risk. Areas like bias detection, toxicity analysis etc.Contribute to our model training pipeline by researching and implementing novel optimization techniques like self-supervised learning and multi-task training.Stay on top of the latest advances in representation learning and propose new architectural variants to maximize our models' usefulness while maintaining safety.Publish code, papers and tutorials to disseminate your work and help fellow researchers.You'll be working at the forefront of ML, with top engineers. Expect to learn cutting-edge techniques and apply them to real-world problems at an ambitious startup.Requirements:Background in ML/NLP with strong Python skillsDeep learning experience with frameworks like TensorFlow/PyTorchPassion for AI safety, ethics and oversightResearch mindset to continuously push boundariesAbility to clearly communicate technical workEnrolled in a relevant Master's/PhD programThis is a 2-4+ month full-time paid internship. Please apply with a resume, projects, publications, and cover letter.At Lamini AI, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law. Lamini AI believes that diversity and inclusion among our employees is critical to our success as a company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool. Selection for employment is decided on the basis of qualifications, merit, and business need.  ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/8941966?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  {
    "employer": { "name": "Rubber-Cal", "type": "Other Industries" },
    "title": "New Product Development Lead",
    "dates": {
      "posted": "Posted 2 weeks ago",
      "apply_by": "Apply by December 19, 2024 at 6 AM"
    },
    "wage": " $25–30/hrMedical, dental, and vision coverage plus paid time off",
    "location": "Onsite, based in 18424 Mount Langley Street, Fountain Valley, California 92708, United States",
    "position": { "length": "Full-time", "type": "Job" },
    "application_status": {
      "applied": false,
      "reason": "Position is for New Product Development Lead role at Rubber-Cal, not in the desired fields or locations",
      "date": ""
    },
    "details": "We are looking for a highly motivated New Product Development Lead to join our team at Rubber-Cal.  The ideal candidate possesses a strong understanding of product development processes, has a keen eye for detail, and the ability to learn a large amount of product information and technical data.Responsibilities:Provide ongoing management of product assortment within categories: adding and removing styles and related imagery, updating site creative, and general auditing.Create and improve products to meet customer needs and business goals.Continuously review website information to ensure that all information is current, accurate, and relevant.Execute and maintain accuracy within assigned categories including correct product categorization, attribution, cross sells, PLP merchandising, product removal, and link management.Coordinates and uploads web content to refresh home pages and collection pages/curated shops.Assist with A/B testing setup and execution.Create, update, and optimize listings such as title, detailed description, images, prices, product specifications to accelerate product sales.Evaluate site search sorting rules and categorization strategies to facilitate an efficient site search experience to improve conversion.Analyze and update site search queries and update with relevant SKU offerings to improve customer experience and increase search engagement and performance. QualificationsBachelor’s degree in product design, engineering, industrial design or a related field.Ability to commute to our Company headquarters located in Fountain Valley, California.Strong understanding of product development processes, from ideation to commercialization.Knowledge of manufacturing processes, materials and cost optimization techniques.Strong problem-solving and analytical skills, with attention to detail.Excellent project management skills, with the ability to prioritize tasks, manage multiple projects and meet deadlines.Excellent communication and collaboration skills to work effectively with cross-functional teams.Ability to work independently and as part of a team.  About Rubber-Cal:Founded in 1994, Rubber-Cal has established itself as a trusted supplier of rubber flooring and mats, rubber sheet products, flexible ducting, fabricated gaskets, and specialty rubber parts.  The company has evolved ever since its establishment, and we continue to adapt to the ever-changing needs of our consumers and the market as a whole.  Originally, Rubber-Cal started as a producer and supplier of specialty pavement maintenance parts for street sweepers. The company then began to shift its focus by providing flexible ducting for industrial B2B applications. In 1999, Rubber-Cal began to offer rubber mats and flooring for residential, commercial, and industrial applications. The year 2007 saw a further expansion in our inventory with the addition of coir and rubber doormats to our line. As a result of our expansion over the years, Rubber-Cal has become a leading supplier of rubber flooring, ducting, doormats, and specialty parts throughout North America. www.rubbercal.comEqual Opportunity Employer Rubber-Cal is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: Rubber-Cal is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Rubber-Cal are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Rubber-Cal will not tolerate discrimination or harassment based on any of these characteristics. Rubber-Cal encourages applicants of all ages. ",
    "link": "https://cpp.joinhandshake.com/stu/jobs/9058246?ref=open-in-new-tab&search_id=0af7a555-cbe4-4d48-9fe8-037b6810cbfb"
  },
  null,
  null,
  null,
  null,
  null
]
